{"title":"Beach Boys - Today! &amp; Summer Days (And Summer Nights!!)  FLAC","uid":5558779,"size":310543246,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:002a7538e6e12fdf961c774410fd6a55541a5b17&amp;dn=Beach+Boys+-+Today%21+%26+Summer+Days+%28And+Summer+Nights%21%21%29++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"keeybee","files":40,"time":1273762741,"description":"Please seed!\n\nThe Beach Boys are an American rock band, formed in 1961, who gained popularity for their close vocal harmonies and lyrics reflecting a Southern California youth culture of cars, surfing, and romance. Brian Wilson's growing creative ambitions later transformed them into a more artistically innovative group that earned critical praise and influenced many later musicians.\nThe group was initially composed of singer-musician-composer Brian Wilson, his brothers, Carl and Dennis, their cousin Mike Love, and friend Al Jardine. This core quintet was inducted into the Rock and Roll Hall of Fame Class of 1988. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Beach_Boys&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Beach_Boys&lt;/a&gt;\n\nTrying to collect a complete, and I mean complete, discography with all Beach Boys releases seems to be almost impossible. According to Wiki there are 28 studio albums (32 with the live albums). According to AMG there are 38 albums (including live albums). The compilations seems to be countless/innumerable. And I don't even want to think of all unofficial releases.\n\nBut here's one more contribution to your collection. Enjoy!\n\n\nThe Beach Boys\nThe Beach Boys Today! originally released 1965\nSummer Days (And Summer Nights!!) originally released 1965\nThis CD 2001 (Capitol)\nAll tracks mono except tracks 26, 27 &amp; 29\nTracks 25 - 29 bonus tracks on this release\n\n01  The Beach Boys - The Beach Boys Today! - Do You Wanna Dance  \n02  The Beach Boys - The Beach Boys Today! - Good To My Baby  \n03  The Beach Boys - The Beach Boys Today! - Don't Hurt My Little Sister  \n04  The Beach Boys - The Beach Boys Today! - When I Grow Up (To Be A Man)  \n05  The Beach Boys - The Beach Boys Today! - Help Me, Rhonda (Album Version)  \n06  The Beach Boys - The Beach Boys Today! - Dance, Dance, Dance  \n07  The Beach Boys - The Beach Boys Today! - Please Let Me Wonder  \n08  The Beach Boys - The Beach Boys Today! - I'm So Young  \n09  The Beach Boys - The Beach Boys Today! - Kiss Me, Baby  \n10  The Beach Boys - The Beach Boys Today! - She Knows Me Too Well  \n11  The Beach Boys - The Beach Boys Today! - In The Back Of My Mind  \n12  The Beach Boys - The Beach Boys Today! - Bull Session With The &quot;Big Daddy&quot;  \n13  The Beach Boys - Summer Days (And Summer Nights!!) - The Girl From New York City  \n14  The Beach Boys - Summer Days (And Summer Nights!!) - Amusement Parks U.S.A.  \n15  The Beach Boys - Summer Days (And Summer Nights!!) - Then I Kissed Her  \n16  The Beach Boys - Summer Days (And Summer Nights!!) - Salt Lake City  \n17  The Beach Boys - Summer Days (And Summer Nights!!) - Girl Don't Tell Me  \n18  The Beach Boys - Summer Days (And Summer Nights!!) - Help Me Rhonda (Single Version)  \n19  The Beach Boys - Summer Days (And Summer Nights!!) - California Girls  \n20  The Beach Boys - Summer Days (And Summer Nights!!) - Let Him Run Wild  \n21  The Beach Boys - Summer Days (And Summer Nights!!) - You're So Good To Me  \n22  The Beach Boys - Summer Days (And Summer Nights!!) - Summer Means New Love  \n23  The Beach Boys - Summer Days (And Summer Nights!!) - I'm Bugged At My Ol' Man  \n24  The Beach Boys - Summer Days (And Summer Nights!!) - And Your Dream Comes True  \n25  The Beach Boys - Today! / Summer Days (And Summer Nights!!) - The Little Girl I Once Knew (Single) (Bonus Track)  \n26  The Beach Boys - Today! / Summer Days (And Summer Nights!!) - Dance, Dance, Dance (Alternate Take) (Bonus Track)  \n27  The Beach Boys - Today! / Summer Days (And Summer Nights!!) - I'm So Young (Alternate Take) (Bonus Track)  \n28  The Beach Boys - Today! / Summer Days (And Summer Nights!!) - Let Him Run Wild (Alternate Take) (Bonus Track)  \n29  The Beach Boys - Today! / Summer Days (And Summer Nights!!) - Graduation Day (Studio Version) (Bonus Track)","torrent":{"xt":"urn:btih:002a7538e6e12fdf961c774410fd6a55541a5b17","amp;dn":"Beach+Boys+-+Today%21+%26+Summer+Days+%28And+Summer+Nights%21%21%29++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"002a7538e6e12fdf961c774410fd6a55541a5b17","infoHashBuffer":{"type":"Buffer","data":[0,42,117,56,230,225,47,223,150,28,119,68,16,253,106,85,84,26,91,23]},"announce":[],"urlList":[]}}