{"title":"Darkwing Duck","uid":7265031,"size":472489270,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:00bdda4da29dfe5a8e3ed94fe375dd985a651c8a&amp;dn=Darkwing+Duck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":-1,"time":1336855616,"description":"Darkwing Duck is an American animated television series produced by The Walt Disney Company that ran from 1991-1992 on both the syndicated programming block The Disney Afternoon and Saturday mornings on ABC. It featured the eponymous anthropomorphic duck superhero whose alter ego is mild-mannered single parent Drake Mallard. \n\nThis comic starts a year after the last public appearance of Darkwing Duck (at the end of the above-mentioned cartoon), the city of St. Canard is in the firm grip of the mega-corporation Quackwerks. The company controls nearly every aspect of the city, and employs the majority of its citizens. Crime has been nearly eradicated due to the Crimebots, Quackwerk's robotic police force.\n\nDarkwing Duck himself, in his civilian guise of Drake Mallard, is employed in one of Quackwerk's many offices, alongside Elmo Sputterspark, the former villain known as Megavolt. Retired from crime fighting, and having had a falling out with his former partner Launchpad McQuack, Drake was forced to take on the job in order to pay the tuition for his daughter Gosalyn's private school. However, the drudgery of office work and yearning for his old superhero days has left him depressed. When Gosalyn's best friend Honker Muddlefoot is assaulted and arrested by the Crimebots for illegally downloading music (from Hannah Alaska), she convinces her father to once again don the Darkwing costume in order to investigate Quackwerks, and their now over zealous robots.","torrent":{"xt":"urn:btih:00bdda4da29dfe5a8e3ed94fe375dd985a651c8a","amp;dn":"Darkwing+Duck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00bdda4da29dfe5a8e3ed94fe375dd985a651c8a","infoHashBuffer":{"type":"Buffer","data":[0,189,218,77,162,157,254,90,142,62,217,79,227,117,221,152,90,101,28,138]},"announce":[],"urlList":[]}}