{"title":"A Lawyer Presents the Evidence for the Afterlife - Victor Zammit","uid":8724996,"size":3702156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00d20a1fb3853990bc15f827781c15bbc32097f5&amp;dn=A+Lawyer+Presents+the+Evidence+for+the+Afterlife+-+Victor+Zammit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flexy321","files":5,"time":1374501663,"description":"A Lawyer Presents the Evidence for the Afterlife \n\nVictor Zammit Wendy Zammit\n\nEPUB/MOBI Ebook - Converted from PDF\n\n\nBody; Mind &amp; Spirit, ESP (Clairvoyance; Precognition; Telepathy), General, Parapsychology, Spiritualism, Spirituality\n\nDESC:\n\nThere could be many reasons why you are interested this book. Perhaps you are just curious about the afterlife. Or perhaps you have experienced the death of a loved one. It may be that you have had an out of body experience or a near death experience or another mystical experience. Or you may be realizing that we all inevitably have to make the journey to the afterlife one day. If you have been trained to respect scientific method you will not just accept tradition or wishful thinking. You want something that can be supported by evidence. You want highly reliable information as to whether or not we continue to live in the afterlife. And you want to know whether it is possible to get a message from your loved ones. You want to know that the things people report about the afterlife are real and can be validated. You want hard, repeatable evidence that no one can rebut. You want witnesses, scientists, professionals and others with the highest credibility. You want to feel that the information you are receiving about the afterlife is the truth, the whole truth. And you may want something that you can share with friends and family members to show that there are good scientific reasons for accepting that there is more to life than the materialists claim. \n\nThis book presents highly convincing evidence amounting to proof for the existence of the afterlife. It shows that after investigating the evidence some of the most brilliant men and womenâŽ¯scientists and othersâŽ¯came to the conclusion that we all survive death. The mediums and psychics studied by scientists were of course exceptional. They were the best of the best. People should be aware that not all psychics and mediums are developed to this degree and people take care in choosing a medium. \n\nOver the last ten years an earlier version of this book has been accessed on our website free of charge by more than a million people from all over the world. Volunteers who loved the earlier book translated it into Spanish, Italian, Portuguese, Russian, Dutch, German, French and Russian. Every day we receive emails from people who say that the material in this book has changed their lives. After so many years we have decided that it is time to take the Evidence for the Afterlife to a wider audience. This new and expanded version includes important new research and the latest discoveries. But once again it concentrates on evidence that is credible, repeatable and admissible in a court of law. The book gives an introduction to more than twenty different areas of evidence for the afterlife giving you the key facts and references. The chapters can be read in any order. We have tried to make it accessible to as many people as possible by writing in plain English, using short sentences and familiar vocabulary. \n","torrent":{"xt":"urn:btih:00d20a1fb3853990bc15f827781c15bbc32097f5","amp;dn":"A+Lawyer+Presents+the+Evidence+for+the+Afterlife+-+Victor+Zammit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d20a1fb3853990bc15f827781c15bbc32097f5","infoHashBuffer":{"type":"Buffer","data":[0,210,10,31,179,133,57,144,188,21,248,39,120,28,21,187,195,32,151,245]},"announce":[],"urlList":[]}}