{"title":"Silent Weapons for Quiet Wars - An Introduction Programming Manu","uid":3646979,"size":3219173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:013f09a96508fd013ed72c842232595ec2486387&amp;dn=Silent+Weapons+for+Quiet+Wars+-+An+Introduction+Programming+Manu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KenaKai","files":1,"time":1174814677,"description":"This is the mindblowing Operations Research Technical Manual TW-SW7905.1 better known as Silent Weapons for Quiet Wars - An Introduction Programming Manual which basically explains how the whole economy can be represented as a series of interconnected electronic circuits and that consequently all the people of the planet can be controlled like any other electronic component. The manuscript was apparently used in private sessions in army and bussiness circles so the elite would know how it all works together and could cleverly hide these same techniques in innocent-looking electronics textbooks. It has been authenticated by four different technical writers for Military Intelligence, one just recently retired who wants very much to have this manual distributed throughout the world, and one who is still employed as an Electronics Engineer by the Federal Government, and has access to the entire series of Training Manuals. One was stationed in Hawaii, and held the highest security clearance in the Naval Intelligence, and another who is now teaching at a university, and has been working with the Central Intelligence Agency for a number of years, and wants out before the axe falls on the conspirators. They believed that the entire world should know about this plan to ask individuals at top level positions their opinions. The consensus opinion was to distribute this to as many people as who wanted it, to the end that they would not only understand that a \\&quot;silent war\\&quot; had been declared against them, but would be able to properly identify the true enemy to humanity. Extended edition with technical diagrams. 40 pages. A must read for everyone. \n","torrent":{"xt":"urn:btih:013f09a96508fd013ed72c842232595ec2486387","amp;dn":"Silent+Weapons+for+Quiet+Wars+-+An+Introduction+Programming+Manu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"013f09a96508fd013ed72c842232595ec2486387","infoHashBuffer":{"type":"Buffer","data":[1,63,9,169,101,8,253,1,62,215,44,132,34,50,89,94,194,72,99,135]},"announce":[],"urlList":[]}}