{"title":"Encyclopedia of Twentieth-Century Photography (Malestrom)","uid":4778751,"size":31631960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02353cccf9e937adbc87c83ee82309111f9c01f2&amp;dn=Encyclopedia+of+Twentieth-Century+Photography+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1237308615,"description":" &lt;a href=&quot;http://www.image-upload.net/images/2ed621c07ff8jc8dz6bh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/2ed621c07ff8jc8dz6bh.jpg&lt;/a&gt;\n\nHardcover: 1849 pages\nPublisher: Routledge (January 2006)\nLanguage: English\nISBN-10: 0415976650\nISBN-13: 978-0415976657\n\nFrom Booklist\nIn these alphabetically arranged volumes, Warren, along with 227 contributors, strives to &quot;provide a useful resource on the entire scope of photography in the twentieth century.&quot; The set has an international reach, and 324 of its 525 entries cover people, mostly photographers. The remaining articles, as outlined in the thematic list of entries, cover &quot;Equipment&quot; (Camera: Digital; Enlarger); &quot;Institutions, Galleries, and Collections&quot; (Museum of Modern Art); &quot;Publications and Publishers&quot; ( National Geographic); &quot;Regions&quot; ( Mexico, photography in); and &quot;Topics and Terms&quot; ( Contact printing, Industrial photography, Photographic &quot;truth&quot;). Some articles, such as Camera: An overview, offer surveys on broad topics. Other, such as C able release, zero in on specifics.\n\nArticles on equipment tend to describe features and operation rather than historical development. Other types of entries, such as those on publications, regions, and photographic genres, provide a more historical overview. Many articles are 2 to 3 pages long, with some entries spanning 8 pages or more (e.g., Museums: Europe is 13 pages). The signed articles conclude with see also references and lists of further readings. Entries on people can include additional reference categories such as individual exhibitions, group exhibitions, books of photographs, and selected works (e.g., notable photographs). Also, readers can quickly scan a person's biographical highlights--entries on people include a capsule biography.\n\nThe alphabetical and thematic lists of entries, set index, and a 10-page glossary are repeated in each volume. Less helpful is a list of contributors without affiliations. Each volume also contains about 100 black-and-white photographs along with an 8-page glossy insert. Picture quality is fair. Warren states, &quot;This is a work of scholarship, a book intended to be read rather than viewed,&quot; and some readers will be disappointed.\n\nThe Oxford Companion to the Photograph (2005) covers a longer time period, has more than 1,600 entries, and reviews about 800 photographers and other persons. However, most articles are much shorter and include fewer references. The Encyclopedia of Twentieth-Century Photography should prove useful for academic and larger public libraries. Stephen Fadel","torrent":{"xt":"urn:btih:02353cccf9e937adbc87c83ee82309111f9c01f2","amp;dn":"Encyclopedia+of+Twentieth-Century+Photography+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02353cccf9e937adbc87c83ee82309111f9c01f2","infoHashBuffer":{"type":"Buffer","data":[2,53,60,204,249,233,55,173,188,135,200,62,232,35,9,17,31,156,1,242]},"announce":[],"urlList":[]}}