{"title":"Krabat (2010 Videotheek) DVDR 2Lions-Team","uid":5338108,"size":4651653780,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:027063d44952cf073d3fb5c92b9705b962924f5e&amp;dn=Krabat+%282010+Videotheek%29+DVDR+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Pioen","files":-1,"time":1265381666,"description":"Krabat (2008) \n\nAlternatieve titel: Krabat - De Meester van de Zwarte Molen \t       \n\n\n\nVanaf 9 februari in de videotheek\n\n\n\n\nDuitsland\nDrama / Fantasy\n120 minuten\n\ngeregisseerd door Marco Kreuzpaintner\nmet David Kross, Christian Redl en Daniel BrÃƒÂ¼hl\n\nWas het toeval dat Krabat als leerling op de molen kwam, diep in de sombere bossen van Bohemen? De molen blijkt een school van de zwarte kunsten te zijn. De molenaar is Meester in de toverkunst. Twaalf knechten heeft hij: twaalf leerlingen. Weglopen kunnen ze niet, want de toverkunsten van de Meester zorgen ervoor dat de weg ze steeds weer naar de molen terug leidt. Krabat vlucht dan ook niet. Hij kiest een andere weg, gesteund door de liefde van een meisje.\n\nEnglish\n\n&quot;Krabat&quot; is based on the German novel of the same name by Otfried PreuÃƒÅ¸ler.\n\nWhen the Plague sweeps across Europe, a young man named Krabat (David Kross of &quot;The Reader&quot;) is left without family, food, or hope. An old Mill Keeper takes him in offering the basic necessities in exchange for grueling hard work with other young men. An excursion with fellow worker, Tonda (Daniel BrÃƒÂ¼hl of &quot;Inglorious Basterds&quot;) leads to a chance meeting with a pretty girl in the nearby village and affections grow. A veil of secrecy remains shrouded over the mill. Eventually, after proving his obedience, Krabat learns that the Mill Keeper holds them all there with something more seductive than food and shelter. The boys are being trained in the dark art of sorcery. The magic is intoxicating and gives Krabat his first taste of real power.\n\nAs he is taken into the fold, Tonda warns him, &quot;Everything in this world has its price&quot;. He discovers that to be involved in the magic at the mill one must have no outside friends, no girlfriends, and no choices beyond what the Master chooses for you. As the magic becomes increasingly dark and more secrets are revealed, Krabat tries to escape only to discover too late he can never leave.\n\nThere is one small hope but if Krabat fails it will not only be the end for him but all he cares for. \n\n\nType disc: DVD 5 ISO\nGenre: Drama / Fantasy\nRegio: 0\nJaar van uitgave: 2008\nRegisseur: Marco Kreuzpaintner\nUitgever: 20th Century Fox / Video Film Express\nSpeelduur: 120 minuten \nLeeftijd: 9 Jaar\nActeurs: David Kross, Christian Redl en Daniel BrÃƒÂ¯Ã‚Â¿Ã‚Â½hl\n\n- Geluid sporen aanwezig: Dolby Digital 5.1 - Duits / Dolby Digital 5.1 - Engels\n- Geluid sporen verwijderd: Geen\n- Ondertiteling: Nederlands\n- Video: CCE8\n- Menu: Ja, en aangepast waar nodig.\n- Extra's: Verwijderd\n \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nFantasiefilm\n \nWeblink : http://www.moviemeter.nl/film/41127\nWeblink : http://www.imdb.com/title/tt0772181\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n            &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!  \n\n\n \n\n \n \n \n","torrent":{"xt":"urn:btih:027063d44952cf073d3fb5c92b9705b962924f5e","amp;dn":"Krabat+%282010+Videotheek%29+DVDR+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027063d44952cf073d3fb5c92b9705b962924f5e","infoHashBuffer":{"type":"Buffer","data":[2,112,99,212,73,82,207,7,61,63,181,201,43,151,5,185,98,146,79,94]},"announce":[],"urlList":[]}}