{"title":"Angry Birds v3.3 Cracked GAME-ErES","uid":8972293,"size":101973932,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:02ea5290cf6214ab47d924c5fdc2e2063e6e8bf9&amp;dn=Angry+Birds+v3.3+Cracked+GAME-ErES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1380355625,"description":"Angry.Birds.v3.3.Cracked.GAME-ErES\n\nE X T R A O R D i N A R Y r E V E R S E E N G i N E E R i N G S Q U A D\n\nnfo:\nph0!SiLK\n\nReaching for\nperfection...\n\nRelease Information\n\n-Name : Angry Birds\n-Version : v3.3\n-Website URL : a class=&quot;linky&quot; rel=&quot;nofollow&quot; target=&quot;_blank&quot;\n-Operating System: WinAll\n-CPU Architecture: -\n\n-Release type : Cracked\n-Cracker : Obama Binary Laden\n-Protection : Activation / .NET\n\n-Release Date : 2013.09.21\n-Filename Prefix : eanberd\n-Disk(s) : 11\n\nRelease Description\n\nSquawk!\n\nThe survival of the Angry Birds is at stake. Dish out revenge on\nthe green pigs who stole the Birds eggs. Use the unique powers of\nthe Angry Birds to lay waste to the pigs confounding construc-\ntions. Angry Birds features challenging, physics-based demolition\ngameplay with hours and hours of replay value. Each of the 240+\nlevels requires logic, skill, and brute force to crush the enemy.\n\nMinimum System Requirements\n\nOS: Windows 7 / Vista / XP SP3\nCPU: 1.0 GHz\nRAM: 512 MB\nHard Drive: 60 MB\nGraphics: Any OpenGL 1.3 compatible device\nInternet connection required for activation and updates\n\nRelease Notes\n\n- Unpack\n- Install\n- Copy the crack to install directory\n- Run the game\n- Block the game in firewall\n- Choose to activate the full game\n- When asked for serial enter: ERES-ERES-ERES-ERES\n- Play!\n\nPiracy Policy\n\nReverse engineering is our religion and our .nfo is our digital\ngraffiti. The way some others play chess or climb mountains, we\nreverse. To us this is a sport/competition, nothing more. And s-\nince time is money, we are actually losing money doing this - have\nno illusions.\n\nThis software is intended solely for (extended) evaluation purpos-\nes and made available exclusively for a closed circle of mutual\ncontributors, also known as the scene. If the people inside this\nclosed group really like this software we strongly encourage them\nto buy it.\n\nWe cannot be held responsible for any possible leak, only the per-\nson leaking can. We absolutely do not condone the spreading of\nthis release outside this small group of mutual contributors. Any\nsuch act should be considered a breach of our intentions, and in\nany case piracy the way it looks nowadays has to be hunted down\ncase by case, copy by copy. If you want to try to sue the whole\nworld - be our guest!\n\nShould this not be enough, we do not reside in countries that im-\npose the USA-way of interpreting things. Your (often) fucked up\nlaws do not apply here, believe it or not. You are the ones under\ninvestigation, and not for trifle schoolboy pranks but for really\nserious infringements!\n\nThe USA-way of doing things has lately proven to be what it always\nhas been: a hemorrhoid in the arse for the rest of the globe. You\nare the ones who should be under arrest - if any. But your exper-\ntise in shifting attention to what is really not the deal is im-\npressive, as usual.\n\nYou might be watching us, but we are also watching you...\n\nErES - Group Information\n\nIt's been over four years since ErES was established, and now, as\nwe did then, we maintain the core principle that the group should\noperate akin to a family - where each individual is valued more\nthan the skills they provide.\n\nWe aren't, unlike many other groups mechanical in nature - a 're-\nlease machine', and we never intend to be; rather, we value the\nfriendship and learning experience that being part of a 0DAY group\noffers much more than striving to pre the most releases each\nmonth.\n\nIf ErES is a family you think you'd like to be a part of, you may\ncontact us using TORChat, our ID is: eresgrpmg2qjznqw, a response\nisn't guaranteed to be immediate, or given at all.\n\nWe are currently looking for:\n- Experienced crackers/keygenners for all Operating Systems;\n- Skilled coders;\n- Quality suppliers;\n- Good 100Mbit+ EU &amp; Asia sites to affil with;\n- Anything else you think we might like!\n\nWe are NOT (and never will be) looking for:\n- Money/suppliers that think they can buy access to the scene;\n- Rented sites to affil with.\n\nascii/nfo:...........ph0!SiLK updated:............2013.09.11","torrent":{"xt":"urn:btih:02ea5290cf6214ab47d924c5fdc2e2063e6e8bf9","amp;dn":"Angry+Birds+v3.3+Cracked+GAME-ErES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02ea5290cf6214ab47d924c5fdc2e2063e6e8bf9","infoHashBuffer":{"type":"Buffer","data":[2,234,82,144,207,98,20,171,71,217,36,197,253,194,226,6,62,110,139,249]},"announce":[],"urlList":[]}}