{"title":"The Revised Fundamentals of Caregiving - Jonathan Evison.epub","uid":9304316,"size":567408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:035935976241d56e63893484f3d2fba8532feaed&amp;dn=The+Revised+Fundamentals+of+Caregiving+-+Jonathan+Evison.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1386291002,"description":"Benjamin Benjamin has lost virtually everything, his wife, his family, his home, his livelihood. With few options, Ben enrolls in a night class called The Fundamentals of Caregiving, where he is instructed in the art of inserting catheters and avoiding liability, about professionalism, and on how to keep physical and emotional distance between client and provider.\n\nBut when Ben is assigned to tyrannical nineteen-year-old Trevor, who is in the advanced stages of Duchenne muscular dystrophy, he soon discovers that the endless mnemonics and service plan checklists have done little to prepare him for the reality of caring for a fiercely stubborn, sexually frustrated adolescent with an ax to grind with the world at large.\n\nThough begun with mutual misgivings, the relationship between Trev and Ben evolves into a close camaraderie, and the traditional boundaries between patient and caregiver begin to blur as they embark on a road trip to visit Trevor's ailing father. A series of must-see roadside attractions divert them into an impulsive adventure interrupted by one birth, two arrests, a freakish dust storm, and a six-hundred-mile cat-and-mouse pursuit by a mysterious brown Buick Skylark.\n\nBursting with energy, this big-hearted and inspired novel ponders life's terrible surprises and the heart's uncanny capacity to mend.","torrent":{"xt":"urn:btih:035935976241d56e63893484f3d2fba8532feaed","amp;dn":"The+Revised+Fundamentals+of+Caregiving+-+Jonathan+Evison.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035935976241d56e63893484f3d2fba8532feaed","infoHashBuffer":{"type":"Buffer","data":[3,89,53,151,98,65,213,110,99,137,52,132,243,210,251,168,83,47,234,237]},"announce":[],"urlList":[]}}