{"title":"Saving Grace (2000)Comedy[NL subs] [NLtoppers][FilmSpot]","uid":7319038,"size":1780433976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:039137db5ade8cf9a71fe983079e0f4c80b8a3ba&amp;dn=Saving+Grace+%282000%29Comedy%5BNL+subs%5D+%5BNLtoppers%5D%5BFilmSpot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chamond42","files":-1,"time":1338571331,"description":"Saving Grace (2000)Comedy[NL subs] [NLtoppers][FilmSpot]\n\nDistributie: Portman Entertainment Group, Sky Pictures, WAVEpictures (United Kingdom)\nIMDb: http://www.imdb.com/title/tt0195234/\nIMDb rating: 6,8/10\n\nKomedie/Crime release datum: 25 oktober 2000\nRuntime:93 min \n\n\nNadat de echtgenoot van Grace zelfmoord heeft gepleegd ontdekt ze dat hij voor hun mooie huis veel had geleend en een zeer hoge hypotheek had. \nGrace doet alle moeite om haar huis te behouden omdat ze de leningen niet kan afbetalen. \nZe kan niet gaan werken want ze heeft geen ervaring met om het even welk werk, het enige dat ze kan is tuinieren. \nMatthew, die zijn eigen Marihuana plantage heeft, vraagt raad aan Grace omdat zijn planten niet groeien. Grace beslist om ook Marihuana plantjes te gaan planten om zo geld te verdienen. Nadat ze de ongelooflijke goede en mooie planten krijgt beslist ze om zelf in Londen een koper te vinden met als gevolg dat ze in het drugsmilieu terecht komt.\nDaar volgen de situaties elkaar snel op.\n\n \nCategorie.......... Drama\nSource............. DVDRip\nRuntime............ 44:01 minutes\nSize............... 820 MB\nForm............... DivX AVI\nResolution......... 720x576\nFrames/s........... 25\nAudio Language..... English\nAudio code......... 2 Stereo 44kHz\nSubtitles: Dutch - Nederlands\n\nSome of the marijuana plants used in the shooting were real. The British government gave permission to the filming crew the use of 150 marijuana plants, under supervision of the authorities. This meant that the plants had someone guarding them on the set, and watching over its transportation to a nearby storage facility for its safekeeping at night.\n\nA widow discovers after her husband's suicide that he has mortgaged everything they own and the banks are ready to foreclose. Faced with impending doom and little working knowledge except her ability to grow plants, she struggles to save her home. Enter her gardener, who is struggling to make a few marijuana plants grow in a hidden location and suggests that she use her green house to help grow the plants and sell them to make the money both need. While supposedly working, the whole village including the local constable is well aware of the endeavor and is hoping for their success. When the plants come in, Grace takes the crop to London and tries to sell it to a ruthless, but charming drug dealer. Everything busts loose from there.","torrent":{"xt":"urn:btih:039137db5ade8cf9a71fe983079e0f4c80b8a3ba","amp;dn":"Saving+Grace+%282000%29Comedy%5BNL+subs%5D+%5BNLtoppers%5D%5BFilmSpot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"039137db5ade8cf9a71fe983079e0f4c80b8a3ba","infoHashBuffer":{"type":"Buffer","data":[3,145,55,219,90,222,140,249,167,31,233,131,7,158,15,76,128,184,163,186]},"announce":[],"urlList":[]}}