{"title":"Terror Inc","uid":7354881,"size":560973915,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:052e2b83acd0ba9286b37d6c694215ba126b763f&amp;dn=Terror+Inc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":-1,"time":1339727903,"description":"Meet Mr. Terror -- he's dapper, he's charming, he owns and operates his own VERY successful business ... and, oh yeah, he's fifteen and a half centuries old and rotting fast.\nDoomed to decompose for all eternity, Terror forever replaces his festering limbs with fresh parts. The curse keeps him alive, but it's what's left of his twelfth-century sweetheart -- encased in enchanted metal and serving as his right arm -- that keeps him honest.\n\nToday, Terror runs a high-stakes private eye firm -- espionage, investigations and assassinations for the extremely rich and extremely powerful.\n\nTerror Inc. is an American comic-book horror series from Marvel Comics starring the antihero Terror. Terror is an eternal entity that absorbs the talents of others through their dismembered limbs. He was created by writers Dan Chichester and Margaret Clark and artist Klaus Janson as the villain Shreck in St. George #2 (Aug. 1988), from Marvel's Epic Comics imprint, specifically the Shadowline Saga.\n\nHowever, since the Shadowline world is actually Earth-88194, which never had any superheroes, I won't be posting those. Instead, you get all (kinda, see below) of Terror's exploits in the Earth-616 universe. AKA the &quot;real&quot; Marvel Earth.\n\nTorrent contains:\nTerror Inc. v1 1-13\nTerror Inc. v2 1-5\nTerror Inc Apocalypse Soon 1-5\n\nThat's the main stuff. Then there's:\n... Along Comes Terror (Wolverine v2 58-59)\nPunisher &amp; Captain America - Blood &amp; Glory 1-3\nDead Man's Hand (9 part crossover of Daredevil, Nomad, Punisher)\nFor the Love of Money (6 part crossover of Terror, Cage, and Silver Sable) The 2 terror books are dupes, skip 'em if you want\nLeague of Losers (Marvel Team-Up 15-18)\nRevelations (Nick Fury 46)\nHis Earth-616 debut (Daredevil 305)\n\nI even threw in his single image appearances in Beyond 3, Infinity Crusade 6, Deadpool &amp; GLI - Summer Fun Spectacular, and his most recent OHOTMU entry. Reading the text may spoil the books for you though, be warned.","torrent":{"xt":"urn:btih:052e2b83acd0ba9286b37d6c694215ba126b763f","amp;dn":"Terror+Inc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"052e2b83acd0ba9286b37d6c694215ba126b763f","infoHashBuffer":{"type":"Buffer","data":[5,46,43,131,172,208,186,146,134,179,125,108,105,66,21,186,18,107,118,63]},"announce":[],"urlList":[]}}