{"title":"Guns N' Roses - G N R Lies (1989) WMA320","uid":6064647,"size":86806200,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:06063b379971cc417952e02d8b5aa8bccd431bdf&amp;dn=Guns+N%5C%27+Roses+-+G+N+R+Lies+%281989%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1293294040,"description":"While Guns N' Roses debut album &quot;Appetite for Destruction&quot; (1987) initially failed to make a major impact, over the course of a few months, with singles like &quot;Welcome to the Jungle&quot; and &quot;Sweet Child `O Mine,&quot; almost overnight, Guns N' Roses became the biggest band on the planet. \n\nTo capitalize on the band's success, Geffen re-released Guns N' Roses first release, the &quot;Live like a Suicide&quot; (1986) EP along with four new recordings. Together, these eight songs made up Guns N' Roses second album &quot;GN'R Lies&quot; (1988). \n\n&quot;Live Like a Suicide&quot; had been released one year before &quot;Appetite&quot; as a way for Geffen to introduce Guns N' Roses to the public. Although it was released under the &quot;Uzi Suicide&quot; label, that was just a front for Geffen. It was thought that if the EP had been released under an indie label it might have given the band added street cred. And while &quot;Live Like a Suicide&quot; is supposed to be a live album, that's not really the case. Crowd noise was added to the recordings, to which singer Axl Rose would later decry as &quot;contrived.&quot; \n\nWhile &quot;Live Like a Suicide&quot; or &quot;side A&quot; of &quot;GN'R Lies&quot; isn't as powerful as AFD, these are still great songs. While they may not have been recorded in front of an audience, they still have a live sound as they don't sound overproduced or have a lot over overdubs. Hopefully, however, one day &quot;GN'R Lies&quot; will be re-released without the faux crowd noise. \n\nThe opening &quot;Reckless Life,&quot; featuring Rose's mightily signature wail and Slash's signature screeching solos, can be seen as a precursor to &quot;Welcome to the Jungle.&quot; Rose Tattoo's &quot;Nice Boys&quot; is another fine hard-rocker and follows nicely. An early GN'R classic and the best song on &quot;Live Like a Suicide,&quot; the groove-laden swagger of &quot;Move to the City&quot; has a clear element of vintage Aerosmith. A cover of Aerosmith's &quot;Mamma Kin&quot; is good, if not great. \n\nThe second half of &quot;GN'R Lies&quot; consists of four new acoustic recordings, demonstrating early on how versatile GN'R were. The Izzy Stradlin penned &quot;Patience&quot; is just plain terrific. A gorgeous balled, it's not overdone or overly sentimental, yet shows a sensitive side to the band none-the-less. &quot;Used to Love Her&quot; a song about killing your wife/girlfriend is one of the band's more misunderstood songs. As Rose states in &quot;Live Era&quot; (1999) while introducing the song, it's just a joke, a fantasy. \n\nThe country-esque &quot;Your Crazy&quot; is an acoustic version of the same song released a year before on &quot;Appetite.&quot; While the &quot;fast&quot; AFD version of &quot;Your Crazy&quot; is probably the album's weakest song, the slower version on &quot;GN'R Lies&quot; is one of GN'R best recordings. \n\nGuns N' Roses most controversial song, &quot;One in a Million&quot; closes out the album. This is the song that Axl Rose/Guns N' Roses detractors single-out when they refer to either Rose or Guns N' Roses as racist and/or homophobic. Listening to the song, it's easy to see why the song generated a storm of controversy upon its release. However, to simply condemn Rose and GN'R would be simplistic and a knee-jerk reaction. \n\nDoes &quot;One in a Million&quot; have racist, xenophobic and homophobic undertones? Yes. Is Axl Rose a white supremacist that hates gays? No. Essentially, the song is a gritty, honest confessional taken from the perspective of an ignorant young man who has grown up in Indiana his whole life, and upon arriving to LA, has negative experiences with blacks and gays. It's a song from the perspective of how Rose felt at the time and it doesn't reflect his current world-view. \n\nOverall, GN'R's &quot;Appetite For Destruction&quot; and &quot;Use Your Illusion I&quot; and &quot;Use Your Illusion II&quot; (both 1991) may be more satisfying than &quot;GN'R Lies&quot; but this album still contains many gems and is overall a great collection of songs. This CD is also recommended for fans that didn't care for the more artistic leanings of &quot;Use Your Illusion&quot; but like the rawness of AFD. \n\nby Daniel Maltzman\n\nTRACKLIST:\n\n01 - Reckless Life.wma                            \n02 - Nice Boys.wma                                \n03 - Move To The City.wma                         \n04 - Mama Kin.wma                                 \n05 - Patience.wma                                 \n06 - Used To Love Her.wma                         \n07 - You're Crazy.wma                             \n08 - One In A Million.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:06063b379971cc417952e02d8b5aa8bccd431bdf","amp;dn":"Guns+N%5C%27+Roses+-+G+N+R+Lies+%281989%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06063b379971cc417952e02d8b5aa8bccd431bdf","infoHashBuffer":{"type":"Buffer","data":[6,6,59,55,153,113,204,65,121,82,224,45,139,90,168,188,205,67,27,223]},"announce":[],"urlList":[]}}