{"title":"Democracy Now - 31 jan 2012","uid":7000327,"size":457743222,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:07420478557e6f60bf4f3ccc30d9f7ad95566d2d&amp;dn=Democracy+Now+-+31+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328032693,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 31, 2012\n\n- Syria: Russia Opposes U.N. Resolution Against Assad\n- Report: 13,000 Pro-Romney Ads Aired in Florida, 200 For Gingrich\n- Gingrich: We Need A Government That Respects &quot;Our Religion&quot;\n- Obama Defends Drone Strikes, Denies Civilian Toll\n- Suspected U.S. Drone Kills 13 in Yemen\n- Haiti's &quot;Baby Doc&quot; Will Stand Trial for Corruption, Not for Murders\n- Despite Eviction Order, Occupy D.C. Protesters Remain in Parks\n- Belgian Workers Hold General Strike to Protest E.U. Meeting\n- Drought in Mexico Leaves Two Million Without Water\n- East Haven's Top Cop Announces Retirement After Racial Bias Arrests\n- Tennessee Lawmaker Threatens to &quot;Stomp&quot; Transgender People\n\n\nSpecial reports\n\n- Taxpayer-Funded Freddie Mac Caught Betting Billions Against Struggling American Homeowners\n\nAs homeowners across the nation struggle to keep up with mortgage payments-and in the worse cases face foreclosure-a new investigation reveals that taxpayer-owned mortgage giant, Freddie Mac, made multi-billion-dollar investments that profited if borrowers stayed stuck in high-interest mortgages. Freddie Mac began increasing these investments dramatically in late 2010, at the same time it was making it harder for homeowners to get out of such mortgages. Several U.S. lawmakers and prominent economists are now calling for Congress and the White House to end this financial conflict of interest. This comes just one week after President Obama promised &quot;no more red tape&quot; for homeowners looking to refinance. We speak with Jesse Eisinger, a Pulitzer Prize-winning senior reporter at ProPublica, who co-authored the investigative report with NPR news.\n\n\n- Ex-Marine Re-Occupies His Own Foreclosed Home in Fight Against Freddie Mac, JPMorgan Chase\n\nAs Freddie Mac comes under scrutiny for betting billions on investments that profit if homeowners they issued loans to are locked into high interest mortgages, we speak with Arturo de los Santos, a U.S. Marine veteran who was evicted last year in Riverside, California, after Freddie Mac and JP Morgan Chase foreclosed on his house last June. &quot;We were trying to get the bank's attention to review our case again. We could not believe that after they had evicted us, they modified our loan,&quot; de los Santos says. &quot;I called them and I told them, 'I thought we were doing the loan modification.' And they go, 'Well, we have a Loan Modification department and a Foreclosure department, and the Foreclosure department decided to sell the house.' So they sold the house.&quot; De los Santos and his family re-occupied their home in December with help from the Occupy movement, but face eviction again this week.\n\n\n- &quot;The House I Live In&quot;: New Documentary Exposes Economic, Moral Failure of U.S. War on Drugs\n\nThis weekend the top documentary prize at the Sundance Film Festival went to &quot;The House I Live In,&quot; which questions why the United States has spent more than $1 trillion on drug arrests in the past 40 years, and yet drugs are cheaper, purer, and more available today than ever. The film examines the economic, as well as the moral and practical, failures of the so-called &quot;war on drugs,&quot; and calls on the United States to approach drug abuse not as a &quot;war,&quot; but as a matter of public health. We need &quot;a very changed dialogue in this country that understands drugs as a public health concern and not a criminal justice concern,&quot; says the film's Director Eugene Jarecki. &quot;That means the system has to say, 'We were wrong.'&quot; We also speak with Nannie Jeter, who helped raise Jarecki as her own son succumbed to drug addiction and is highlighted in the film. We air clips from the film, featuring Michelle Alexander, author of &quot;The New Jim Crow;&quot; Canadian physician and bestselling author, Gabor MatÃƒÂ©; and David Simon, creator of &quot;The Wire.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:07420478557e6f60bf4f3ccc30d9f7ad95566d2d","amp;dn":"Democracy+Now+-+31+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07420478557e6f60bf4f3ccc30d9f7ad95566d2d","infoHashBuffer":{"type":"Buffer","data":[7,66,4,120,85,126,111,96,191,79,60,204,48,217,247,173,149,86,109,45]},"announce":[],"urlList":[]}}