{"title":"Command &amp; Conquer RA (With CS and AM) (Works on Xp Vista N 7","uid":6832642,"size":268042906,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0777cda73fe2796194289617cc8e6e26c88636d1&amp;dn=Command+%26amp%3B+Conquer+RA+%28With+CS+and+AM%29+%28Works+on+Xp+Vista+N+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FuCtUpPuNk","files":6,"time":1321920073,"description":"INSTALLATION:\n0. Firstly I recommend an update of directx, or else you can have occassional freezeups if you are unlucky, I had that. You can do that ate.g.\n\n\n1. Now run FullRA+ Setup.exe (if you have vista or xp then install it only from the vista xp folder, if you have 7 install from only the 7 folder)\n\n2. Install in default directory (C:\\Westwood\\RA+)\n\n3. Uncheck &quot;kali setup&quot; and &quot;RA-dos&quot; if you are not a hard core gamer...\n\n4. Uncheck &quot;read1st guide&quot;, you can read it later on, click &quot;finish&quot; (running RA plus 3.03...)\n\n5. Install Westwood shared Internet Components in default directory (c:\\westwood\\internet),\nclick &quot;ok&quot;\n\n6. Now you get an error message &quot;Unexpected error creating register...&quot;\n\n7. Never mind, click &quot;ok&quot;\n\n8. Another error message &quot;Installation of share...&quot;\n\n9. Never mind, click &quot;ok&quot;\n\n10. Go to your installation directory, &quot;c:\\westwood\\RA+&quot;, and rightclick on the RA95.exe-file, goto the compatibilty tab, set &quot;Run in 256 colors&quot; and &quot;Run in 640x480 resolution&quot;, (let the win98 compatiblity be)\n\n11. Copy all 4 files in the directory &quot;Files to copy to your installtion directory&quot; to &quot;c:\\Westwood\\RA+&quot; and replace\n\n12. Now that's it!\n\nRun the game by first clicking on the TaskAssign.exe and let it be in the background,\nand now by clicking on the &quot;RA95.exe&quot; file\n\nIf the colors are messy run &quot;explorer killer.bat&quot;, and that will do the trick!\n\n\n-------------------------\n-------------------------\n-------------------------\nGAMEPLAY:\nRed Alert was praised for its user interface, which claimed to be more developed than the competing games of its time. Players could queue commands, create unit groups that could be selected by a number key, and control numerous units at a time. The game was known to be easy to control, simple to learn and responsive to users' commands. It also featured two factions that had differing styles of play. Red Alert is also hailed as one of the first games to feature competitive online play. The single player campaign also received high praise for its detailed story line and missions, which often required the player to defeat the enemy with various sets of circumstances before continuing. Like Tiberian Dawn, the game has split routes for most missions. The objective stays the same but only the map layout differs. The single player campaign was also complemented by live action cinematic sequences that are a feature of all Command &amp; Conquer RTS games since the original, except for Generals when EA Games bought Westwood (the original creator of the Command &amp; Conquer series) and failed to uphold the tradition.\n\nGAME BALANCING:\nThe game balance between the forces of the Allied and Soviet armies differed from other games at its time. Like the 'rock-paper-scissors' balancing of modern games, Red Alert required each player to use their side's strengths in order to compensate for their weaknesses. This stood in contrast to games such as Total Annihilation or Warcraft II: Tides of Darkness, in which both sides had units with similar abilities and relied instead on outnumbering or possessing a better balanced force than their opponent.\nPlayers acquire credits to purchase structures and equipment by mining for ores and minerals (as the valuable, yet hazardous Tiberium in the regular C&amp;C series has not yet been discovered in this timeline). Rare gems generate more credits and are faster to mine, but unlike ores, do not regenerate within the map. Players can gain more credits and increase their buying power by building more ore factories and ore trucks.\nThe Soviets' vehicles tend to be more durable and powerful than Allied vehicles, but are often slower moving and more expensive. The Soviets also have superior defensive capabilities against both ground attacks (Tesla Coil) and air attacks (Surface to Air Missiles), but are at a disadvantage on the sea. The only offensive naval unit the Soviets have is the submarine, which cannot attack land-based targets or aircraft, so it is useless unless the opponent builds any sea units, and while it is normally invisible except when surfacing to attack, it can be detected by destroyers and gunboats. When heavily damaged, it is not able to submerge. The Soviets' secret weapon is the Iron Curtain, a device that renders a selected unit invulnerable to attacks for a short period of time. In online play and computer skirmish, they have access to two of the Allied side's infantry: the Rocket Soldier and Tanya, a commando capable of easily killing infantry and destroying structures. They also have a wide selection of air units for assault (MiG-27, Yak-7 and Mi-24 Hind) and map revelation through spy planes, and could deploy infantry by air through paratroops or by the Chinook transport helicopter (the latter only present in multiplayer). The Soviet &quot;tank rush&quot; was a popular strategy online, involving building many heavy tanks and overwhelming the opponent with sheer numbers.\nThe Allies' forces are generally cheaper, faster to build and more agile. Their minelayers can destroy enemy armor and their infantry can survive longer with good use of their Medic unit. They are at a disadvantage on land, as the Allies' strongest tank (the Medium Tank) is still weaker than the Soviets' starting tank (the Heavy Tank) and has the same speed. The Allies have only one air unit (AH-64D Apache Longbow) compared to three Soviet units and their defences against a ground assault are much weaker. On the sea, the Allies possess an advantage in naval power thanks to the Cruiser, which has the longest-ranged and most powerful surface-to-surface attack in the game, and the Destroyer, which is capable of adeptly taking on any type of unit type in the game - land, sea or air. The Allies' secret weapon is the Chronosphere, which temporarily relocates a selected unit to another part of the map. They also possess several other tools, such as stealing enemy resources, hiding their own units and structures, or revealing the game map with satellite technology. In online play and computer skirmish, Allied forces have access to the nuclear Missile Silo, an exclusive in the Soviets' single-player mode.\n\nSETTINGS AND STORY:\nCommand &amp; Conquer: Red Alert takes place during an unspecified period in the 1950s of a parallel universe, which was inadvertently created by Albert Einstein as a result of preventing the horrors of World War II.\nStarting off in 1946, at the Trinity site in New Mexico, the opening to Red Alert shows Albert Einstein as he is preparing to travel backwards through space and time. After his experimental &quot;Chronosphere&quot; device is activated, he finds himself in Landsberg, Germany, in the year 1924, where he meets a young Adolf Hitler just after the latter's release from Landsberg Prison. Following a brief conversation between the two, Einstein shakes Hitler's hand, and this somehow eliminates Hitler's existence from time and returns Einstein to his point of origin.\nWith the threat of Nazi Germany having been successfully removed from history, the Soviet Union began to grow increasingly powerful under the rule of Joseph Stalin. Had Adolf Hitler risen to power, Nazi Germany would have emerged as a force standing in the way of Stalin's own ambitions of conquest. Instead, left unweakened, the USSR proceeds by seizing lands from China and then begins invading Eastern Europe, in order to achieve Joseph Stalin's vision of a Soviet Union stretching across the entire Eurasian landmass. In response, the nations of Europe form into the Alliance, and start a grim and desperate guerrilla war against the invading Soviet army. Over the course of the game's story, the Allies and Soviets fight out a devastating conflict for control over the European mainland, in what has become an alternate World War II.\n\nALLIED ENDING:\nFollowing the destruction of the Soviet stronghold, an Allied platoon discovers Stalin buried alive in the rubble. Before they begin to remove the debris from the fallen leader, General Stavros stops them. He convinces them that they saw nothing and orders them to leave the premises. Stavros then stuffs a handkerchief down Stalin's mouth before covering his head with a large stone and walking away. This outcome forces Kane - who was using the Soviet Union to get to power - and his Brotherhood underground, leading to the events of the first Command &amp; Conquer. Alternatively, this ending paves the way to the sequel Red Alert 2.\n\nSOVIET ENDING:\nAs the Soviets celebrate their victory in the newly-captured Buckingham Palace, Stalin commends the Commander for a job well done but then cynically says &quot;You will be well taken care of&quot; (implying he will have him/her disposed of), while drinking a cup of tea, only to suddenly realize the tea has been poisoned by Nadia. A disgruntled Nadia proceeds to gun him down as the poison overcomes his body. Following Stalin's death, Nadia tells the Commander that the Soviet Union is now under the rule of the Brotherhood of Nod, who plan to return to the shadows again and re-emerge in the 1990s, leaving the player as the puppet ruler of the USSR, ready to do the Brotherhood's bidding for &quot;the foreseeable future&quot;. She is betrayed and shot in the back by Kane, who reveals himself to be the true mastermind.\n\nCHARACTERS:\n*Allies\n    Grand Marshal GÃƒÂ¼nther von Esling, German Army officer, Commander-in-Chief of European forces, and apparent leader of the military governing Europe. Played by Arthur Roberts.\n    General Nikos Stavros, Greek officer, Second-in-Command to General von Esling. Played by Barry Kramer.\n    Tanya Adams, a special ops. Commando. Played by Tanya Brassie.\n    Professor Albert Einstein, German-American physicist. Played by John Milford.\n    General Ben Carville, USA officer. The player's commanding officer in Red Alert: Retaliation. Played by Barry Corbin.\n\n*Soviet\n    Joseph Stalin, General Secretary of the Soviet Union. Played by Eugene Dynarski.\n    Nadia, Chief of the NKVD. Played by Andrea C. Robinson.\n    General Gradenko, Russian commander. Played by Alan Terry.\n    Marshal Georgi Kukov, commander of the Red Army. Played by Craig Cavanah.\n    General Topolov. High ranked Soviet military mastermind and mentor to the player in Red Alert: Retaliation. Played by Alan Charof.\n    Kane, obscure advisor to Joseph Stalin. Played by Joseph D. Kucan.\n\nEXPANSION PACKS:\nCounterstrike and The Aftermath (1997)\nIn 1997, two expansion packs for Red Alert were released for the PC, Command &amp; Conquer: Red Alert: Counterstrike, and Command &amp; Conquer: Red Alert: The Aftermath. The expansion packs were designed by Westwood Studios with the &quot;apprenticeship&quot; of Intelligent Games; a London based game developer. Much of the development on multiplayer maps was undertaken by players from the Compuserve Red Alert ladder. New units, missions, maps and music were included in the expansions.\nOf particular note with the Counterstrike add-on is the addition of the secret Ant Missions titled &quot;It Came from Red Alert&quot;, where the player battles against an army of giant, mutant ants with Allied Forces and Soviet units.\nThe Aftermath add-on added many new units available in single and multiplayer modes. New Allied units include the Field Mechanic and the Chrono Tank. New Soviet units include the Missile Sub, the Shock Trooper, the M.A.D Tank and the Tesla Tank. In addition, both sides receive the Demolition Truck. The add-on also includes hundreds of new maps as well as a new, significantly larger, map size.\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nall doom, heretic sotsr, hexen + ddc, n similar stuff (52 games)    NOTE: This Requires a mod to play online (skulltag), it's free, google it\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:0777cda73fe2796194289617cc8e6e26c88636d1","amp;dn":"Command+%26amp%3B+Conquer+RA+%28With+CS+and+AM%29+%28Works+on+Xp+Vista+N+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0777cda73fe2796194289617cc8e6e26c88636d1","infoHashBuffer":{"type":"Buffer","data":[7,119,205,167,63,226,121,97,148,40,150,23,204,142,110,38,200,134,54,209]},"announce":[],"urlList":[]}}