{"title":"Battle of the Planets","uid":5156360,"size":1357520175,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:07b229ebd1cdc2f10509eb2ffc91d2cd136eb451&amp;dn=Battle+of+the+Planets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1257874584,"description":"Collection of comics based on the cult classic animated TV series from the late 70's.  Battle of the Planets is the American dub of the 1972 television anime known as Kagaku ninja tai Gatchaman. \n\nThe series follows the intergalactic adventures of a band of five heroic super-powered orphans known as G-Force. Tiny, Keyop, Mark, Princess, and Jason battle against the sinister Great Spirit and his second-in-command, Zoltar - rulers of the planet Spectra - as they attempt to conquer the Earth and enslave its people and resources.\n\nThe Battle of the Planets comic book was originally published by Gold Key Comics from 1979 to 1980.  \n\nA Battle of the Planets comic strip also ran in the British TV Comic. The TV Comic issues which feature the Battle of the Planets strip run from #1530 (17 April 1981) to #1671 (30 December 1983). \n\nIn 2002 Top Cow Productions revamped the series which was originally planned as an ongoing, but low sales led to its cancellation at issue 12, leaving the series on a cliffhanger. A two-issue mini, Endgame (originally listed as Coup De Gras), was solicited in 2005 and was meant to tie up the loose ends, but never made it to print. \n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:07b229ebd1cdc2f10509eb2ffc91d2cd136eb451","amp;dn":"Battle+of+the+Planets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07b229ebd1cdc2f10509eb2ffc91d2cd136eb451","infoHashBuffer":{"type":"Buffer","data":[7,178,41,235,209,205,194,241,5,9,235,47,252,145,210,205,19,110,180,81]},"announce":[],"urlList":[]}}