{"title":"Stossel.2014.04.10.[Taxing Times].Fox Business.CF.avi","uid":9994500,"size":348876738,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:07d7afd695993a0fd78bc56e2a2217c9adf980c5&amp;dn=Stossel.2014.04.10.%5BTaxing+Times%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1397900520,"description":"----------\n\nSTOSSEL - [Taxing Times] - Fox Business Network\n2014, April 10, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nTHE &quot;FLAT TAX&quot; SOLUTION: The tax code is thousands of pages no one understands. Forbes Editor-In-Chief Steve Forbes explains how to fix it: get rid of the whole thing and start over with a simple flat tax, no charitable deductions. Won't people give less to charity? Forbes argues they'll actually give more because they'll have more money.\n\nFAIR SHARE DEBATE: Do the rich pay their fair share? Reporter David Cay Johnston says no. William McBride of the Tax Foundation says the rich pay enough. They agree that the code itself is repulsively complicated.\n\nMANIPULATIVE TAX BREAKS: Politicians use taxes to manipulate us. Yaron Brook of the Ayn Rand Institute complains, &quot;What the tax code is doing is trying to choose our values for us.&quot;\n\nTAXING THE LITTLE GUY: Professor Brian Brenberg of The King's College says the tax code hurts the little guy: &quot;big businesses have a lot more resource to throw at these 75,000 pages than small guys do.&quot;\n\nVOTE WITH YOUR FEET: If you hate your state taxes, you can move. 50 different states have 50 different tax codes-this is great competition. &quot;How Money Walks&quot; author Travis Brown shows a cool way to see who moves where with their wallets.\n\nTHE SIN TAX: Government regulates your choices by taxing &quot;sinful&quot; behavior like smoking and drinking. But Reason.com Editor-In-Chief Nick Gillespie lists basic and bizarre reasons why this is wrong.\n\nMY TAKE: Complex Taxes are a threat. It's not just the tax, the complexity itself is a terrible thing. America suffers when government turns taxes into a manipulative maze.","torrent":{"xt":"urn:btih:07d7afd695993a0fd78bc56e2a2217c9adf980c5","amp;dn":"Stossel.2014.04.10.%5BTaxing+Times%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07d7afd695993a0fd78bc56e2a2217c9adf980c5","infoHashBuffer":{"type":"Buffer","data":[7,215,175,214,149,153,58,15,215,139,197,110,42,34,23,201,173,249,128,197]},"announce":[],"urlList":[]}}