{"title":"Encyclopedia of Buddhism","uid":4723201,"size":31943217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07e7bbd3e7fc58cd8303febfa60ded60a46f83a2&amp;dn=Encyclopedia+of+Buddhism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timnehguy","files":2,"time":1234621945,"description":"Buddhism, according to the editor in chief of this encyclopedia, &quot;is one of the three major world religions, along with Christianity and Islam.&quot; Unlike the other two, however, Buddhism lacks substantial reference works in Western languages. The majority are single-volume works, defining terms, concepts, deities, etc. The Encyclopedia of Buddhism, on the other hand, &quot;seeks to document the range and depth of the Buddhist tradition in its many manifestations.&quot;\n\nThe nearly 500 entries are alphabetically arranged, signed by their authors, and conclude with see references and supplemental bibliographies. Article length ranges from 50 to 4,000 words. There are illustrations throughout, including three maps on the diffusion of Buddhism in Asia as well as an eight-page insert of color plates in each volume. The set ends with several time lines of Buddhist history and a good index. \n\nThe entries tend to be thematic and inclusive in nature, with specific mention of, say, an individual or place being made within a broader survey article. While the cosmological, doctrinal, and ritual aspects of Buddhism are covered extensively, entries also treat the cultural, social, and political contexts that have shaped and been shaped by Buddhist thought (e.g., Economics, Education, Law). Entries for geographic locations provide nice historical surveys of the development of Buddhism to the present day and include the U.S and Europe. Buddhism's interaction with other world religions and philosophies (e.g., Christianity and Buddhism, Communism and Buddhism, Jainism and Buddhism) is treated. \n\nFinally, recognizing that Buddhism is a force in the world today, the editor has included entries that provide Buddhist perspectives on issues of contemporary concern (e.g., Abortion, Gender, Modernity and Buddhism). 1042 pages.\n\nA great companion for this book is the 999-page The Seeker's Glossary of Buddhism, available for free download at http://buddhanet.net/ebooks_g.htm (next to last entry).\n\nHere's an index page of articles on Buddhism: http://www.squidoo.com/donthavetobebuddhist.","torrent":{"xt":"urn:btih:07e7bbd3e7fc58cd8303febfa60ded60a46f83a2","amp;dn":"Encyclopedia+of+Buddhism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e7bbd3e7fc58cd8303febfa60ded60a46f83a2","infoHashBuffer":{"type":"Buffer","data":[7,231,187,211,231,252,88,205,131,3,254,191,166,13,237,96,164,111,131,162]},"announce":[],"urlList":[]}}