{"title":"The Casual Collection v1.0","uid":8601351,"size":826117053,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0887283df0ae0460b704f2d94469a922f5ef89df&amp;dn=The+Casual+Collection+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IsraelHighlander","files":47,"time":1371894568,"description":"The Casual Collection is my mission to create a collection of all the &lt;a href=&quot;http://en.wikipedia.org/wiki/Casual_games&gt;casual games&lt;/a&gt; for windows.\nThe games are precracked &amp; installed with a simple setup program. After many months of work, using a combination of the AutoIt script language, the Smart Install Maker setup program &amp; batch files, I have been able to create powerful installers &amp; uninstallers. Moreover, I have created a simple program with menus to automate the whole install/uninstall process. This program is located at the root of the folder. You don't have to use it, but I recommend it.\nEach game is comprised of a small installer file &amp; a data file (located at the Data folder). You don't have to download the whole torrent if you want a specific game. Just download the two files.\n\nEach newer version will have all of the games from the previous version plus more... Ultimately, I hope I will succeed in adding all of the casual games out there. I don't have a seedbox, so this process has to be done gradually. When a version will have enough seeders, I will upload the next version. Those of you who downloaded a previous version, will only have to do a &quot;Force Check&quot; in your torrent software. However, I will replace specific games with better versions when needed.\n\nI accept requests for games to be included in the next version, as long as there is a trial version of them in the big casual games sites (like Big Fish, iWin, Alawar, Iplay, etc.). I then download the trial version, crack it &amp; create the installer.\n\nSo, let's start the journey with version 1.0. I want to see how the collection is spread, get comments for improvements &amp; bug fixing, so the first version has games from only two developers &amp; relevantly small. The following is the names of the companies &amp; the game names:\n\n&lt;b&gt;&lt;a href=&quot;http://www.10tons.com/&quot;&gt;10tons&lt;/a&gt;/&lt;a href=&quot;http://www.mythpeople.com/&quot;&gt;MythPeople&lt;/a&gt;/GameGekko&lt;/b&gt; (MythPeople is a division of 10tons. It was named GameGekko up until 2006):\nAbundante!\nAzkend\nAzkend 2: The World Beneath\nBubblefish Bob\nCrimsonland\nDragon Portals\nHeroes of Kalevala\nIce Breaker\nJoining Hands\nKaru\nKing Oddball\nMiriel the Magical Merchant\nMiriel's Enchanted Mystery\nProfitville\nSparkle\nSparkle 2\nTennis in the Face\n\n&lt;b&gt;&lt;a href=&quot;http://www.rovio.com/&quot;&gt;Rovio Entertainment&lt;/a&gt;&lt;/b&gt;:\nAngry Birds (false activation is also needed)\nAngry Birds Rio (false activation is also needed)\nAngry Birds Seasons (false activation is also needed)\nAngry Birds Space (false activation is also needed)\nAngry Birds Star Wars (false activation is also needed)\nBad Piggies","torrent":{"xt":"urn:btih:0887283df0ae0460b704f2d94469a922f5ef89df","amp;dn":"The+Casual+Collection+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0887283df0ae0460b704f2d94469a922f5ef89df","infoHashBuffer":{"type":"Buffer","data":[8,135,40,61,240,174,4,96,183,4,242,217,68,105,169,34,245,239,137,223]},"announce":[],"urlList":[]}}