{"title":"NHL.Legacy.Edition.XBOX360-iMARS [Super Seed]","uid":14468356,"size":8738859105,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:0934e1108e625ad6f4b0599fe70e79da6e7f136d&amp;dn=NHL.Legacy.Edition.XBOX360-iMARS+%5BSuper+Seed%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"witzirlm","files":4,"time":1461884194,"description":"**REGION FREE**\r\n\r\nNHL: Legacy Edition is an updated version of NHL 15 for the PlayStation 3 and Xbox 360 and was released on September 9 in Canada and September 15 in the United States. There are some minor changes, such as the menu music; however, the EA Sports logo is instead shown for the album arts, the NHL Moments Live from 2013-14 is replaced by some new ones that will be available as the 2015-16 NHL season progresses, and in the &quot;Custom Team&quot; game mode the team name selection is improvised\r\n\r\n EA SPORTS NHL Legacy Edition brings together the most popular modes and award-winning gameplay features from nine years of NHL hockey. Featuring updated rosters and authentic schedules, it's the perfect experience for fans looking to get that complete hockey fix on Xbox 360 or PlayStation 3.\r\nFeatures:\r\n\r\n    The Speed, Skill, and Aggression of NHL Hockey - Experience the explosiveness, momentum and top-end speed of the world's best players with True Performance Skating. Dangle defenders with easy to use One-Touch Dekes and feel the hard-hitting chaos of NHL hockey through true-to-life multiplayer collisions, net scrambles, and player pileups with Multiplayer NHL Collision Physics.\r\n    Lace up the Skates - Live the Life of an NHL player as you take your Be a Pro character through the junior ranks and into the NHL. Every decision you make will affect your relationship with fans, teammates and management, influencing your skills and progression. Once you master these single-player Pro experiences, jump into Online Team Play or EA SPORTS Hockey League and team-up with some friends to face online competition. Lastly, relive the glory days with NHL 94 Anniversary Mode featuring bigger goals, hits, retro presentation, and classic button controls.\r\n    Manage Your Team to Glory - Create an NHL dynasty in Be a GM as you build your team through rookie drafts, trades and signings. GM Connected enhances the manager experience by allowing gamers to manage, play, or coach with and against friends online in their own 30 team human controlled league. Finally, our most played mode Hockey Ultimate Team is the only place to build and play with a team composed of all your favorite players to create an ultimate dream team. Take your team online and face-off against other fan created teams from around the hockey world.\r\n    Complete Authenticity - Choose from eight different hockey leagues including the NHL, AHL, CHL, Liiga, SHL, DEL, Extraliga ledniho hokeje, and National League. Featuring updated rosters and authentic NHL schedules","torrent":{"xt":"urn:btih:0934e1108e625ad6f4b0599fe70e79da6e7f136d","amp;dn":"NHL.Legacy.Edition.XBOX360-iMARS+%5BSuper+Seed%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0934e1108e625ad6f4b0599fe70e79da6e7f136d","infoHashBuffer":{"type":"Buffer","data":[9,52,225,16,142,98,90,214,244,176,89,159,231,14,121,218,110,127,19,109]},"announce":[],"urlList":[]}}