{"title":"Harlequin Desire - January 2014 (Epub, Mobi)","uid":9642236,"size":3205618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a1a7c3721a9c9f142573b2092be8907f31d5925&amp;dn=Harlequin+Desire+-+January+2014+%28Epub%2C+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1392942546,"description":"Harlequin Desire - January 2014 (Epub, Mobi)\n\n\nAt Odds with the Heiress - Schield\n\nWhat happens when the man she loves to hate becomes the man she can't live without? Find out in Cat Schield's new Las Vegas Nights series....\n\nActress turned casino mogul Scarlett Fontaine uses her beauty to get what she wants. But it doesn't work with Logan Wolfe. Now the infuriatingly gorgeous security expert needs her help. Finally, Scarlett sees her chance to show him she's more than just a pretty face.\n\nYet when her safety's at stake, their flirtatious games turn serious. Scarlett suddenly needs him, too. As things heat up, their steamy kisses--and steamier nights--make her wonder: is the man who has always tormented her finally showing his true colors?\n\nBeneath the Stetson - Janice Maynard\n\nMillionaire rancher Gil Addison does &quot;not&quot; need Bailey Collins. She is far from the sweet homemaker he thought he wanted. But she &quot;is&quot; a beautiful woman with a badge, hot on the heels of a kidnapper in Gil's club. And Gil is hot for her.\n\nBailey can't let her career get sidetracked by the cowboy and his son. She's here to do a job, not find a family. Bailey won't stop till she gets her man in cuffs.... Trouble is, Gil won't stop till he gets this woman in his bed.\n\nFor the Sake of Their Son - Catherine Mann\n\nNo one knows Elliot Starc better than Lucy Ann Joyner. Yet after one reckless night of passion, their friendship is in tatters. And though women line up for the race-car driver's attention, none of them help him forget Lucy Ann.\n\nExcept now he and Lucy Ann have a baby, and Elliot wants a second chance. The chance to become the father he never had. The chance for best friends to become something more. But can Lucy Ann forgive the mistakes he's made and trust that he wants more than a marriage for the sake of their son?\n\nPregnant by Morning - Kat Cantrell\n\nOne magical night in Venice brings two lost souls together...until a positive pregnancy test changes everything.\n\nWhat was meant to be a one-night affair has turned into much more for Texas businessman Matthew Wheeler. Something about Evangeline, the mysterious woman he met at a masquerade ball, propels him from his self-imposed exile. He's finally able to forget his tragic past and lose himself in this incredible woman.\n\nBut letting go has a price.\n\nEvangeline's pregnancy announcement brings reality to their Venetian villa. Are they ready to take their secret affair public? Or will their romance end with the morning light?\n\nProject: Runaway Bride - Heidi Betts\n\nHandbag designer Juliet Zaccaro should be walking down the aisle, so why is she running out of the church instead? Because she just found out she's pregnant, and not by her cruel, distant fiance Now it's up to private investigator Reid McCormack to bring her home. But once he finds her, he'll make sure she doesn't go back to her fiance--especially since the baby she's carrying might just be Reid's Even as Juliet denies their explosive chemistry, can Reid convince her that there's more between them than a baby bump?\n\nThe Nanny's Secret - Elizabeth Lane\n\nIn this Billionaires and Babies novel, the nanny wants her boss...but can she have him and keep her secrets, too?\n\nHaughty and handsome, resort owner Wyatt Richardson has never met a problem he couldn't buy his way out of. Facing custody of his teenage daughter &quot;and&quot; her newborn son, he hires a nanny to handle them both. His attraction to Leigh Foster is an unexpected perk. He's confident the feeling is mutual.\n\nBut Leigh knows she's on shaky ground. Falling for her new boss could prove devastating--especially if Wyatt finds out her true connection to baby Mikey. But when the billionaire's arms beckon, will she be powerless to refuse.\n","torrent":{"xt":"urn:btih:0a1a7c3721a9c9f142573b2092be8907f31d5925","amp;dn":"Harlequin+Desire+-+January+2014+%28Epub%2C+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a1a7c3721a9c9f142573b2092be8907f31d5925","infoHashBuffer":{"type":"Buffer","data":[10,26,124,55,33,169,201,241,66,87,59,32,146,190,137,7,243,29,89,37]},"announce":[],"urlList":[]}}