{"title":"Paperback Hero (1973)","uid":5224193,"size":778957416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a5daf5ee3f4c59450c4bdd5129f3378b1c7fd1c&amp;dn=Paperback+Hero+%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Rowdy_Man","files":1,"time":1261011255,"description":"&quot;Your head is full of little dingle balls...&quot; This comment (a quote from the film) is probably the most apt description of Rick Dillon, the notorious star player of the Delisle senior hockey team and womanizing key figure in the 1973 film &quot;Paperback Hero&quot;.\n\nSet in the desolate agricultural town of Delisle, Saskatchewan, the plot surrounds Dillon's fall from grace as a reigning sports god. Once living in a world where his actions had no consequences, he suddenly finds his vaulted throne caught in a whirlpool. The troubled standing of the team, his own declining popularity, as well as being wanted by the law after one of his numerous romantic conquests goes sour.\n\nThe only people who stand by the self-appointed &quot;Marshal&quot; Dillon (played by Keir Dullea) are his teammate &quot;Pov&quot; (John Beck) and good-hearted barmaid, Loretta (played by Elizabeth Ashley). They see the childlike innocence of Rick's &quot;boy dreams&quot;, while seemingly oblivious to the dangers the fantasy begins to take.\n\nThe classic tragic figure, Rick's demise is cleverly symbolized by the desolate prairie setting, interspersed with scenes of vast wheat fields and abandoned farm implements. The pathos is further entrenched by Gordon Lightfoot's hit tune &quot;If You Could Read My Mind&quot;, the performing of which is one of the highlights of the screenplay.\n\nThis film was one in a number of pioneering efforts to establish the Canadian film industry that we know today. While crude and clumsy at times, the film is pretty successful in its mandate of putting Canadian identity into the cinema. Little touches like &quot;brown stubby&quot; beer bottles, Foster Hewitt calling play-by-play on Saturday night hockey games and dilapidated old smoke-filled arenas make it clear this is mid-seventies Canada. The plot, while far from classic, is still pretty watchable. I would recommend it to Canadians, or anyone wanting to know more about Canadian popular culture. If you are looking for the Canadian equivalent of &quot;Citizen Kane&quot;, well ... you'd be best to keep searching. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071966/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071966/&lt;/a&gt;","torrent":{"xt":"urn:btih:0a5daf5ee3f4c59450c4bdd5129f3378b1c7fd1c","amp;dn":"Paperback+Hero+%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a5daf5ee3f4c59450c4bdd5129f3378b1c7fd1c","infoHashBuffer":{"type":"Buffer","data":[10,93,175,94,227,244,197,148,80,196,189,213,18,159,51,120,177,199,253,28]},"announce":[],"urlList":[]}}