{"title":"BN+ Brute Force Hash Attacker 1.1.0","uid":5233671,"size":235024,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0a744f10af7d9b745e54225ce710f81c0f804c90&amp;dn=BN%2B+Brute+Force+Hash+Attacker+1.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rtsbnvs","files":1,"time":1261434835,"description":"Description: An easy to use tool to preform brute force attacks on hashes. MD4, MD5, RIPEMD160, SHA1, and SHA2 family hashes are supported. Ideal for password recovery, and sending and decoding hash messages. Hashes are text containing data encrypted in an irreversible algorithm, and are most used for storing passwords. More information about hashes can be found in this wikipedia article. If you are looking for a tool to hash text, go to this topic.\n\n\nRelease date: 2009-03-21\nKnown issues: None\n\nProgram version: 1.1.\nFront end language: English\nSystem requirements\n&gt; Win 2000 / Win Xp / Win Vista\n&gt; .Net framework 2.0 or higher\n\nDeveloper: Jeroen De Dauw\nWritten in: Visual Basic.net and visual C# .Net, using Visual Studio 2008\nBased upon: BN+ Framework 2.0.2.0\n\n---\n\nOfficial page: http://code.bn2vs.com/viewtopic.php?t=112\n\n---\n\nVersion 1.1.0 released\nThis release features quite a bunch of new functionality, most noteworthy the multi hash attack feature. This will allow you to enter as many hashes as you want and attack them all simultaneous. Various improvements have been made to the interface itself, like window flashing notification when an attack is completed, and both an update platform and bug submit tool have been added. The update platform will automatically report new updates and enable you to easily download and install them, and the bug reporter provides you with the means to help improve the application itself! For a complete list of changes, see the change log.\n\nThe multi hash functionality has decrease the overall performance with about 15%. Tests with up to 10 hashes have not shown a noteworthy decrease in performance compared to an attack with only 1. Version 1.0.8 will therefore have a better performance when attacking only 1 hash then this release. A load of new improvements, including performance, are already on their way to be implemented into the next version.","torrent":{"xt":"urn:btih:0a744f10af7d9b745e54225ce710f81c0f804c90","amp;dn":"BN%2B+Brute+Force+Hash+Attacker+1.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a744f10af7d9b745e54225ce710f81c0f804c90","infoHashBuffer":{"type":"Buffer","data":[10,116,79,16,175,125,155,116,94,84,34,92,231,16,248,28,15,128,76,144]},"announce":[],"urlList":[]}}