{"title":"Johnny Thunders Born To Lose - The Last Rock &amp;Roll Movie","uid":3903742,"size":1236682600,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ac84ca840775d33dc643a90521a998ebbfff72d&amp;dn=Johnny+Thunders+Born+To+Lose+-+The+Last+Rock+%26Roll+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"PopeFaust","files":1,"time":1195714585,"description":" Divx Avi-Full Movie-Video 1 file \n\nVideo: Vhs(ok) Sound: Great\n\nLots of old footage of Johnny Thunders, NY Dolls and more \n\nBorn to Lose: The Last Rock and Roll Movie (1999)\n\nDirected by:Lech Kowalski\n\n\nGenre: Documentary \n\nUser Comments: Essential for any Johnny Thunders fan (if you can find it).\n\nRuntime: Canada:90 min\nCountry: USA\nLanguage: English\nColor: Color\n\t\nEssential for any Johnny Thunders fan (if you can find it)., 4 December 2004\nAuthor: townmoron \nThis documentary offers a fantastic (if fragmented) view into the life of tragic guitar hero Johnny Thunders. I would call this far from complete; the history is left vague, with almost no regards to chronology or the progression Thunders took from the New York Dolls to the Heartbreakers and his solo career. The interviews (often with current or ex-junkies) are mostly semi-coherent, and there are several moments in the film where the editing leaves a bit to be desired, including an extended sequence where Dee Dee Ramone is all but inaudible as he talks over a loud Heartbreakers performance. Lech Kowalski also decided to use almost no footage of Johnny Thunders talking, one lone clip at the beginning being the only exception\n\nAll that being said, the film is still a very watchable and enjoyable look at the man himself. The incredible footage from both the days of the New York Dolls and early Heartbreakers is fantastic to watch, as are some of the stories shared about Johnny by friends and family.\n\nFor a more complete look at the history and untimely death of Johnny Genzale, a far better source would be the book &quot;In Cold Blood...&quot; by Nina Antonia, but for either a quick introduction to the man and the music or as an integral part of your obsessive collection, Born To Lose is well worth the time spent trying to locate a decent copy. \nCast (in alphabetical order)\n\tWilly De Ville\t.... \tHimself\n\tWayne Kramer\t.... \tHimself\n\tDee Dee Ramone\t.... \tHimself\n\tJohn Spaceley\t.... \tHimself\n\tSylvain Sylvain\t.... \tHimself\n\tJohnny Thunders\t.... \tHimself\n\tMick Webster\t.... \tHimself\n\nDirected by\nLech Kowalski\t \t\n ","torrent":{"xt":"urn:btih:0ac84ca840775d33dc643a90521a998ebbfff72d","amp;dn":"Johnny+Thunders+Born+To+Lose+-+The+Last+Rock+%26Roll+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ac84ca840775d33dc643a90521a998ebbfff72d","infoHashBuffer":{"type":"Buffer","data":[10,200,76,168,64,119,93,51,220,100,58,144,82,26,153,142,187,255,247,45]},"announce":[],"urlList":[]}}