{"title":"Osho_The Goose Is Out #02_ Just See It.mp4","uid":15219965,"size":260906654,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0b16db982dcb6775eda9009ecb35a756c62d2a15&amp;dn=Osho_The+Goose+Is+Out+%2302_+Just+See+It.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467725884,"description":"Master's responses to disciples questions .\r\n Osho_The Goose is out , ch 2, Just see it\r\n2 March 1981 am in Buddha Hall (old video)\r\n\r\nThe first question:\r\n\r\nOSHO, I FEEL THAT WE NEED TO HURRY, THAT THERE IS NOT MUCH TIME\r\nLEFT. THE COCOON OF SLUMBER I AM EXISTING IN SEEMS TO SUFFOCATE ME,\r\nAND I AM AFRAID I WILL NEVER MAKE IT. YOU SAY THE GOOSE IS OUT\r\nALREADY.\r\nWHY DOES IT FEEL SO IMPOSSIBLE TO GRASP?\r\nAnand Bhagawati, it is difficult to grasp because the goose is out\r\nBhagawati, you say:\r\nI FEEL THAT WE NEED TO HURRY...\r\nIf you are here with me forget all about hurrying, forget all about time.\r\nYou say:\r\nTHE COCOON OF SLUMBER I AM EXISTING IN SEEMS TO SUFFOCATE ME,\r\nAND I AM AFRAID I WILL NEVER MAKE IT.\r\nI am also afraid! If you try to make it, Bhagawati, you will never make it. Drop the whole idea of making it, forget all about it. Rejoice in the moment!\r\nBhagawati, you say:\r\nOSHO, YOU SAY THE GOOSE IS OUT ALREADY. WHY DOES IT FEEL SO IMPOSSIBLE TO GRASP?\r\nBecause it is already out! Just see the point, don't think about it. A moment's thought, and you have gone far away. Don't brood about it, just see it..\r\n\r\nThe second question:\r\n\r\nOSHO, I AM A RADICAL REVOLUTIONARY POLITICIAN. HAVE YOU\r\nSOMETHING TO SAY TO ME?\r\nWerner, you have already gone too far -- you will not listen. Just to be a politician is enough, but you are a revolutionary radical politician -- cancer doubled, trebled! Is not politics enough? Have you to be radical, revolutionary? But we always find beautiful words to hide ugly realities.\r\nNo politician can be revolutionary, because the only revolution is spiritual. No politician can be radical either; the very word &quot;radical&quot; means concerning the roots. The politician only prunes the leaves, he has nothing to do with the roots. \r\nYou ask me:\r\nOSHO, HAVE YOU SOMETHING TO SAY TO ME?\r\nRemember two things. First, the three rules of ruination. There are three ways to be ruined in this world: first is by sex, second is by gambling, and the third is by politics. Sex is the most fun, gambling is the most exciting, and politics is the surest.\r\nSecond, also remember the fundamental law of all revolutions: when the revolution comes, things will be different -- not better, just different.\r\n\r\nQuestion 3:\r\n\r\nOSHO, I HAVE HEARD YOU SAY THAT KNOWLEDGE IS USELESS. THEN\r\nWHAT IS NEEDED TO GUIDE US TO THE ULTIMATE GOAL?\r\nGeetam, there is one good thing about your question that I appreciate: you say &quot;I have heard you say.&quot; All the Buddhist scriptures begin in that way; that is a very sincere thing.\r\nYou say:\r\nI HAVE HEARD YOU SAY THAT KNOWLEDGE IS USELESS.\r\nNo, I have not said that. Knowledge is very useful -- wisdom is useless! \r\nTHEN WHAT IS NEEDED TO GUIDE US TO THE ULTIMATE GOAL?\r\nThere is no ultimate goal -- let it be clear from the very beginning. There is no goal as such, hence there is no question of there being an ultimate goal. All that is, is immediate -- let me repeat, IMMEDIATE. There is nothing ultimate anywhere; the immediacy itself is the ultimate. And there is no goal; the pilgrimage itself is the goal. Each step is the goal, each moment is the goal.\r\n\r\nThe last question:\r\n\r\nOSHO, WILL YOU SAY SOMETHING SERIOUS SO THAT I CAN ALSO UNDERSTAND?\r\nPrem Brita, this is really a difficult question! I don't know what seriousness is","torrent":{"xt":"urn:btih:0b16db982dcb6775eda9009ecb35a756c62d2a15","amp;dn":"Osho_The+Goose+Is+Out+%2302_+Just+See+It.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b16db982dcb6775eda9009ecb35a756c62d2a15","infoHashBuffer":{"type":"Buffer","data":[11,22,219,152,45,203,103,117,237,169,0,158,203,53,167,86,198,45,42,21]},"announce":[],"urlList":[]}}