{"title":"Robinson_Peter-Playing_With_Fire.epub","uid":9220100,"size":414116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bd344d560f875531a66b316b066f75bb70df2ef&amp;dn=Robinson_Peter-Playing_With_Fire.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"420weedman","files":1,"time":1384920120,"description":"At the centre of it all, by the pooling that marked the seat of the blaze, lay a blackened body . . . It had been hard to spot at first among the charred furniture and fixtures, but once you managed to separate it out from its context, you couldn't miss it, and Banks knew he wouldn't forget it.'\n\nIn the early hours of a cold January morning, two narrow boats catch fire on the dead-end stretch of the Eastvale canal. When signs of accelerant are found at the scene, DCI Banks and DI Annie Cabbot are summoned. But by the time they arrive, only the smouldering wreckage is left, and human remains have been found on both boats.\n\nThe evidence points towards a deliberate attack. But who was the intended victim? Was it Tina, the sixteen-year-old who had been living a drug-fuelled existence with her boyfriend? Or was it Tom, the mysterious, lonely artist?\n\nAs Banks makes his enquiries, it appears that a number of people are acting suspiciously: the interfering 'lock-keeper', Tina's cold-hearted step-father, the wily local art dealer, even Tina's boyfriend . . .Then the arsonist strikes again, and Banks's powers of investigation are tested to the limit . . .","torrent":{"xt":"urn:btih:0bd344d560f875531a66b316b066f75bb70df2ef","amp;dn":"Robinson_Peter-Playing_With_Fire.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd344d560f875531a66b316b066f75bb70df2ef","infoHashBuffer":{"type":"Buffer","data":[11,211,68,213,96,248,117,83,26,102,179,22,176,102,247,91,183,13,242,239]},"announce":[],"urlList":[]}}