{"title":"Jackson 5 - Who's Loving You","uid":4986112,"size":154218500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0c3d7098f3f1389e426b1f0dcbd7a516572b61a6&amp;dn=Jackson+5+-+Who%5C%27s+Loving+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246668136,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Who's Lovin' You&quot; is a Motown soul song, written in 1960 by William &quot;Smokey&quot; Robinson. The song has been recorded by many different artists including The Miracles 1960 original version, The Temptations, The Supremes, Terence Trent-D'arby, Brenda and The Tabulations, John Farnham, Human Nature and En Vogue. The most famous version is attributed to The Jackson Five.\n\nThe most famous cover of &quot;Who's Lovin' You&quot;, and the one most future covers were based upon, was recorded on August 7, 1969 by The Jackson 5. Michael Jackson was the lead singer on this recording, with his brothers Marlon, Tito, Jermaine, and Jackie on background vocals; Bobby Taylor of The Vancouvers served as producer. The Jackson 5 version of &quot;Who's Lovin' You&quot; was one of a number of early recordings the group made at the Hitsville U.S.A. recording studio in Detroit, Michigan, with the Funk Brothers on instrumentation. Just after recording this song, Berry Gordy moved the entire Jackson family to Los Angeles, California to record the hit pop songs he would co-write for the group with The Corporation.\n\n&quot;Who's Lovin' You&quot;, which was included on the first Jackson 5 LP, Diana Ross Presents the Jackson 5, was issued as the b-side to The Jackson 5's first single, &quot;I Want You Back&quot;, released on October 14, 1969. The single went to #1 on both the pop and R&amp;B charts.\n\nDiana Ross Presents The Jackson 5 is the debut album from Gary, Indiana-based soul family band The Jackson 5, released on the Motown label in December 1969. The Jackson 5's lead singer, a preteenage boy named Michael Jackson, and his older brothers Marlon, Jermaine, Tito, and Jackie, became pop successes within months of this album's release. Diana Ross Presents the Jackson 5's only single, &quot;I Want You Back&quot;, became a number-one hit on the Billboard Hot 100 within weeks of the album's release.\n\nThe album title suggested that Motown star Diana Ross had discovered the group, as do the Ross-penned liner notes on the back cover. Ross' alleged discovering of the Jackson 5 was in fact part of Motown's marketing and promotions plan for the Jackson 5; Motown artists Bobby Taylor and Gladys Knight were the ones who had actually discovered the Jacksons. Ross did, however, introduce the group to the public both in concert and on television.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:0c3d7098f3f1389e426b1f0dcbd7a516572b61a6","amp;dn":"Jackson+5+-+Who%5C%27s+Loving+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c3d7098f3f1389e426b1f0dcbd7a516572b61a6","infoHashBuffer":{"type":"Buffer","data":[12,61,112,152,243,241,56,158,66,107,31,13,203,215,165,22,87,43,97,166]},"announce":[],"urlList":[]}}