{"title":"Bill Myers - Camtasia to DVD","uid":7011333,"size":951580672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c74033bffa0293055b08e02438c101939b8900d&amp;dn=Bill+Myers+-+Camtasia+to+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"adobevfx","files":1,"time":1328479113,"description":"Product Details\nActors: Bill Myers\nDirectors: Bill Myers\nFormat: NTSC\nRegion: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n\nNumber of discs: 1\nRated: G (General Audience)\nStudio: Hamilton New Media\nDVD Release Date: August 9, 2007\nRun Time: 40 minutes\n\nEditorial Reviews\nThe Guide to Getting Great Looking Computer-Screen Captures onto TV &amp; DVD with Camtasia Studio\nThis DVD shows you how to get exceptional quality computer screen captures onto DVD for display on television screens - opening the door to creating instructional DVDs on almost any computer software topic.\n\nFinally, a way to get incredibly sharp computer screen videos onto your how-to DVDs for display on TV!\n\nCamtasia to DVD shows you the step-by-step process to getting amazingly sharp computer screen videos onto DVD, opening the door for you to create profitable training DVDs featuring computer tutorials.\n\nAs you probably know, Camtasia from Techsmith is a great tool for capturing and creating videos from computer screens. It is the perfect tool to create software instructional materials, and can give spectacular results when the movies are displayed on a computer screen.\n\nHowever, because computer screens are much higher resolution than TV display screens, computer screen videos can be almost unreadable when copied to DVD.\n\nBut no longer. This DVD shows you how to get incredibly sharp computer screen videos onto DVD for display on television screens.\n\nBeing able to deliver high quality computer screen video on DVD opens the door to creating instructional DVDs about almost any computer topic - from using software to doing things on the internet.\n\nThese are the kinds of DVDs you can create from your home studio, and offer to a world of customers waiting for high quality computer training DVDs on almost every computer related subject.\n\nCamtasia to DVD covers:\n\nHow to set up your computer to get amazing results with screen captures\n\nHow to set up Camtasia Recorder to eliminate interlace flicker\n\nHow to choose computer screen capture sizes to produce best results on DVD\n\nHow to automatically set computer screen capture size\nHow to adjust your mouse settings for best display results\nHow to edit Camtasia screen capture videos for DVD output\nHow to use Zoom and Pan to show more detail\n\nHow to get around the 'pixel shape' issue\nHow to import and render computer screens into your video editing program\nHow to convert screen capture videos into a DVD\n\nAnd much more . . .\nThis is the DVD you'll want to see before you start capturing computer screens for display on TV or DVD.\n\nUsing the techniques shown on this DVD can mean the difference between muddy, unreadable computer screens and crisp, sharp displays.\n\nOnce you view this DVD, you'll know how to produce quality computer screen captures onto DVD - for use on instructional, tutorial and training DVDs!\n\nFurther Online info at ----","torrent":{"xt":"urn:btih:0c74033bffa0293055b08e02438c101939b8900d","amp;dn":"Bill+Myers+-+Camtasia+to+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c74033bffa0293055b08e02438c101939b8900d","infoHashBuffer":{"type":"Buffer","data":[12,116,3,59,255,160,41,48,85,176,142,2,67,140,16,25,57,184,144,13]},"announce":[],"urlList":[]}}