{"title":"Trollz","uid":10490884,"size":5232495884,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0dcf462b692fc3e1b9ef18a53a7530bf63fc5f5c&amp;dn=Trollz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"ErnieHarris","files":-1,"time":1404539792,"description":"Trollz is an American animated television series produced by DiC Entertainment (now Cookie Jar Entertainment) and features the adventures of five fictional teenage girls, who call themselves the Best Friends for Life, who use magic to help them with their everyday life as well as battling whatever magical creatures and problems they may find themselves up against. These trollz were based on the troll doll created in the 1960s becoming one of the biggest fads in the world. The series originally aired on UPN, but during the 2006 - 2007 television season, the program was part of KOL Secret Slumber Party on CBS; the series was also part of KEWLopolis, through October 27, 2007. Reruns of the show currently air in syndication as part of the Cookie Jar Kids Network block. As of February 5, 2011, the program is currently airing on Cookie Jar TV on CBS.[1]\n\nSpell Phones are devices based on a real life cellphones, but are adapted to provide functions for magic and spellbeads as well as provide the standard functions of a normal cellphone. &quot;Spell Calls&quot; are used to cast spells on other trollz across long distances. To initiate a Spell Call, the caller places a spell bead in the spell bead slot after inciting the incantation and then dialing the phone number of the intended recipient and hitting the cast button. The Spell Phone then transfers the spell through the phone line and when the recipient picks up the phone the spell is released through the receiver of the phone. It is a useful function that allows trollz to cast spells across long distances, but a lot of teenagers misuse the function and instead use it to play pranks.","torrent":{"xt":"urn:btih:0dcf462b692fc3e1b9ef18a53a7530bf63fc5f5c","amp;dn":"Trollz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dcf462b692fc3e1b9ef18a53a7530bf63fc5f5c","infoHashBuffer":{"type":"Buffer","data":[13,207,70,43,105,47,195,225,185,239,24,165,58,117,48,191,99,252,95,92]},"announce":[],"urlList":[]}}