{"title":"Scoreland - Kelly Christiansen (First Time's A Charm)","uid":6604805,"size":307781985,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0e6cf0af8e2afb5b79d009311d056512a71654e9&amp;dn=Scoreland+-+Kelly+Christiansen+%28First+Time%5C%27s+A+Charm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FluxXxu","files":1,"time":1313352995,"description":"Scoreland - Kelly Christiansen (First Time's A Charm)\n\nDescription: \nLike Jayden Prescott, another SCORE Man's wifey, beautiful Kelly Christiansen has fantasized for a long time about being a SCORE model, showing the world her big, beautiful hooters, lush bod and curvy ass, and fulfilling her midnight fantasies on camera. And that's what Kelly does in her first SCORE video, &quot;First Time's A Charm.&quot; It's all about Kelly, 100%. The dude in this video is just a male prop, a meat puppet, for Kelly's use. We've had SCORE wives model many times but relatively few go the full nine yards (figuratively speaking). &quot;Honestly, I had no idea what to expect,&quot; Kelly said. &quot;I've seen the magazine, so I had a feeling about how I would be posing, but I had no idea about anything else. It's been better than my expectations.&quot; Very much the neighbor-next-door, like Kaytee Carter, Kelly enjoys boating, driving, hiking, playing softball and traveling. &quot;I'm an outdoorsy-type. My friends always say I'm very down-to-Earth and more like the girl next door. I don't know if they would expect this from me. Still, I enjoy showing off my curves so I normally wear sexy or revealing clothing out. I like having sex almost daily but I'm always working to improve the score. I like initiating sex when he least expects it. Stamina is what impresses me the most in a man.&quot; Kelly also seems ripe for girl-girl smooshin' too. &quot;I love to play with girls! They are so much more sensuous than men.&quot; Welcome to SCORE, Kelly Christiansen. Watching you score some action is a fantasy in the flesh.\n\nScreens:\n &lt;a href=&quot;\nhttp://www.starpix.us/show.php/2496_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starpix.us/show.php/2496_1.jpg.html&lt;/a&gt;","torrent":{"xt":"urn:btih:0e6cf0af8e2afb5b79d009311d056512a71654e9","amp;dn":"Scoreland+-+Kelly+Christiansen+%28First+Time%5C%27s+A+Charm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e6cf0af8e2afb5b79d009311d056512a71654e9","infoHashBuffer":{"type":"Buffer","data":[14,108,240,175,142,42,251,91,121,208,9,49,29,5,101,18,167,22,84,233]},"announce":[],"urlList":[]}}