{"title":"Brigade E5: New Jagged Union","uid":4892412,"size":1613044242,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0e825b1a9e4dfc90febd2ba77e5d5bf1667d041d&amp;dn=Brigade+E5%3A+New+Jagged+Union&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kladdey","files":-1,"time":1242141442,"description":"Kladdey proudly presents:\n\n\n\nBrigade E5: New Jagged Union is a tactical game that places gamers in the small tropical nation of Palinero on the verge of civil war. The mission: hire a band of mercenaries and take control of the deteriorating situation before the country finds itself in complete ruin. The story offers players the opportunity to experience three different viewpoints of the conflict or work outside the political structure to achieve your own goals in the global domination. Game play for the title is based on an innovative combat system called SPM (Smart Pause Mode) that successfully blends together real-time and turn-based games.\n\n\n\nESRB Rating: M for Blood and Gore, Drug References, Language, Sexual Themes, Violence\nGenre: Strategy\n\n\nGeneral Features\n\n    * Innovative combat system called Smart Pause Mode that blends together the elements of both RTS and TBS games\n    * Storyline and scripts of the game are written by Shaun Lyng, co-designer in the famous Jagged Alliance series\n    * More than 100 accurately modeled firearms\n    * Varied ammunition types: grenades, body armor and specialized equipment\n    * Option to upgrade and modify weapons by adding various gadgets, sniper scopes, bayonets, mini grenade launchers, etc\n    * Selection of specially balanced maps for Death match (up to 4 players, up to 6 players per party)\n    * Provides extensive LAN and Internet Multiplayer modes, with CTF, Death match and Fortress dynamic gameplay ","torrent":{"xt":"urn:btih:0e825b1a9e4dfc90febd2ba77e5d5bf1667d041d","amp;dn":"Brigade+E5%3A+New+Jagged+Union","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e825b1a9e4dfc90febd2ba77e5d5bf1667d041d","infoHashBuffer":{"type":"Buffer","data":[14,130,91,26,158,77,252,144,254,189,43,167,126,93,91,241,102,125,4,29]},"announce":[],"urlList":[]}}