{"title":"Julian Assange WikiLeaks Warrior For Truth","uid":7356420,"size":119985473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ea8c5290cd3ed7b5eff1fe16b43e4bd21e4a369&amp;dn=Julian+Assange+WikiLeaks+Warrior+For+Truth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IDARE","files":1,"time":1339787942,"description":" &lt;a href=&quot;http://www.i-dare.me/warriors4truth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.i-dare.me/warriors4truth&lt;/a&gt;\n\nDear Warriors for Truth,\n\nAs the co-author of the unofficial biography of the controversial WikiLeaks founder, Julian Assange, I was given the incredible opportunity to study this man's life. A man who I believe is one of the greatest inspirations of the modern age.\nHis activist approach to investigative journalism, whereby he used new and old media to expose the corruption and deception that exists behind the closed doors of many governments, corporations and even certain religions, won him numerous awards, thousands of supporters and a handful of enemies, too.\n\nI felt extremely privileged to document Assange's journey and share his inspiring story with the world.\nYet, in an ironic twist of fate, the publisher of this book failed to deliver on their end of the contract; withholding payment, selling the rights to various foreign territories while claiming they had no funds to pay the fees owed to the printer, the translator, the publicist, the researcher, Valerie Guichaoua (the co-author) and myself. As you can imagine everyone worked tirelessly to make\nthis book happen, and all concerned feel they were deeply betrayed by the people behind the publication, especially because of the subject matter.\n\nI felt we could not keep quiet about this act of injustice, and so, in the spirit of the WikiLeaks approach, I offer Julian Assange WikiLeaks: Warrior for Truth to the world for free.Rather than seek revenge or take legal action, instead I wish only for this book to reach and hopefully inspire as many people as possible. Normally priced at $24.95 you can download the book in PDF form here as a gift.\n\nPlease feel free to spread the word by sharing this link or to leave a comment in the discussion. What are your thoughts about the freedom of speech and information\ntransparency? I'd love to know.\n\nPersonally, I believe we are all being called to co-create a society of truth. One in which we challenge corporations and governments for greater transparency, where we foster a greater degree of honesty within our relationships, and with ourselves, where each of us can realize our individual truth; to fully express our gifts, talents, soul's purpose and in doing so give others'permission to do the same.\n\nEach of us has the opportunity to make a real difference in our families, our work, neighborhoods, communities, and countries, and, through the I DARE community support each other on this quest to co-create a new, more ethical world.\nRather than remaining as a passive audience member watching the truth-seeking actions of a warrior such as Julian Assange, it's time for us to stand up and become Warriors for Truth ourselves by being daring in our actions.\n\nWith honor and respect,\n\nSophie Radermecker\nFounder of I DARE\nwww.i-dare.me\n\n","torrent":{"xt":"urn:btih:0ea8c5290cd3ed7b5eff1fe16b43e4bd21e4a369","amp;dn":"Julian+Assange+WikiLeaks+Warrior+For+Truth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ea8c5290cd3ed7b5eff1fe16b43e4bd21e4a369","infoHashBuffer":{"type":"Buffer","data":[14,168,197,41,12,211,237,123,94,255,31,225,107,67,228,189,33,228,163,105]},"announce":[],"urlList":[]}}