{"title":"Defend The  v07.08.2015","uid":12217864,"size":265134320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f3a662319a28fe156f82c8f83bebf83c8c32946&amp;dn=Defend+The++v07.08.2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dauphong","files":1,"time":1439287785,"description":"\nAbout This Game\nDefend the Highlands combines the genres of Tower Defence, Real Time Strategy, and Scotland. The player will have to build defences, recruit Scotsmen and manage their porridge stockpile as they fight off the English invasion of Scotland.\n\nThe player will control a band of Scotsmen, led by the short, hairy and nationalistic pub owner Alfredo. Making use of traditional Scottish weaponry, such as golf clubs and haggis catapults, the band of Scotsmen must defend locations around Scotland, Wales and England, as they defend their homeland, and then take the fight to the enemy.\n\n    Fight wacky enemies: Welshmen who ride sheep into battle, English teapot hurlers, Irish potato farmers, and many more.\n    Build crazy defensive structures including porridge cannons, turnip turrets and cheese wheel stations.\n    Building defenses is only half the equation. Unlike ordinary tower defense games, you will also have to man your towers with Scotsmen.\n    Recruit Scotsmen to your cause by playing bagpipes - but be sure to keep your bagpipe players defended.\n    Capture and hold oat farms to keep your porridge stockpile full.\n    Command powerful hero characters, from the humble pub owner Alfredo, to the great William Wallace himself.\n    Earn points and upgrade your Scotsmen and defensive structures.\n    Fight the enemy through a 20 level story mode, or play custom matches in skirmish mode","torrent":{"xt":"urn:btih:0f3a662319a28fe156f82c8f83bebf83c8c32946","amp;dn":"Defend+The++v07.08.2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f3a662319a28fe156f82c8f83bebf83c8c32946","infoHashBuffer":{"type":"Buffer","data":[15,58,102,35,25,162,143,225,86,248,44,143,131,190,191,131,200,195,41,70]},"announce":[],"urlList":[]}}