{"title":"Susan and God (1940) Xvid 1cd - Joan Crawford [DDR]","uid":9372677,"size":765546496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0fdd40c6e702d7629b0a1eb63eb47068e34976e1&amp;dn=Susan+and+God+%281940%29+Xvid+1cd+-+Joan+Crawford+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1387559266,"description":"Susan and God (1940) Xvid 1cd - Joan Crawford [DDR]\n\nSusan and God is a 1940 comedy-drama film released by Metro-Goldwyn-Mayer starring Joan Crawford and Fredric March in a story about a matron who finds religion. The screenplay by Anita Loos was based upon a 1937 play by Rachel Crothers. The film was directed by George Cukor and produced by Hunt Stromberg. \n\nCAST:-\nJoan Crawford.....Susan\nFredric March.....Barrie\nRuth Hussey.......Charlotte\nJohn Carroll......Clyde\nRita Hayworth.....Leonora\nNigel Bruce.......Hutchie\nBruce Cabot.......Michael \n\nSusan (Crawford), a flighty society matron, returns from Europe waxing enthusiastic about a new religious movement that alienates friends &quot;Hutchie&quot; and Charlotte (Nigel Bruce and Ruth Hussey). Susan's own life is in disarray: she is estranged from her intelligent and sensitive husband Barrie (March) and has neglected her introverted and maladjusted daughter Blossom (Rita Quigley). At first, Barrie is taken in by Susan's new passion, believing it is a sign of maturity, but he suffers disappointment when he realizes it is simply another manifestation of her shallowness. Gradually, Susan begins to understand the pain she has caused her family and determines to put her own house in order before meddling in the lives of others. Cast includes Rita Hayworth, John Carroll, Bruce Cabot, Constance Collier, Gloria DeHaven, and Marjorie Main.\n\nDirected by George Cukor\nProduced by Hunt Stromberg\nWritten by Rachel Crothers\nScreenplay: Anita Loos\nMusic by Herbert Stothart\n\nRachel Crothers' thoughtful stage play Susan and God was tastefully adapted for the screen by Anita Loos. Joan Crawford stars as Susan, whose unquestioning devotion to various religious organizations causes a great deal of strain between herself and her family. When Susan embraces a &quot;New Thought&quot; theological movement, she decides to apply the tenets of this new philosophy to patch up the unhappy marriages within her own social circles. She succeeds only in making things worse, and in further harming her own relationship with husband Barrie (Fredric March) and daughter Blossom (Rita Quigley). But it is the unadorned, unpretentious religious faith of little Blossom that ultimately brings Susan and Barrie together again. When Susan and God was first released in 1940, Joan Crawford's performance was occasionally compared unfavorably to that of Gertrude Lawrence, who created the role of Susan on Broadway; it was suggested by some that Crawford patterned her portrayal exactly on Lawrence's, right down to the line delivery. Modern audiences, denied the opportunity to see Lawrence's interpretation, are less inclined to downgrade Crawford's work, which rates among her best\n\nSYNOPSIS:- Susan and God (1940)\nSusan Trexel is a wealthy socialite, who while vacationing in Europe undergoes a religious transformation. On her return to America, Susan takes on the task of spreading her new found religious experience with her closest friends - only to drive them crazy. Meanwhile, her husband Barrie, and daughter Blossom yearn for a stable family life. Barrie will even become sober, hoping that Susan will heed her own advice, and save their marriage and family. \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 117 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 117 mins","torrent":{"xt":"urn:btih:0fdd40c6e702d7629b0a1eb63eb47068e34976e1","amp;dn":"Susan+and+God+%281940%29+Xvid+1cd+-+Joan+Crawford+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fdd40c6e702d7629b0a1eb63eb47068e34976e1","infoHashBuffer":{"type":"Buffer","data":[15,221,64,198,231,2,215,98,155,10,30,182,62,180,112,104,227,73,118,225]},"announce":[],"urlList":[]}}