{"title":"Feeder_-_Renegades-(Limited_Edition)-2010-SiRE","uid":5711107,"size":67461832,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0fe6e331a56651d9977afc82969bf3f4deeaa106&amp;dn=Feeder_-_Renegades-%28Limited_Edition%29-2010-SiRE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PeteSapai","files":15,"time":1279900763,"description":"Artist:   Feeder\nTitle:    Renegades\nLabel:    Big Teeth Records\nGenre:    Rock\nBitrate:  233kbit av.\nTime:     00:38:26\nSize:     67.45 mb\nRip Date: 2010-07-03\nStr Date: 2010-07-05\n\n01. White Lines                                                   2:54\n02. Call Out                                                      3:27\n03. Renegades                                                     3:37\n04. Sentimental                                                   2:22\n05. This Town                                                     2:57\n06. Down To The River                                             5:23\n07. Home                                                          3:11\n08. Barking Dogs                                                  2:05\n09. City In A Rut                                                 2:51\n10. Left Foot Right                                               2:52\n11. Godhead (Bonus Track)                                         3:35\n12. The End                                                       3:12\n\nRelease Notes:\n\nThirteen years ago a very young and spritely three-piece from Cardiff\nmade their debut with an album called Polythene. It was a very heavy\nrecord, owing much to the grunge/alt.rock glory days of Nirvana,\nDinosaur Jr and Smashing Pumpkins. That band was Feeder.\n\nIn the 13 years and five albums that followed, they've had much to deal\nwith. Shortly after their breakthrough in 2001 with Echo Park, original\ndrummer and founding member Jon Lee tragically cut short his own life.\nInstead of calling time on the band, frontman Grant Nicholas and\nbassist Taka Hirose decided to keep going and made three more albums -\nComfort In Sound, Pushing The Sense and Silent Cry - with Skunk Anansie\ndrummer Mark Richardson.\n\nNow, following another drummer change - Karl Brazil is the new man\nbehind the drumkit as Richardson returns to his reformed old band -\nthey've decided to reinvent themselves. The hook-laden indie rock of\nthe past that brought them such hits as Buck Rogers and Feeling The\nMoment has been shunned aside as they return full-circle to their\ngrunge roots. Renegades, which was also the name of their alter-ego\nband that previewed new material earlier this year, is a drastic change\nbut it's also one that has given them a new lease of life. It's also\ntheir first self-released album, after the creation of their label, Big\nTeeth Records.\n\nRenegades is a concise and consistent rock record that rarely fails to\nthrill. From the opening salvo of White Lines right through to the\nthundering climax of The End, with a mid-tempo lighters-in-the-air\nanthem in-between courtesy of Down To The River, it'll no doubt make\nold-school fans jump in the air with joy. Songs like Home find the band\nat their most frantic-paced in years and songs like Sentimental deliver\ndeliciously heavy drop-D chords and a pounding bassline to boot.\n\nThere are two other main factors as to why this succeeds on so many\nlevels. Firstly, this is the first album since the death of Lee where\nit has felt like Feeder have been able to turn a new page. Their\nprevious three records were poignant affairs, so to hear Nicholas\nbellow songs like Barking Dogs and Left Foot Right is heartwarming.\nSecondly, it's a change in direction that doesn't feel contrived or\nforced - instead it feels like a natural step forward, the start of a\nnew chapter in the band's long career.\n\nIt remains to be seen whether this will hit the commercial heights that\nEcho Park and Comfort In Sound achieved, but Feeder are rejuvenated\nwith fire in their belly. It is a genuine thrill to see a band overcome\nso much tragedy and changes to regain their confidence. It feels like\nbeing reunited with a close friend you've not seen for over a decade.\nRenegades, quite unexpectedly, is one of the best British rock albums\nyou will hear all year.\n\nLimited edition including 1 bonus track and in a nice hard-back case.\nEnjoy!","torrent":{"xt":"urn:btih:0fe6e331a56651d9977afc82969bf3f4deeaa106","amp;dn":"Feeder_-_Renegades-%28Limited_Edition%29-2010-SiRE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe6e331a56651d9977afc82969bf3f4deeaa106","infoHashBuffer":{"type":"Buffer","data":[15,230,227,49,165,102,81,217,151,122,252,130,150,155,243,244,222,234,161,6]},"announce":[],"urlList":[]}}