{"title":"HURT The Re-Consumation [2008]","uid":4666115,"size":91238796,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0ff9339f51df959829145129873faf22f7fbf127&amp;dn=HURT+The+Re-Consumation+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mervosis","files":12,"time":1232570292,"description":"Hurt (sometimes typeset as HURT) is a rock band formed in 2000 in Virginia, and is now located in Los Angeles, California, United States. Currently unsigned, the band has put out two major label albums. The group consists of lead singer J. Loren Wince, guitarist Paul Spatola, and drummer Evan Johns. Bassist Josh Ansley left the band in April 2008 for personal reasons,[1] and was replaced by Rek Mohr (former bassist for the band Leo) in May 2008.\n\nThe band first released the independent albums Hurt in 2000 and The Consumation in 2003. Many of the songs from these albums found their way onto their first two major label releases, and The Consumation was re-mastered as The Re-Consumation in 2008. The band received critical (though not commercial) success with their major label debut album, Vol. 1, released on March 21, 2006. However, their singles &quot;Rapture&quot; and &quot;Falls Apart&quot; did gain minor radio airplay on rock stations in the United States. Their second album was the critically-acclaimed Vol. II, released on September 25, 2007, and they gained their largest radio rock hit yet with &quot;Ten Ton Brick.&quot;\n\nHURT is currently working on their forthcoming album, titled &quot;Goodbye to the Machine&quot;. The album, which is now in the post recording phase, is to be released on the &quot;Amusement&quot; record label.\n\nI personally love this band...their lyrics are original and open for interpretation and instrumentally sound..","torrent":{"xt":"urn:btih:0ff9339f51df959829145129873faf22f7fbf127","amp;dn":"HURT+The+Re-Consumation+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ff9339f51df959829145129873faf22f7fbf127","infoHashBuffer":{"type":"Buffer","data":[15,249,51,159,81,223,149,152,41,20,81,41,135,63,175,34,247,251,241,39]},"announce":[],"urlList":[]}}