{"title":"BLACK SABBATH Discography (includes 13) FLAC","uid":9235713,"size":6161083584,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ffd4f4ceaab05d2e0bdd9ce35b3b063d1a0c6d8&amp;dn=BLACK+SABBATH+Discography+%28includes+13%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AcesBack2Back","files":-1,"time":1385171037,"description":"From The Wikipedia:\n\n\nBlack Sabbath are an English rock band, formed in Birmingham in 1968, by guitarist Tony Iommi, bassist Geezer Butler, singer Ozzy Osbourne, and drummer Bill Ward. The band has since experienced multiple line-up changes, with Tony Iommi the only constant presence in the band through the years. Originally formed in 1968 as a heavy blues rock band named Earth, the band began incorporating occult themes with horror-inspired lyrics and tuned-down guitars. Despite an association with occult and horror themes, Black Sabbath also composed songs dealing with social instability, political corruption, the dangers of drug abuse and apocalyptic prophecies of the horrors of war.\n\nOsbourne's heavy drug use led to his dismissal from the band in 1979. He was replaced by former Rainbow vocalist Ronnie James Dio. After a few albums with Dio's vocals and songwriting collaborations, Black Sabbath endured a revolving line-up in the 1980s and '90s that included vocalists Ian Gillan, Glenn Hughes, Ray Gillen and Tony Martin, as well as multiple members of Deep Purple and Rainbow. In 1992, Iommi and Butler rejoined Dio and drummer Vinny Appice to record Dehumanizer. The original line-up reunited with Osbourne in 1997 and released a live album Reunion. Black Sabbath's 19th studio album, 13, which features all original members except Bill Ward, was released in June 2013.\n\nBlack Sabbath are cited as pioneers of heavy metal. The band helped define the genre with releases such as Black Sabbath (1970), Paranoid (1970) and Master of Reality (1971). They were ranked by MTV as the &quot;Greatest Metal Band&quot; of all time, and placed second in VH1's &quot;100 Greatest Artists of Hard Rock&quot; list. Rolling Stone magazine ranked them number 85 in their &quot;100 Greatest Artists of All Time&quot;. They have sold over 15 million records in the United States and over 70 million records worldwide. Black Sabbath were inducted into the UK Music Hall of Fame in 2005 and the Rock and Roll Hall of Fame in 2006.","torrent":{"xt":"urn:btih:0ffd4f4ceaab05d2e0bdd9ce35b3b063d1a0c6d8","amp;dn":"BLACK+SABBATH+Discography+%28includes+13%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ffd4f4ceaab05d2e0bdd9ce35b3b063d1a0c6d8","infoHashBuffer":{"type":"Buffer","data":[15,253,79,76,234,171,5,210,224,189,217,206,53,179,176,99,209,160,198,216]},"announce":[],"urlList":[]}}