{"title":"PBS.Wel.the.Club.The.Women.of.Rockabilly.XviD.AC3.MVGroup.Forum.","uid":6430725,"size":820083294,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:108498e7e48f269ed431a82b33f5436748e3ac3d&amp;dn=PBS.Wel.the.Club.The.Women.of.Rockabilly.XviD.AC3.MVGroup.Forum.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DocFreak08","files":-1,"time":1306638243,"description":"Their stage antics were sassy, aggressive, almost raunchy. Their vocal styles featured distinctly &quot;unladylike&quot; growls, hiccups and moans. Their lyrics spoke of parties and hot rods, teen love and teen angst. They played everywhere from country fairs to honky-tonks to rock shows. They boldly strutted their stuff and were billed as &quot;Little Miss Dynamite,&quot; &quot;The Nation's Number One Party Girl&quot; and &quot;The Female Elvis.&quot; In the eye-opening film WELCOME TO THE CLUB - The Women of Rockabilly, we meet four of the most influential rockabilly women - Wanda Jackson, Brenda Lee, Janis Martin, and Lorrie Collins.\n\nUniquely American artists, yet loved by enclaves of dedicated fans the world over, Wanda, Brenda, Janis and Lorrie were the queens of rockabilly - rock and roll's country cousin that had its short but influential heyday in the mid-1950s. For a few brief moments, they burst onto a predominantly male scene with an unprecedented musical message of female power and assertiveness. They not only bucked the staid notion of what was appropriate to sing as a country star, but also rejected the models of post-war femininity that were being marketed in the wider culture - models of suburban wedded bliss and a return to &quot;traditional&quot; motherhood. The women of rockabilly were anything but demure, decking themselves out in leather, denim or vampy, skin-tight sheath dresses.\n\nThe music known as rockabilly was an amalgam of swing, country, and rhythm and blues that first flourished in the southern and western United States in the mid-'50s and '60s. Elvis Presley, Jerry Lee Lewis and Carl Perkins were best known for it, daring to take the forbidden &quot;race&quot; music, black rhythm and blues, to a white listening public. Rockabilly defied the social order and was gender-bending material. Women challenged the status quo with sassy manners and musical aggression, while men adopted slithering wiggles, grew their hair longer and put an emotional cry in their voice.\n\nIn WELCOME TO THE CLUB, Brenda Lee, Lorrie Collins, Janis Martin and Wanda Jackson discuss their passion for the music, the trajectories of their careers and personal lives, and the surprise and pleasure with which they view the present-day resurgence of interest in their music. Clearly, they are genuine trailblazers, as full of life, defiance and exuberance today, in 2002, as when they first hit the stage over forty years ago.\n\nSure, Elvis was the King, but who was the Queen? The Women Of Rockabilly - Welcome To The Club is a documentary search for the &quot;Female Elvis&quot;, as we meet the women of rockabilly music and explore the &quot;what-if's?&quot; and &quot;what-now's&quot; of their careers. Brenda Lee, Wanda Jackson, Janis Martin and a sassy cast of lesser but no less colorful pretenders to the throne describe their trailblazing days when they were the embodiment of exuberance, sexuality and defiance in a world that wasn't quite ready for them. A rockin' feature documentary by Beth Harrington. Nominated for a 2003 Grammy award Best Long Form Music Video category.\n\nNarrated by Rosanne Cash\nProduced by Beth Harrington Film &amp; Video In association with Independent Television Service (2001)\n\n\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1724 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 56:43.200\nNumber Of Parts: 1\nPart Size: 820,083,294 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:108498e7e48f269ed431a82b33f5436748e3ac3d","amp;dn":"PBS.Wel.the.Club.The.Women.of.Rockabilly.XviD.AC3.MVGroup.Forum.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108498e7e48f269ed431a82b33f5436748e3ac3d","infoHashBuffer":{"type":"Buffer","data":[16,132,152,231,228,143,38,158,212,49,168,43,51,245,67,103,72,227,172,61]},"announce":[],"urlList":[]}}