{"title":"The Sorcerer's Apprentice","uid":6513159,"size":1795425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10a0f01f1ed2f1be8dbb35a3b1e04c3ef48c85e2&amp;dn=The+Sorcerer%5C%27s+Apprentice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309714532,"description":"Bruce Hillman, &quot;The Sorcerer's Apprentice: How Medical Imaging Is Changing Health Care&quot;\n Publisher: Oxford University Press, USA | 2010 | ISBN: 0195386965 | PDF | 264 pages | 3.2 MB\n\n Many will remember the segment of &quot;The Sorcerer's Apprentice&quot; in the Disney film Fantasia; it is a perfect metaphor for medical imaging as it stands today. The apprentice magician tests his nascent skills at sorcery by bringing common household items to life and putting them to work. At first, things go well, but eventually he loses control, and chaos ensues.\n\n Medical imaging, too, could spin out of control. The benefits of imaging are undeniable. In the past thirty years, innovations like CT, MRI, and PET scanning have not only markedly reduced clinical risk for patients but have also transformed medical practice. Its costs, however, have grown explosively, to the point where imaging expenses have become a political issue. The aggressive adoption of imaging technology has raised issues about the role of inappropriate economic incentives and the role of defensive medicine in driving up medical costs.\n\n Radiologists have utilized imaging technology to transform their practice from a pure diagnostic discipline into a curative one. Radiologists are among the most successful knowledge workers in the entire economy, leveraging digital information technology and Internet connectivity to become the first global medical discipline. Imaging is poised to make a further quantum advance - into the workings of the human cell and the molecular biology of complex disease.\n\n Where is this remarkable technology, and the discipline which uses it, headed? How can society make the most responsible use of this powerful new tool? How will imaging and radiologists reshape medical practice? These questions will be answered by The Sorcerer's Apprentice.","torrent":{"xt":"urn:btih:10a0f01f1ed2f1be8dbb35a3b1e04c3ef48c85e2","amp;dn":"The+Sorcerer%5C%27s+Apprentice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10a0f01f1ed2f1be8dbb35a3b1e04c3ef48c85e2","infoHashBuffer":{"type":"Buffer","data":[16,160,240,31,30,210,241,190,141,187,53,163,177,224,76,62,244,140,133,226]},"announce":[],"urlList":[]}}