{"title":"Feeder - Comfort in Sound [2002]","uid":9395972,"size":351624387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11ab75d14e6eaa56d9d124c03d74c881d894ec6d&amp;dn=Feeder+-+Comfort+in+Sound+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"elwin97043144","files":-1,"time":1387982414,"description":"When Feeder drummer Jon Lee unexpectedly took his own life in January 2002, the fate of the band was in question. Founding members Grant Nicholas and Taka Hirose had reservations about carrying on without their mate; however, Lee's family urged them to continue. Nicholas and Hirose and ex-Skunk Anansie drummer Mark Richardson spent most of that year crafting a dark, reflective set of songs. Comfort in Sound is Feeder's fourth album and a touching tribute to Lee. Featuring Feeder's most intimate and cohesive material to date, Comfort in Sound finds the group's peace of mind, but the album as a whole isn't exactly uplifting. The post-alternative mix of acoustic and electric guitars works with Nicholas' obvious emotional struggles. Moods and tempos are consistent in change, and such moves make Comfort in Sound as solid as it is. From the crunchy licks of &quot;Come Back Around&quot; to the positive energy of &quot;Forget About Tomorrow,&quot; Comfort in Sound waltzes along without getting lost in song and craft. This album was a journey for Nicholas and Hirose. They came out on the other side with a greater appreciation for Feeder and a brand new musical freshness. Comfort in Sound is their proof of surviving tragedy and it's a great moment. (3/5)","torrent":{"xt":"urn:btih:11ab75d14e6eaa56d9d124c03d74c881d894ec6d","amp;dn":"Feeder+-+Comfort+in+Sound+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11ab75d14e6eaa56d9d124c03d74c881d894ec6d","infoHashBuffer":{"type":"Buffer","data":[17,171,117,209,78,110,170,86,217,209,36,192,61,116,200,129,216,148,236,109]},"announce":[],"urlList":[]}}