{"title":"911 - The Great Conspiracy: 911 News Special You Never Saw","uid":3412486,"size":523257856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:11f4bc810c7f6bf87d122560c1b944a17b45963a&amp;dn=911+-+The+Great+Conspiracy%3A+911+News+Special+You+Never+Saw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ReVIsed","files":1,"time":1132682183,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot;. Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be setled sooner rather than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nTHE GREAT CONSPIRACY: The 9/11 News Special You Never Saw is a 70-minute sequel to The Great Deception. That is a ground-breaking 44-minute video also by Barrie Zwicker. He was the first mainstream journalist in the world to go on air (in January 2002) and ask hard questions about the official story of 9/11. The Great Deception is a compilation of his series of seven commentaries on 9/11. In The Great Conspiracy, Zwicker updates and expands his critique. He analyses the use of fear to befuddle the public. He deconstructs the so-called ?war on terrorism.? He examines in depth the failure of the military on 9/11 and George Bush?s highly inappropriate behaviour that day. He finds the 9/11 Commission to be a total coverup operation. Throughout, he analyses the role of the mainstream media as complicit in keeping the public massively misinformed and befuddled. And he suggests what we can do. Those who have seen both works find them complementary.\n\nGenre........: Documentary\nFilesize.....: 499 MB (or 510,994 KB or 523,257,856 bytes)\nRuntime......: 01:10:22 (126,540 fr)\nVideo Codec..: XviD\nVideo Bitrate: 859 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 124 kb/s (62/ch, stereo) VBR LAME3.90.#&amp;deg;\nFrame Size...: 512x384 (1.33:1) [=4:3]\n","torrent":{"xt":"urn:btih:11f4bc810c7f6bf87d122560c1b944a17b45963a","amp;dn":"911+-+The+Great+Conspiracy%3A+911+News+Special+You+Never+Saw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f4bc810c7f6bf87d122560c1b944a17b45963a","infoHashBuffer":{"type":"Buffer","data":[17,244,188,129,12,127,107,248,125,18,37,96,193,185,68,161,123,69,150,58]},"announce":[],"urlList":[]}}