{"title":"Raymond E. Brown - Introduction to the New Testament (pdf)","uid":8331269,"size":9820192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11f69a93624c4c0ba17a3df1c375d8b5a23a8954&amp;dn=Raymond+E.+Brown+-+Introduction+to+the+New+Testament+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1364894864,"description":"\nRaymond E. Brown - An Introduction to the New Testament (Doubleday, 1997). 878 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nThis is the best academic NT intro around, widely used in university and seminary courses.\n\n\ndescription:\n\n\nEvery generation needs a comprehensive, reliable Introduction to the New Testament that opens the biblical text to the novice. Raymond E. Brown's An Introduction to the New Testament is the most trustworthy and authoritative guidebook for a generation seeking to understand the Christian Bible.\n\nUniversally acknowledged as the dean of New Testament scholarship, Father Brown is a master of his discipline at the pinnacle of his career. Who else could cover the entire scope of the New Testament with such ease and clarity? This gifted communicator conveys the heartfelt concern of a beloved teacher for his students, as he walks the reader through the basic content and issues of the New Testament. While the book contains a wealth of information, its most impressive features are how the author boils down a life time of scholarship into basic summaries of each book, provides a historical overview of the ancient Greco-Roman world, engages in discussions of theological issues, and presents supplementary material for deeper understanding, such as tables, maps, bibliographies, and appendixes. Those opening to the New Testament for the first time and those seeking deeper insights could not ask for more in a primer to the Christian Bible.\n\nReview\n\nFrom its earliest days as a renegade religion in the Roman Empire through its various schisms and splits to present-day disagreements between Eastern Orthodox followers, Roman Catholics, and hundreds of different Protestant denominations, Christianity has been a source of great controversy--most of it centered on the reading of Scripture. There are those Christian conservatives who view the Bible as the literal word of God and the events detailed therein as historical fact. Other, more liberal Christians see the Good Book primarily as literature, a metaphor for how people should live. Mine the pages of the Biblical Archeological Review and you'll find scientists trying to prove or disprove the historical reality of Old and New Testament events and structures--everything from the Ark of the Covenant to King David's palace. In An Introduction to the New Testament, author Raymond E. Brown, a Catholic priest, ignores the swirl of conflict surrounding the Bible as historical artifact, concentrating instead on the message it contains.\n\nFather Brown analyzes each of the 27 books in the New Testament, devoting painstaking attention to sources, dates, and authorship, as well as commentary on the spiritual, historical, and thematic aspects. He believes that modern-day Bible readers can only interpret it within its historical context. An Introduction to the New Testament, read with a Bible in hand, can only enrich and deepen your understanding of that germinal religious text.\n\nFrom Library Journal\n\nDuring his career, Brown (emeritus, biblical studies, Union Theological Seminary, New York) has enlightened and challenged scholars. Here he brings his extensive knowledge to bear in a volume primarily for beginners, though it will serve equally well those who are not. Because of the intended audience, he has made certain choices about content and form. First, he focuses on the established 27-book New Testament canon based upon the &quot;wide agreement about the twenty-seven works to be included in a normative or canonical collection.&quot; Second, he deemphasizes the prehistory of the documents (sources, editions, and so forth) and emphasizes the documents in their canonical form. He begins most chapters with a &quot;General Analysis of the Message&quot; and addresses issues such as authorship, date, and composition afterward. So, for example, readers are helped to understand the individual messages of Matthew, Mark, and Luke without getting bogged down in the &quot;synoptic problem.&quot; Due to his emphasis on the finished form of the New Testament documents, even those who disagree with some of the author's critical judgments will benefit from this volume. Highly recommended for public and academic libraries.","torrent":{"xt":"urn:btih:11f69a93624c4c0ba17a3df1c375d8b5a23a8954","amp;dn":"Raymond+E.+Brown+-+Introduction+to+the+New+Testament+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f69a93624c4c0ba17a3df1c375d8b5a23a8954","infoHashBuffer":{"type":"Buffer","data":[17,246,154,147,98,76,76,11,161,122,61,241,195,117,216,181,162,58,137,84]},"announce":[],"urlList":[]}}