{"title":"Iesabel v2.01","uid":8902913,"size":664591976,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:137164751717f0fa2575759bf50dd4e059aa589c&amp;dn=Iesabel+v2.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mobile-warez","files":2,"time":1378845707,"description":"Size: 670 MB\nLanguage: English\nCompatibility: Requires iOS 6.0 or later. Compatible with iPhone, iPod touch, and iPad. This app is optimized for iPhone 5.\n\n\n\nDescription \n\nThe new breathtaking act of the story is now available. Head to the frozen North to seek answers to your questions.\n\nIn the times of darkness, only the mightiest of heroes can save the world. Stand out against the evil all by yourself in epic single player mode, or form an unstoppable team with up to 7 of your friends in an extraordinary co-op mode. Swarms of bloodthirsty monsters, loads of epic gear to collect, dozens of skills to obtain and the most beautiful world in any Action RPG Hack n Slash on iOS, await you. Grab your sword and fling yourself into action now!\n\n###\n\nIesabel is one of the biggest games on the App Store and will be updated monthly; with next chapter of the story unfolded in the 3.0 update. You'll head to the scorched South, struggle through blazing hot deserts, visit life-giving oasis and loot the ancient ruins of once glorious cities. Once the third episode is added the price will rise but if you buy Iesabel NOW you'll receive it for free!\n\n###\n\nTo experience full juiciness of game we seriously recommend that you use iPad 4 or iPhone 5. This game is not going to run neither on iPad 1 nor on iPhone 4 or older. Iesabel is a beautiful and detailed 3D game and as expected you'll need a powerful hardware to experience it in ultra HD graphics. For those with older devices we've included option to sacrifice graphics for higher FPS\n\n###\n\nPHENOMENAL SINGLE AND MULTIPLAYER MODE:\n- A fantastic, action-packed single player mode.\n- Amazing co-op multiplayer with up to 7 of your friends.\n- Cross-platform gaming. You have an iPhone, your friend has a Macbook Air, and other friend has an other mobile device? No problem! You can all freely play in co-op mode. You won't find it in any other RPG game in the App Store.\n- One of the biggest and most complex RPG games on App Store.\n\nAMAZING SCENERY:\n- Simply breathtaking 3D visuals, the best of any Action RPG on the iOS.\n- Multitude of unique locations, villages, swamps, caves, crypts and more.\n- Action-packed fights with variety of enemies: wildlife, undead, trolls, renegades and many more.\n- A climatic soundtrack perfectly fitting the atmosphere of darkness.\n\nCOMPLEX RPG MECHANICS:\n- Powerful range and melee characters.\n- Dozens of powerful skills to learn and use in your battles.\n- Thousands of weapons and items to collect. \n- Four categories of items: Normal, Unique, Epic and Legendary.\n- Multitude of immersive quests to complete.\n- Challenging fights with giant bosses.\n\nPERFECT FOR YOU:\n- True and upright Action RPG. No buying potions for real cash, no gems, no constant nagging for purchases like in other similar games and absolutely no In-App Purchases. You can't buy victory; you have to earn it with your own skills.\n- Intuitive touch controls.\n- Engaging story of hope, heroism and betrayal.\n- Hours of hack and slash mayhem.\n- Universal app suitable for iPhone and iPad.","torrent":{"xt":"urn:btih:137164751717f0fa2575759bf50dd4e059aa589c","amp;dn":"Iesabel+v2.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"137164751717f0fa2575759bf50dd4e059aa589c","infoHashBuffer":{"type":"Buffer","data":[19,113,100,117,23,23,240,250,37,117,117,155,245,13,212,224,89,170,88,156]},"announce":[],"urlList":[]}}