{"title":"The Battalion: The Dramatic Story of the 2nd Ranger Battalion in","uid":9313794,"size":4261881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13c5cb602b09363acec383faaf1c2330460de1c5&amp;dn=The+Battalion%3A+The+Dramatic+Story+of+the+2nd+Ranger+Battalion+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":1,"time":1386442817,"description":"The Battalion: The Dramatic Story of the 2nd Ranger Battalion in World War II\nby Col. Robert W. Black\n\nDESCRIPTION:\n\nWith a centuries' old warrior heritage, American Rangers endured the most difficult training that man could devise to overcome the most difficult challenges of the enemy and nature. For more than 14 months, the volunteers that made up the 2nd Ranger Battalion had been finely honed for combat. Now, on June 6, 1944 - D-Day - their battle would begin. The payoff was at hand. As the ramps of the landing craft went down, rockets on the sides of the ship fired ropes and grapnels skyward toward the cliff top. Some ropes fell short, men stepped into water that was over their heads and, loaded with equipment weighing over a hundred pounds, sank like stones. Sound and fury combined with fear and determination. Some men thought of the words they had heard each time they were tempted to complain, &quot;You volunteered.&quot; This work includes many battles fought by the Rangers after D-Day.\n\nGoes into exceptional detail on the D-Day assault of the gun positions at Pointe du     Hoc, including how it almost ended in total failure and lists the names of the Rangers who fought in the 2nd Battalion\nUnlike most books on the U.S. Army Rangers, this one also covers the many battles fought by the Rangers after D-Day\nBased on original documents and interviews with the surviving veterans by the author\n\ntitle link:\n","torrent":{"xt":"urn:btih:13c5cb602b09363acec383faaf1c2330460de1c5","amp;dn":"The+Battalion%3A+The+Dramatic+Story+of+the+2nd+Ranger+Battalion+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c5cb602b09363acec383faaf1c2330460de1c5","infoHashBuffer":{"type":"Buffer","data":[19,197,203,96,43,9,54,58,206,195,131,250,175,28,35,48,70,13,225,197]},"announce":[],"urlList":[]}}