{"title":"Iron Man v1 (Catseye2001) [h33t]","uid":4113668,"size":2990733049,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:145ad7ead05f8c62a8fb767bcdfc8aa4a241446b&amp;dn=Iron+Man+v1+%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Catseye2001","files":333,"time":1207187821,"description":"Iron Man volume 1. Although all of these issues are available in the Marvel Chronologies, there has been interest voice in having them collected in an Iron Man torrent, so here&amp;#039;s my contribution.\n\n\nIron Man volume 1 began in May of 1967, picking up from Tales of Suspense 99 and ran until September of 1996, when the Onslaught saga occurred.\n\nSnipped from Wikipedia:\n\nIron Man (Anthony Edward &quot;Tony&quot; Stark) is a fictional comic book superhero in the Marvel Comics universe. Created by writer-editor Stan Lee, writer Larry Lieber, and artists Don Heck and Jack Kirby, he first appeared in Tales of Suspense #39 (March 1963). Tony Stark, after being gravely injured and forced to build a devastating weapon, instead created a suit of power armor to save his life and help protect the world as Iron Man. He is a wealthy industrialist and genius inventor whose suit of armor is laden with technological devices that enable him to fight crime.\n\nThroughout most of his career, Iron Man has been a member of the superhero team the Avengers, and has been featured in several incarnations of his own various comic-book series. He has been adapted into animated films and TV series, and Academy Award nominated actor Robert Downey Jr. portrays him in an upcoming live-action film. Forbes has ranked Iron Man among the wealthiest fictional characters on their annual ranking.[1] BusinessWeek has also ranked Iron Man as one of the top ten most intelligent fictional characters in American comics.[2]\n\nI apologize in advance for my slow upload speeds, but I&amp;#039;m seeding as fast as I can (considering the awesome recently-posted torrents I MUST HAVE!) I will keep this up until it has plenty of seeds.  Enjoy!","torrent":{"xt":"urn:btih:145ad7ead05f8c62a8fb767bcdfc8aa4a241446b","amp;dn":"Iron+Man+v1+%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"145ad7ead05f8c62a8fb767bcdfc8aa4a241446b","infoHashBuffer":{"type":"Buffer","data":[20,90,215,234,208,95,140,98,168,251,118,123,205,252,138,164,162,65,68,107]},"announce":[],"urlList":[]}}