{"title":"World Sex Tour 22","uid":6380550,"size":1573431598,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1650ac9fca94b9a813620d72c1a91a629d37f4c2&amp;dn=World+Sex+Tour+22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"doggfrogg","files":16,"time":1305015290,"description":"Starring: Stascia, Diamond, Monique, Trudy, Michelle, Andrea, Mark Davis, Vince Vouyer, Lexington Steele.\n\n\n\n\n&quot;STASCIA is an exceptionally sexy petite 20-year-old Jamaican. She shares with us her 1st time anal ever, 1st time ever facial, and her 1st time ever sex with a white guy, Mark Davis does the honors! She has a pretty pussy and obviously loves to fuck!\n\n&quot;Big (natural) breasted slightly shy DIAMOND moans (and groans) nicely as Lexington and Vince plow her p**sy! This is the 1st time in her life she has ever had cum in her mouth!\n\n&quot;Little ANDREA has a nice round butt and is quite an enthusiastic cocksucker. She answers the challenge of a Lex &amp; Mark threesome with a very impressive cum facial and a good time is had by all!\n\n&quot;MONIQUE could be the poster girl for the saying, &quot;The darker the cherry, the sweeter the juice&quot;. Her ample ass, big breasts, and sexy smile put her at the top of most every tourist's wish list (especially Vince Vouyers')!\n\n&quot;MICHELLE was the first scene we shot in Jamaica, we were a little apprehensive having heard from local sources &quot;local girls seldom suck cock and NEVER do Anal&quot;. This lustful lass quickly relieved our apprehension as she proceeded to take on Vince and Lex and get herself double penetrated in the process! This young lady is one hot, horny, honey!\n\n&quot;TRUDY is definitely a sex monster! This girl deep throats, eats ass, fucks, and sucks and is basically just an insatiable fuck machine! She is ready, willing and able to do pretty much whatever is asked of her (we admire that in a woman). While sexing our three studs she gets double penetrated and also does double vaginal! Eventually she gets the &quot;sweet juice&quot; she has been starving for!\n\n&quot;These girls are great, I hope you enjoy watching these ebony beauties as much as I enjoyed shooting them! Special Thanks to the entire Anabolic team for enduring smoke filled rooms (it wasn't that bad), just to bring our viewers awesome erotic entertainment!&quot;&quot; ","torrent":{"xt":"urn:btih:1650ac9fca94b9a813620d72c1a91a629d37f4c2","amp;dn":"World+Sex+Tour+22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1650ac9fca94b9a813620d72c1a91a629d37f4c2","infoHashBuffer":{"type":"Buffer","data":[22,80,172,159,202,148,185,168,19,98,13,114,193,169,26,98,157,55,244,194]},"announce":[],"urlList":[]}}