{"title":"Think of a Number-Mantesh","uid":6053120,"size":14411385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16b8891b62cf546ca0654b6d76c547d0ca6f2030&amp;dn=Think+of+a+Number-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":3,"time":1292804760,"description":"[img]http://img843.imageshack.us/img843/7199/0852741839.jpg[/img]\n\n[b][code][color=Green]\n\nThink of a Number by M. E. Lines\n\n\nTaylor &amp; Francis \nMalcolm E Lines \n1990 \nISBN: 0852741839 \n172 pages \nPDF \nENGLISH\n13.7 MB\n\n\n\nHow many colors are needed to color a map? Must hailstones numbers always fall to the ground? Can statistics prove anything? What is a perfect square, and who has found the ultimate one? How do numbers affect national security? What kinds of problems confront the traveling salesman? Does anyone know how best to pack balls together? What is life like in 4 (or 3 1/2) dimensions? How does a clock count, and why should we care? What number secrets do sunflowers and pine cones conceal? What is a monster doing in mathematics?\n\nThese and many other fascinating questions about familiar numbers like 1, 2, and 3 are explored in Malcolm Line's second adventure into the world of numbers. Written in a lively and readable style, Think of a Number relates the story of some of the most famous problems that have confronted the world's experts over the centuries, from the earliest interests of the ancient Greeks to the very cutting-edge of modern research involving today's most powerful computers. The book explores the relationship between numbers and nature in its broadest sense and discovers the beauty of fractals and chaos. Requiring little or no prior knowledge of mathematics, this resource will be fascinating reading for anyone with an interest in numbers and their role in the natural world..................................\n\n\n[/color][/code][/b]","torrent":{"xt":"urn:btih:16b8891b62cf546ca0654b6d76c547d0ca6f2030","amp;dn":"Think+of+a+Number-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b8891b62cf546ca0654b6d76c547d0ca6f2030","infoHashBuffer":{"type":"Buffer","data":[22,184,137,27,98,207,84,108,160,101,75,109,118,197,71,208,202,111,32,48]},"announce":[],"urlList":[]}}