{"title":"Crash Test Dummies (2 early albums)  [FLAC] - Kitlope","uid":4735486,"size":539356108,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:176c1df3f4e60dbaf04af8e07404af9add227f09&amp;dn=Crash+Test+Dummies+%282+early+albums%29++%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":29,"time":1235257138,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 176C1DF3F4E60DBAF04AF8E07404AF9ADD227F09\nFile Size: 514.37 Mb\nYears: Ghosts That Haunt Me 1991, God Shuffled His Feet 1993\nLabel: BMG/Arista\nCatalog #: Ghosts That Haunt Me ARCD-8677; God Shuffled His Feet 74321-16531-2\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nThe Crash Test Dummies are a Canadian folk-rock group from Winnipeg, Manitoba, popular in the early 1990s.\n\nIn many ways, the origin of Crash Test Dummies is tied to the history of two Winnipeg nightspots, the Spectrum Cabaret and the Blue Note Cafe, owned by Curtis Riddell.\n\nIn the mid-1980s, Riddell joined with Brad Roberts to form the decidedly less-than-serious bar band Bad Brad Roberts and the St. James Rhythm Pigs. Over time, the band evolved into the Crash Test Dummies, a name suggested by a friend of the band in medical school. Ellen Reid and Benjamin Darvill became permanent additions. George West, the original bass player, quit and was replaced by Dan Roberts, Brad's brother. Riddell was replaced by Vince Lambert, who later left, replaced by Mitch Dorge around the time of the release of The Ghosts that Haunt Me.\n\nAfter signing with BMG records the band signed with manager Jeff Rogers (Swell).\n\nCrash Test Dummies first began to achieve commercial success in Canada with the release of The Ghosts that Haunt Me in 1991. The album eventually reached sales of 400,000 in Canada, largely due to the overwhelming popularity of the smash hit single &quot;Superman's Song,&quot; which earned the Dummies the 1991 Juno Award for Group of the Year.\n\nHowever, the Dummies did not receive much international recognition until the 1993 release of their second album, God Shuffled His Feet. Particularly instrumental in increasing CTD's exposure in the U.S. market was the appearance of a new type of radio format: adult album-oriented alternative rock (AAA). These stations put the first single &quot;Mmm Mmm Mmm Mmm&quot; in high rotation, and the song peaked at #4 in the US Hot 100. &quot;Mmm Mmm Mmm Mmm&quot; did even better in the UK, where it was a #2 hit, and Australia, where it peaked at #1.\n\nIronically, in their native Canada, the Dummies' &quot;Mmm Mmm Mmm Mmm&quot; was a comparative disappointment on the charts, only peaking at #14. However, two other songs from the album went top 10 in Canada: &quot;Swimming In Your Ocean&quot; and &quot;Afternoons &amp; Coffeespoons&quot;. This latter track was also a top 40 hit in Australia and the UK, and hit the lower portion of the US Hot 100. The result was that by mid-1994, the album had passed the platinum sales mark in the U.S. (one million), and had also earned the Dummies three Grammy nominations and three more Juno nominations. To date, God Shuffled His Feet has sold more than five and a half million copies worldwide.\n\nIn January 1995, the band released &quot;The Ballad of Peter Pumpkinhead&quot; (a cover of XTC's 1992 track) as a single and on the soundtrack of the Jim Carrey and Jeff Daniels comedy Dumb and Dumber. The single, credited to The Crash Test Dummies and Ellen Reid, charted at No. 30 in the UK singles chart and was a #4 hit in Canada.\n\nIn 1996, the Dummies' third album, A Worm's Life, was released to mixed critical and moderate commercial success. The guitar-heavy singles were warmly received in some markets (lead single &quot;He Liked To Feel It&quot; hit #2 in Canada), but internationally nothing matched the runaway success of either &quot;Superman's Song&quot; or &quot;Mmm Mmm Mmm Mmm&quot;. Still, the album went platinum in Canada in less than one month.\n\nGive Yourself A Hand, the Dummies' fourth album, was released March 23, 1999. The album showcased a new sound for the Dummies, as it featured Ellen Reid singing lead vocals on three tracks, and Brad Roberts singing in a falsetto on several others. The whole sound of the album was much more electronic than the previous recordings. Once again, the lead single (&quot;Keep A Lid On Things&quot; ) was a top 10 hit in Canada.\n\nDuring a hiatus between albums, Benjamin Darvill became the first Dummy to release solo material. Under the name Son Of Dave, Darvill first brought out the album B. Darvill's Wild West Show, followed with 01, both released on Benjamin's own label, Husky Records. \n\n\n\n\n\n\nThe Ghosts that Haunt Me \n\n\nThe Ghosts That Haunt Me is the 1991 debut album by Crash Test Dummies. It featured their hit &quot;Superman's Song&quot;.\nThe artwork featured on the cover is by 19th century illustrator Gustav DorÃƒÂ© and is from 'The Rime of the Ancient Mariner' by Samuel Taylor Coleridge.\n\n\nTracks: \n\n\n1.\t&quot;Winter Song&quot; \n2.\t&quot;Comin' Back Soon (The Bereft Man's Song)&quot; \n3.\t&quot;Superman's Song&quot; \n4.\t&quot;The Country Life&quot; \n5.\t&quot;Here on Earth (I'll Have My Cake)&quot; \n6.\t&quot;The Ghosts That Haunt Me&quot; \n7.\t&quot;Thick-Necked Man&quot; (Benjamin Darvill) \n8.\t&quot;Androgynous&quot; (Paul Westerberg) \n9.\t&quot;The Voyage&quot; \n10.\t&quot;At My Funeral&quot; \n\n\n\n\n\n\nGod Shuffled his Feet \n\n\nGod Shuffled His Feet is the second album by the Crash Test Dummies, released in 1993. It features their most popular single, &quot;Mmm Mmm Mmm Mmm.&quot; The cover art superimposes the band members' faces over the figures of Titian's painting Bacchus and Ariadne and has been considered one of the most bizarre album portraits of all time. It was their most successful album commercially, charting at #9 in the U.S. charts, as well as #1 in the UK charts.\n\n\nTracks: \n\n1.\t&quot;God Shuffled His Feet&quot; - 5:10 \n2.\t&quot;Afternoons &amp; Coffeespoons&quot; - 3:56 \n3.\t&quot;Mmm Mmm Mmm Mmm&quot; - 3:55 \n4.\t&quot;In the Days of the Caveman&quot; - 3:41 \n5.\t&quot;Swimming in Your Ocean&quot; - 3:49 \n6.\t&quot;Here I Stand Before Me&quot; - 3:07 \n7.\t&quot;I Think I'll Disappear Now&quot; - 4:52 \n8.\t&quot;How Does a Duck Know?&quot; - 3:42 \n9.\t&quot;When I Go Out with Artists&quot; - 3:44 \n10.\t&quot;The Psychic&quot; - 3:48 \n11.\t&quot;Two Knights and Maidens&quot; - 3:25 \n12.\t&quot;Untitled&quot; - 1:43\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:176c1df3f4e60dbaf04af8e07404af9add227f09","amp;dn":"Crash+Test+Dummies+%282+early+albums%29++%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"176c1df3f4e60dbaf04af8e07404af9add227f09","infoHashBuffer":{"type":"Buffer","data":[23,108,29,243,244,230,13,186,240,74,248,224,116,4,175,154,221,34,127,9]},"announce":[],"urlList":[]}}