{"title":"[DvdRip-Xvid-Ita-Mp3]La guerra dei Roses[survivalofmisa]","uid":5206276,"size":716408832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1865a33f8316b20d0f737004079c0940fa03f0f7&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DLa+guerra+dei+Roses%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"misafor","files":1,"time":1260387469,"description":"\n\nA Washington, Barbara Rose - dopo diciotto anni di sereno matrimonio allietato fin dall'inizio dalla nascita di due figli, Josh e Carolyn, - vuole dividersi dal marito Oliver perchÃƒÂ¨, dopo un presunto infarto di questi, si ÃƒÂ¨ accorta che la possibilitÃƒÂ  di restare vedova non le dispiaceva affatto, in quanto il marito - che le ha dato tutto ciÃƒÂ² che una donna puÃƒÂ² desiderare (tra cui Susan, una governante per la loro casa perfetta piena di oggetti d'arte) - tutto preso dalla propria carriera di avvocato non ha mai tenuto conto della sua individualitÃƒÂ . A malincuore Oliver si rivolge a Gavin D'Amato, un avvocato amico di famiglia, per accordarsi sul divorzio: da questo momento inizia fra i coniugi una guerra accanita in quanto nÃƒÂ© l'uno nÃƒÂ© l'altra vogliono lasciare la dimora in cui hanno vissuto. Costretti a vivere separati nella stessa casa, limitano - con tanto di piantina a colori - i rispettivi habitat. L'accordo ÃƒÂ¨ finito (e i due figli ancora giovanissimi ne risentono), mentre subentrano ripicche, scherzi atroci, rivalse e cattiverie in un turbine di porcellane preziose (sono di Oliver, ma Barbara infuriata le manda in briciole) e di odio reciproco. In realtÃƒÂ  Oliver vuole ancora molto bene alla moglie, ma Barbara si ÃƒÂ¨ stufata di fare la donna di casa, essendosi scoperta vocazioni manageriali. Gavin D'Amato tenta la riconciliazione, ma la cocciutaggine dei due ÃƒÂ¨ come un muro insormontabile. I reciproci perfidi dispetti determinano dapprima la totale devastazione della loro splendida abitazione e, successivamente, la loro morte dopo essere precipitati nel vuoto appesi ad un grande lampadario\n","torrent":{"xt":"urn:btih:1865a33f8316b20d0f737004079c0940fa03f0f7","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DLa+guerra+dei+Roses%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1865a33f8316b20d0f737004079c0940fa03f0f7","infoHashBuffer":{"type":"Buffer","data":[24,101,163,63,131,22,178,13,15,115,112,4,7,156,9,64,250,3,240,247]},"announce":[],"urlList":[]}}