{"title":"The Beach Boys - Pet Sounds (DCC)","uid":4676102,"size":440669674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:19c4ddee57c2b6b980b4af399148d1ad40c2a6b8&amp;dn=The+Beach+Boys+-+Pet+Sounds+%28DCC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mofie108","files":17,"time":1232905979,"description":"Not my rip. All the thanks and respect to the original ripper and uploader. All files in wav uncompressed format. \n\nmofie108\n\n\nThe Beach Boys - Pet Sounds (1966) - DCC Gold (1993)\n\n\nCD FULL RANGE ONLY | EAC RIP (WAV+CUE) | COVERS | 402 MB \n\n\nDCC Compact Classics | AUDIOPHILE CD\n\n\n# Audio CD (1993)\n\n# Format: Gold CD, Limited Edition, Original recording reissued, Original recording remastered\n\n# Label: DCC Compact Classics\n\n# Catalog Number: 1035\n\nRemastered by Steve Hoffman from the original unequalized full-track monophonic master mixes.\n\n\n\nAlbum notes\n\nBeach Boys: Brian Wilson, Carl Wilson, Dennis Wilson, Mike Love, Al Jardine, Bruce Johnston.\nAdditional personnel: Tommy Tedesco, Jerry Cole, Billy Strange, Barney Kessel, Glen Campbell (guitar); The Sid Sharpe Strings (strings); Tommy Morgan (harmonica); Carl Fortina, Frank Marocco (accordion); Steve Douglas, Jay Migliori, Roy Caton, Lou Backburn (horns); Al De Lory, Don Randi, Leon Russell (piano); Ray Pohlman, Carole Kaye, Lyle Ritz, Julius Wechter, Bill Pitman (bass); Hal Blaine (drums); Gene Estes, Frank Capp, Jim Gordon (percussion).\nRecorded at Gold Star Studios, Western Studios and Sunset Sound Studios, Hollywood, California between July 12, 1965 and April 13, 1966. Originally released on Capitol (T-2458). Includes liner notes by Brian Wilson.\nRemastered by Steve Hoffman (April 1993).\nAll songs written or co-written by Brian Wilson, except &quot;Sloop John B&quot; (Traditional).\nThis is more than just an album by a great American band; it's THE great American pop album, an ambitious foray into the intricacies of harmony and melody. Masterminded by Brian Wilson, it changed the rules in rock &amp; roll. Wilson's production brought record-making to a new level. He perfected Phil Spector's wall-of-sound into a more complex, stunning approach. He was inspired by the Beatles' RUBBER SOUL, and PET SOUNDS was, in turn, an inspiration for SGT. PEPPER.\nThe devoutly romantic &quot;God Only Knows&quot; and the hopeful &quot;Wouldn't It Be Nice&quot; reflect an innocent time of yearning post-adolescence. From the complex upward progressions of &quot;You Still Believe In Me&quot; to the heartbeat bass of &quot;Don't Talk (Put Your Head On My Shoulder),&quot; Wilson paid attention to every nanosecond of sound. The traditional folk song &quot;Sloop John B,&quot; with its thickly interwoven vocals, was a major hit for the band, but PET SOUNDS' astonishing power comes from its less familiar songs. The shifting moods and devious instrumentation of &quot;I'm Waiting For The Day&quot; and the revealing &quot;I Just Wasn't Made For These Times&quot; are further testaments to Wilson's tortured genius. Wilson has said that angels were overseeing the production of PET SOUNDS; there is no doubt about it.\n\nEditorial reviews\n\nVoted the #1 Recorded Music Award for 1990.\nQ Magazine (02/01/1991)\n\n...Brian Wilson's evolutionary compositional masterpiece....This trenchant cycle of love songs has the emotional impact of a shatteringly evocative novel...\nRolling Stone Magazine (06/22/1972)\n\n...A commercial washout at the time of its release, the album has since grown in reputation to the point where pop aesthetes speak of it in hushed tones as the zenith of Brian Wilson's genius, a seamless masterwork that rewards deep, repeated listening....a wonderful collection of songs... - Rating: A+\nEntertainment Weekly (12/12/1997)\n\nRanked #1 in NME's list of the 'Greatest Albums Of All Time.'\nNew Musical Express (10/02/1993)\n\n5 Stars - Excellent - ...the music on PET SOUNDS flows as one...clearly demonstrates [that] the Beach Boys were capable of giving music lovers something they could feel very, very good about...\nDown Beat (09/01/1990)\n\nTracklisting:\n\n1. Wouldn't It Be Nice\n2. You Still Believe In Me\n3. That's Not Me\n4. Don't Talk (Put Your Head On My Shoulder)\n5. I'm Waiting For The Day\n6. Let's Go Away For Awhile\n7. Sloop John B\n8. God Only Knows\n9. I Know There's An Answer\n10. Here Today\n11. I Just Wasn't Made For These Times\n12. Pet Sounds\n13. Caroline, No\n14. Conclusion\n15. Hang On To Your Ego\n\nRemastered by Steve Hoffman from the original unequalized full-track monophonic master mixes.\n","torrent":{"xt":"urn:btih:19c4ddee57c2b6b980b4af399148d1ad40c2a6b8","amp;dn":"The+Beach+Boys+-+Pet+Sounds+%28DCC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19c4ddee57c2b6b980b4af399148d1ad40c2a6b8","infoHashBuffer":{"type":"Buffer","data":[25,196,221,238,87,194,182,185,128,180,175,57,145,72,209,173,64,194,166,184]},"announce":[],"urlList":[]}}