{"title":"Midori (ãƒŸãƒ‰ãƒª) Discography - 2003-2010 (All albums + videos) (Punk","uid":7392514,"size":4682200710,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1a9c08c46a2162d5183d8cff0bed9091c0992612&amp;dn=Midori+%28%E3%83%9F%E3%83%89%E3%83%AA%29+Discography+-+2003-2010+%28All+albums+%2B+videos%29+%28Punk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kawoshin","files":-1,"time":1340821797,"description":"Discography for Osaka punk legends Midori (ãƒŸãƒ‰ãƒª). Their final lineup consisted of Mariko Gotou (vocals, guitar), Yoshitaka Kozeni (drums), Hajime (keyboard), and Keigo Iwami (bass).\n\nThis has everything from their first two demos to their final album, as well as the limited edition Swing single, the Melon Kinenbi split single, and some other songs the band did for compilations. As far as compilations go, I believe I'm missing two or three songs that I can't get outside of buying the respective comps, but it's no big deal. I've also included an EP from the punk band Usagi, which Mariko Gotou was in before starting Midori. Make sure to check that out as well. The lowest bitrate is their demos and one album (Shimizu) at 128 (still sounds fantastic), but everything else ranges from 192 to 320, all MP3.\n\nThere's also a collection of videos. This includes all of their music videos except for Romantic Natsu Mode (I can't find that video anywhere). These were from the Sayonara, Gotou-san bonus disc, but the Doping Noise Noise Kiss video is an upscaled Nico rip (best I could do). The other videos are live videos, including the Hatsutaiken and Sayonara, Gotou-san live DVDs (can't find the 2005-2006 DVD) and some others. To play the videos, you'll need the latest CCCP, which can be found here: http://www.cccp-project.net/. If you don't have that, they won't play correctly, and nobody wants something like that to happen.\n\nEverything is in romaji with proper tags and such, so there should be no issues with understanding names and whatnot, I hope. Covers are included and there are text files for the Japanese lyrics for almost everything, should anyone want those (It would be fucking awesome if someone translated all their stuff, just saying. I can only understand so much). If anyone wants translated song names, though, just ask and I'll hook you up.\n\nThat being said, I love this band a lot, and I'm sure there's at least one person looking for their stuff, so I hope this helps. If there are any problems, let me know. Enjoy!","torrent":{"xt":"urn:btih:1a9c08c46a2162d5183d8cff0bed9091c0992612","amp;dn":"Midori+%28%E3%83%9F%E3%83%89%E3%83%AA%29+Discography+-+2003-2010+%28All+albums+%2B+videos%29+%28Punk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a9c08c46a2162d5183d8cff0bed9091c0992612","infoHashBuffer":{"type":"Buffer","data":[26,156,8,196,106,33,98,213,24,61,140,255,11,237,144,145,192,153,38,18]},"announce":[],"urlList":[]}}