{"title":"FXhome VisionlabStudio Pro v10-Full(+300custom Pre-Sets)","uid":4572675,"size":67406268,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ac1ce69e9db2831169d355c198a7abad460a892&amp;dn=FXhome+VisionlabStudio+Pro+v10-Full%28%2B300custom+Pre-Sets%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HaizzaT","files":1,"time":1229112117,"description":"  Manufactor's Description\n                           ~~~~~~~~~~~~~~~~~~~~~~~~\n\n    Discover advanced compositing, a sophisticated particle system, a range\n    of CG effects and a huge selection of grading filters all in a single\n    application. A full commercial licence is included, making VisionLab\n    Studio ideal for professionals on a budget.\n\n\n    Create incredible special effects:\n    ----------------------------------\n\n    Choose from hundreds of different visual effects, powered by four highly\n    flexible engines that provide full creative control.\n\n    * Muzzle flashes: Photo-realistic, 3D flashes for any type of explosive\n      weapon. Exciting action sequences can now be safe and realistic.\n\n    * Particles: An endless variety of particle-based effects, including:\n      smoke, rain, fireballs, blood squibs, bullet impacts and many more.\n\n    * Optics: Select a lens flare preset or construct your own using a\n      versatile shape editor. Perfect for enhancing on-set lighting and CG\n      effects.\n\n    * Neon light: Stunning hand-drawn neon for vivid sci-fi and fantasy\n      movies with versatile glow options and animation.\n\n\n    Professional compositing toolkit:\n    ---------------------------------\n\n    Combine different movie clips and still images, including greenscreen\n    footage, to create entirely new shots.\n\n    * Pre-key grading: Enhance your image quality before compositing for\n      the best possible results.\n\n      Green and blue screens no longer require perfect lighting to achieve\n      perfect results.\n\n    * Keying options: Effortlessly remove green and bluescreens using a\n      selection of optimized tools.\n\n    * Garbage mattes: Clean up any composite using hand-drawn garbage mattes\n      that can be easily animated and positioned.\n\n    * Animation: Movie clips and images can be scaled, positioned and warped\n      using context-sensitive canvas tools. Ideal for presentations as well\n      as intricate compositing.\n\n    * Masking: Blend separate movies together using a variety of masks,\n      including hand-drawn shapes and alpha transparency from other objects.\n\n    * Composite filters: Explore exciting and innovative visual possibilities\n      with displacement warping, gleam rays, cinematic glow and realistic\n      light spill.\n\n\n    Digital colour grading:\n    -----------------------\n\n    Craft a memorable visual style for any type of video production.\n\n    * Colour correction: Easily match footage from different sources using a\n      vast selection of grading filters.\n\n    * Digital selection: Grading filters can be used on specific areas of\n      your image. Alter the colour of an actor's eyes without affecting his\n      skin tone, for example.\n\n    * Mood and atmosphere: Whether you need harsh, cold, winter blues or\n      warm, sun-drenched\n\n      summer reds, the grading filters can give your movie a unique identity\n      or replicate an existing cinema style.\n\n    * Distortion: Create artificial depth of field, motion blur, over-exposure\n      as well as twirls and waves.\n\n\n    Simple and powerful:\n    --------------------\n\n    A fast and efficient interface provides endless creative possibilities\n    while remaining easy to use.\n\n    * Commercial licence: A VisionLab exclusive commercial licence allows full\n      use in all productions without requiring an FXhome on-screen credit.\n\n    * Preset library: Choose from a huge selection of included presets, with\n      more added everyday to the free online FXhome.com library.\n\n    * Alpha support: Work with full alpha channel support, from alpha masks to\n      final rendered output, ensuring easy integration with other applications.\n\n    * High Definition support: Work with mixed source footage, from standard\n      miniDV to high definition resolution video and still images.\n\n    * Keyframe animation: All your decisions are stored as timeline keyframes,\n      allowing for precision and easy adjustment.\n\n    * Languages: VisionLab Studio's interface can be used in several languages\n      including: English, French, Spanish, Italian and German.\n","torrent":{"xt":"urn:btih:1ac1ce69e9db2831169d355c198a7abad460a892","amp;dn":"FXhome+VisionlabStudio+Pro+v10-Full%28%2B300custom+Pre-Sets%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac1ce69e9db2831169d355c198a7abad460a892","infoHashBuffer":{"type":"Buffer","data":[26,193,206,105,233,219,40,49,22,157,53,92,25,138,122,186,212,96,168,146]},"announce":[],"urlList":[]}}