{"title":"Star Wars The Force Unleashed 2 USA Wii ","uid":5912827,"size":4647356610,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:1ae1ed81131a52f0f9262885e5bda5d14bd82727&amp;dn=Star+Wars+The+Force+Unleashed+2+USA+Wii+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sonyds","files":96,"time":1288111657,"description":"Plataforma: Nintendo Wii\nGÃƒÂ©nero: AcciÃƒÂ³n, Aventura\nTemÃƒÂ¡tica: Ciencia ficciÃƒÂ³n\nDesarrollado por: LucasArts\n\n\nSecuela del interesante El Poder de la Fuerza de LucasArts. MÃƒÂ¡s acciÃƒÂ³n, combates que ganan en espectacularidad y una historia igual de interesante dentro del universo Star Wars.\n\nStar Wars: The Force Unleashed, Star Wars: El Poder de la Fuerza,[1] o Star Wars: La Fuerza Desencadenada[2] es un videojuego de la nueva generaciÃƒÂ³n de Star Wars y que es parte medular del proyecto multimedia Star Wars: The Force Unleashed. Como el nombre lo dice estÃƒÂ¡ centrado en el uso de La Fuerza y con el uso de las nuevas tecnologÃƒÂ­as que introduce prometen que la experiencia serÃƒÂ¡ como nunca antes. La historia, creada bajo la direcciÃƒÂ³n de George Lucas, promete descubrir muchas novedades sobre el Universo de Star Wars que tienen lugar en la poco explorada ÃƒÂ©poca entre las pelÃƒÂ­culas Star Wars: Episode III - Revenge of the Sith y Star Wars: Episode IV - A New Hope. AquÃƒÂ­ los jugadores caracterizarÃƒÂ¡n a un villano, el Aprendiz Secreto de Darth Vader, que deberÃƒÂ¡ hacer frente a los enemigos usando los poderes de la fuerza y afrontar decisiones que podrÃƒÂ­an cambiar el curso de su destino. El aprendiz ha sido enviado por Vader, a viajar por toda la galaxia y destruir al resto de los Jedi que sobrevivieron a la Orden 66. Fue publicado a nivel mundial y en diversas plataformas a partir del 16 de septiembre de 2008.\n\nEl juego usarÃƒÂ¡ &quot;Digital Molecular Matter&quot; desarrollado por Pixelux Entertainment para objetos dinÃƒÂ¡micamente destructibles, el sistema &quot;euphoria&quot; desarrollado por NaturalMotion ltd que dirigirÃƒÂ¡ el comportamiento e inteligencia artificial y Havok para la rigidez del cuerpo. Gracias al &quot;Digital Molecular Matter&quot; de Pixelux podemos ver perfectamente el relÃƒÂ¡mpago de la Fuerza o la telekinesis del \nprotagonista del juego.\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:1ae1ed81131a52f0f9262885e5bda5d14bd82727","amp;dn":"Star+Wars+The+Force+Unleashed+2+USA+Wii+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ae1ed81131a52f0f9262885e5bda5d14bd82727","infoHashBuffer":{"type":"Buffer","data":[26,225,237,129,19,26,82,240,249,38,40,133,229,189,165,209,75,216,39,39]},"announce":[],"urlList":[]}}