{"title":"Machines (1999) (European Version)","uid":7069444,"size":1349340662,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1af9c627f767be4e77f0699ceb7b2bb9ebf470eb&amp;dn=Machines+%281999%29+%28European+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bevinsky","files":4,"time":1330609784,"description":"Machines is a 3D real-time strategy game released for Microsoft Windows. Published by Acclaim and developed by Charybdis, Machines was one of the first 3D games of this genre. It also allowed players to directly control units with both a first and third-person view.\n\nMachines uses a 3D polygonal landscape, which players can use to their advantage, attacking from or hiding behind hilltops. The viewpoint can be switched between a default isometric, strategic 'zenith' camera, and first person perspective; the latter typically being used to explore buildings during espionage missions.\n\n50 different machines can be researched and built, characterized by a plasma-based techtree and a projectile-based techtree combined with different methods of movement (Examples: 4 or 6 Spider legs, Wheels, Tracks, Hover-engines, Flying, 2 Legs). Furthermore, battalions can be developed with specific strengths to support a personalized fighting strategy. The game also includes 25 different weapons, including Flame-throwers, Vortex Singularities, Plasma Rifles, Mini-guns, Ion Cannons and Nukes.\n\nSabotage and espionage missions allow units to deposit mines inside enemy buildings, steal research, and pass back vital information.\n\nMachines is multiplayer over a LAN or the internet.","torrent":{"xt":"urn:btih:1af9c627f767be4e77f0699ceb7b2bb9ebf470eb","amp;dn":"Machines+%281999%29+%28European+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1af9c627f767be4e77f0699ceb7b2bb9ebf470eb","infoHashBuffer":{"type":"Buffer","data":[26,249,198,39,247,103,190,78,119,240,105,156,235,123,43,185,235,244,112,235]},"announce":[],"urlList":[]}}