{"title":"Young Dumb And Filled With Chocolate Cum - Interracial Porn XXX","uid":9470720,"size":2712393152,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1b1d38aee425d2875c38d2c4c35b644e7fb2477d&amp;dn=Young+Dumb+And+Filled+With+Chocolate+Cum+-+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1389560085,"description":"Young, Dumb and Filled with Chocolate Cum\n\nTwo Shots in Every Girl!\n\n18 and 19 year olds -- There's nothing like it! These girls are so dumb that they let us fill up their pussies with - not one, but two loads of gooey, thick impregnating juice! - and then they go back to their man filled with our cum! Yeah!\n\n    Scene 1. Naudia Rio, Darren James, Mark Anthony\n    Scene 2. Adrianna, Mark Anthony, Max Black\n    Scene 3. Jay Star, Darren James, Max Canada\n    Scene 4. Myriam, Max Black, Max Canada\n    Scene 5. Patricia Petite, Max Black, Max Canada\n    Scene 6. Luci Thai, Darren James, Mark Anthony\n\nLength 2 hrs. 18 mins.\nRating XXX\nReleased Mar 29 2004\nProduction Year 2004\nStudio  Evasive Angles\n\nActresses:\n    Adrianna [Anal Creampie IR]\n    Jay Star [Anal Facial Creampie IR]\n    Luci Thai [Anal A2M Creampie]\n    Myriam (as Myrian) [Creampie IR]\n    Naudia Rio (as Nadia) [Anal Creampie IR]\n    Patricia Petite [Facial Creampie IR]\n\nActors:\n    Darren James\n    Mark Anthony\n    Max Black\n    Max Canada\n\nScene 1: Nadia Rio, Mark Anthony, Darren James\nThemes: Interracial, Anal, Internal Cumshot\nScene Rating: 9/10\nScene Breakdown: Getting the moving rolling we have Nadia, Mark and Darren. Nadia is a cute and sexy looking girl with medium length brown hair and natural B cup tits (large tattoo on back and REALLY resembles Patricia Arquette). The scene begins with TT talking to Nadia. She tells us she's 18, 5' 10&quot; tall, from Las Vegas and then she shows off her tits. As the interview continues she says she's only been with about 10 guys, her favorite position is doggy, likes to be spanked (at this point she gives a very nice shot of her ass/pussy) and really likes rough sex! Cutting away the guys move into the scene and after a little fun between them they start sucking her tits and eating her pussy briefly before she sits up and sucks their cocks. Darren then takes a seat and Nadia gets into doggy to keep sucking him as Mark moves around and begins fucking her; we get some really nice shots too. Cutting away we then see Nadia on her side as Darren pushes into her ass, there are plenty if nice shots of the action, then we cut again, keeping in the anal theme, as she rides in cowgirl; again NICE shots. As the movie draws to and end we cut to her in missionary with Mark pumping away on her pussy, eventually cumming inside her leaving a absolutely perfect and beautiful cream pie! Darren then steps in and fucks her pussy as well and he leaves a good cream pie as well. This was a very good scene. I really liked Nadia and she seemed into the action nicely. The sex looked on the dry side!\n\nScene 2: Arianna Love, Max Black, Mark Anthony\nThemes: Interracial, Deep Throat, POV, Anal, Internal Cumshot\nScene Rating: 6.5/10\nScene Breakdown: Here we have Arianna, Max and Mark. Arianna is a good-looking girl with medium length black hair and natural B cup tits. The scene begins with her telling us her name, says she's 18, from Vancouver, Canada, never been with 2 guys and this is her first anal! She then shows off her tits, pussy and ass and the cameraman has her finger her ass a little before the guys enter. She instantly begins sucking their cocks, then gets into doggy to keep sucking/deep throating Max as mark moves in to fuck her. As he does we get some very nice shots of the action and some nice POV shots as well. She spins around, doing PTM on Mark as Max gets his feel for the pussy for a bit, then we cut to Arianna in cowgirl on Max as she blows Mark. Eventually we cut to Arianna on her side as Mark spoon fucks her ass, giving us nice shots, and cums in her ass. He tells her to push it out, but she doesn't and it's a good thing I guess, because it looked like she would have possibly made a mess if she did so. Anyway, we cut to Max fucking her pussy in doggy with him cumming inside her. Again they try to get he to push it out bus she just doesn't cooperate, but at least Max dropped a little residue cum on the outside of her pussy for a nice cosmetic look . This was an OK scene. Arianna just didn't quite look into the scene and she didn't look comfortable with the anal, but she did make it through it. However the scene could have stood to have been longer and she had a GREAT outfit on!\n\nScene 3: Jay Star, Max Black, Darren James\nThemes: Interracial, Anal, Internal Cumshot, Cum Swallowing\nScene Rating: 9/10\nScene Breakdown: For this scene we have Jay, Max and Darren. Jay is an OK looking girl with long black hair and natural B cup tits (pierced nostril). As the scene opens the cameraman talks to her, she says she's 18, from Montreal and then shows her tits. They continue talking and she tells him her first time was at age 16 and says she's has sex with two people before, then turns around and shows her ass. Sitting on the bed she gives us a better shot of her pussy and says she likes to have a guy cum inside her and eat it out after he's done - although we didn't get that here I would have loved to seen it! Laying back the tease action contuses with Jay fingering/playing with her pussy as well as fingering her ass before the guys enter. Max dives right in to begin eating her out as she blows Darren. This action only goes on briefly before she drops to her knees and sucks both of their cocks. They then have her stand up and Max shows off her pussy one more time, then have her get into doggy, sucking Max as Darren fucks her to at least 2 orgasms! Cutting away we see Jay on her side with the guys taking turns fucking her as she sucks the other, but on Darren's turn he slides his cock in her ass. He pounds her ass nicely, making her cum at least 2 more times! He then rolls her up for a bit or reverse cowgirl anal action and we get nice shots as she cums even more! Darren then rolls her back to her side and pumps away until he cums in her ass, leaving a great anal cream pie! Afterwards we cut to Max giving her an open mouth facial (?!?!). It was a weak pop but she looked to swallow what did land in her mouth. This was a very good scene, too bad the final pop didn't follow the formula of the movie. Although Jay isn't the most attractive girl on the disc, she certainly was the most orgasmic and I loved every second of it!\n\nScene 4: Myrian, Max Black, Max Canada\nThemes: Toys, Interracial, Internal Cumshot\nScene Rating: 6.5/10\nScene Breakdown: Next up we have Myrian, Max Black and Max Canada (I'll use Black and Canada to represent the guys for this scene and the next). Myrian is a good-looking girl with medium length blonde hair and natural B cup tits (pierced lip). The scene opens with Mark telling us about Myrian, then walks into the room with her on a couch in doggy. He has her shake her nice ass for us and then show off her &quot;18 year old&quot; pussy. Pulling out a purple dong, Mark has her suck it, then flips over to show her tits before telling her open her pussy for him so he can insert it inside her. She does some PTM on the dong and soon the guys enter, Myrian starts off sucking Canada as Black fingers and eats her. They have her get into doggy and Canada takes first dibs, fucking her (we get some nice shots), as she blows Black. She then does some PTM on Canada and goes up to riding cowgirl on Black. Moving to her side, Canada takes over again as she blows Black, then we cut to her in doggy again, this time Black fucks her. Eventually he cums in her, but she didn't look to be pushing so we didn't see any cream pie. Cutting away, Myrian rides Canada in reverse cowgirl until he cums inside her as well and this time we only see a dribble come out. This was an OK scene. Myrian looked like she really started to get into the action right at the end, but the basic lack of cream pies hurt.\n\nScene 5: Patricia Petite, Max Black, Max Canada\nThemes: Toys, Interracial, Internal Cumshot\nScene Rating: 5/10\nScene Breakdown: In this scene we have Patricia, Max Canada and Max Black. Patricia is a cute and sexy looking girl with long black hair and natural A cup tits (pierced clit). The scene begins with her sitting on a bed as the cameraman asks her questions. She tells us she's 18, her first time was at age 15, then proceeds to show off her tits, pussy and ass for the camera; giving us a splendid shot of her ass. Cutting away, Patricia is in doggy, giving us an even better shot of her crotch, then turns around and sits down as the cameraman pushes a glass dildo into her mouth. He moves it down to her pussy and tries to fuck her with it but she was just too dry, a little lube would have been nice because the action turning of the dildo in her pussy looked painful. Anyway, shortly afterwards the guys enter and she gets into doggy again to suck Black as Canada fingers and eats her. The guys then switch and Black wastes no time, he begins fucking her as she blows Canada; as Black fucks her she creams all over his cock! Cutting away we then see Patricia in cowgirl on Black, getting nice shots of the action, as she continues to suck Canada's cock. Moving along we then cut to Patricia on her side as Black keeps fucking her then cut again to her back in doggy with Black fucking her more until he cums inside her. He tells her to push it out, but she certainly didn't look to be pushing which left us cream pie-less once more... We then watch as she blows Canada until he cums in her mouth (?!?!) and she spits it out, obviously not liking the taste. This was an average scene. I have absolutely no idea why Max Canada was in this scene, he didn't get ANY action and he popped in her mouth, whim resulted in a lose of a quart of a point for the non-formulaic pop and another quarter point lost for no action for him. Don't get me wrong I think Patricia is damn hottie, too bad she's not a damn hot fuck; actually she's rather lethargic.\n\nScene 6: Luci Thai, Mark Anthony, Darren James\nThemes: Interracial, Anal, ATM, Internal Cumshot\nScene Rating: 7.5/10\nScene Breakdown: Wrapping up the scene we have Luci, Mark and Darren. Luci is a cut and sexy looking girl with medium length long brown hair and natural absolutely PERFECT, B cup tits (I didn't believe it either, but that's what she claims, so who am I to question her?). The scene opens with her telling us her name, saying she's 19, showing off her body and telling TT her first time was at the ripe age of 16. After showing off her ass and pussy in more graphic detail, she takes a seat and the guys enter. Quickly she engulfs their cocks, sucking them, then we eventually cut to Luci on her side as she continues to suck Darren with Mark fucking her. Promptly getting to the anal, we see Luci in doggy as Mark slips into her ass and then moves over to Darren to ride in cowgirl (anal of course). Un-mounting, she does some ATM action and then moves to her side as Darren keeps the ass pumping going, giving us nice shots of the action. The guys switch up, but Mark goes back to the pussy, fucking her until he cums inside her, leaving a OK cream pie. She looked to try to push it out, but not much ever see the light of the room. Anyway, Darren then jumps in to fuck her pussy while she's on her side, he too cums inside her, but Darren's dick plopped out a little too soon and left a huge bit of the load on her leg This was a solid scene. Luci was defiantly hot looking, but could have been into it more, she did take the anal nicely though. \n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:1b1d38aee425d2875c38d2c4c35b644e7fb2477d","amp;dn":"Young+Dumb+And+Filled+With+Chocolate+Cum+-+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1d38aee425d2875c38d2c4c35b644e7fb2477d","infoHashBuffer":{"type":"Buffer","data":[27,29,56,174,228,37,210,135,92,56,210,196,195,91,100,78,127,178,71,125]},"announce":[],"urlList":[]}}