{"title":"Donna Xtreme - Anal Tortur (DVD.xvid) - German femdom,Carmen Riv","uid":4872705,"size":732325888,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1b2126630d120a7f110120d43ff1c6b75919ba8f&amp;dn=Donna+Xtreme+-+Anal+Tortur+%28DVD.xvid%29+-+German+femdom%2CCarmen+Riv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"corfitez","files":1,"time":1240929802,"description":"DONNA X. - Anal Tortur (DVD.xvid)\n\n\n\n\nscreens (+ DVD-cover):\n &lt;a href=&quot;\nhttp://ta.gg/2na&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ta.gg/2na&lt;/a&gt;\n\n\t\t\n\t\nSagenhaft unbarmherzig und rabiat geht Carmen Rivera mit dem StrapOn aus der ÃƒÅ“bergrÃƒÂ¶ÃƒÅ¸enabteilung zur Sache, wenn sie dem Koch auf Grund seiner miserablen KochkÃƒÂ¼nste diesen bis zum Anschlag in sein Hinterteil rammt. Doch damit nicht genug, folgen weitere rektale Torturen, die den SchlieÃƒÅ¸muskel ÃƒÂ¼ber alle MaÃƒÅ¸en beanspruchen und an die Grenzen des MÃƒÂ¶glichen fÃƒÂ¼hren.\nSo zollen wir vor allen Dingen dem mÃƒÂ¤nnlichen Darsteller Silvio Respekt, der in der Rolle des Kochs agiert. Denn nicht viele kÃƒÂ¶nnen von sich behaupten, einen ausgewachsenen Rettich oder zwei FÃƒÂ¤uste samt dem halben Unterarm rektal in sich aufzunehmen.\nEbensolche Anerkennung gebÃƒÂ¼hrt der unglaublichen Carmen Rivera als groÃƒÅ¸brÃƒÂ¼stige Domina, die wie auch nicht anders zu erwarten, ihr brutales Handwerk mit weitreichender Finesse beherrscht.\nDer Pornofilm ANAL TORTUR aus der Reihe DONNA X. macht seinem Titel alle Ehre. Und wer sonst, wenn nicht Master Costello, versteht es derartig eindrucksvoll, die sagenhafte Carmen Rivera, samt ihrer grausamen Erotik, so perfekt in Szene zu setzen. Derbe Verbalerotik im Dolby Digital Sound sowie die gestochen scharfe BildqualitÃƒÂ¤t im anamorphen 16:9 Format machen dieses schmerzvolle Dinner zu einem gourmetanten Gedicht fÃƒÂ¼r alle Liebhaber extravaganter Liebesspiele. (Die Red.)\n\nGeneral:\nFeminine Dominance in perfection, hard authentic and extremely consequential. Haunting SM entertainment at its best. These films were made at extra ordinary locations with exclusive actresses who have a real passion. SM action for the demanding viewer who can wallow in high quality standards which can be expected from the MASTER COSTELLO series. This label appears every two months. (OFF LIMITS MEDIA)\n\n\nStarring:  Carmen Rivera\n\n640x352\nAVI\n01:26:15\n\n\n\n\n.\n\n\n\n","torrent":{"xt":"urn:btih:1b2126630d120a7f110120d43ff1c6b75919ba8f","amp;dn":"Donna+Xtreme+-+Anal+Tortur+%28DVD.xvid%29+-+German+femdom%2CCarmen+Riv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b2126630d120a7f110120d43ff1c6b75919ba8f","infoHashBuffer":{"type":"Buffer","data":[27,33,38,99,13,18,10,127,17,1,32,212,63,241,198,183,89,25,186,143]},"announce":[],"urlList":[]}}