{"title":"QuickPwn Pwnage Tool for iPhone 3g running 2.0.2 firmware","uid":4354053,"size":15171994,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1bad69211cac5a944a2df7958e13c0180bf2c010&amp;dn=QuickPwn+Pwnage+Tool+for+iPhone+3g+running+2.0.2+firmware&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"huanix","files":1,"time":1219279137,"description":"from blog.iphone-dev.org:\n\nMy Little Pwnies Dressage\n\nHere is the updated QuickPwn for Windows, wrapped by Poorlads GUI. It contains our new bundles for 2.0.2 and weve added support for version 2.0 devices which means you can Pwn the device if it is running 2.0, 2.0.1 or 2.0.2.\n\nRemember this is still beta software, so usual rules apply, no complaints ifanything goes wrong and use the tool at at your own risk! \n\nDownload here! http://xs1.iphwn.org/releases/QuickPwnGUI120.zip\n\nNB: Using QuickPwn does not update the firmware itself, this tool is designed to Pwn (the ability to install future custom non-Apple firmwares) , Jailbreak and install Installer or Cydia on a given device. If your device is running 2.0.1 and you QuickPwn it, itll still be running 2.0.1, although it will now be Pwned and Jailbroken, similarly if your device is running 2.0.2 and you QuickPwn it, it will then be running 2.0.2 but the device will now be Pwned and Jailbroken. It will also activate (not unlock) devices that are being used outside of their intended territories and cannot be activated using iTunes.\n\nIf you want to update to 2.0.2 then use the normal iTunes update to get to 2.0.2 and then use QuickPwn to Pwn, Jailbreak and Activate, remember that the 2.0.2 includes a baseband update for the 3G iPhone, so depending what your long term intentions are for the phone, update wisely, of course in the upcoming PwnageTool application youll be able to create a custom ipsw without the baseband update enabled.\n\nOur Mac GUI whizzes in the team are working on a graphical Mac OS X version of QuickPwn and also adding some nice little tweaks to the next release of PwnageTool. As soon as these are finished and tested, well let you know, but dont hold your breath and refresh for these, the release is not imminent.\n\nAgain, no updates from our baseband hackers with regard to the unlocking of the 3G iPhone.","torrent":{"xt":"urn:btih:1bad69211cac5a944a2df7958e13c0180bf2c010","amp;dn":"QuickPwn+Pwnage+Tool+for+iPhone+3g+running+2.0.2+firmware","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bad69211cac5a944a2df7958e13c0180bf2c010","infoHashBuffer":{"type":"Buffer","data":[27,173,105,33,28,172,90,148,74,45,247,149,142,19,192,24,11,242,192,16]},"announce":[],"urlList":[]}}