{"title":"Randi Rhodes Show with Nicole Sandler - October 24 2013","uid":9096453,"size":44780804,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1d1d8c7d142b032e5843aac68d1bc511daad0107&amp;dn=Randi+Rhodes+Show+with+Nicole+Sandler+-+October+24+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"480v","files":3,"time":1382690222,"description":"October 24, 2013\nThe Randi Rhodes Show \n\nRandi's on vacation this week, but Nicole Sandler's sitting in with the latest news and some great guests too...\n\nDeveloping: At least 2 shot at Tenn. navy base\n\nEven with Congressional hearings on the farm bill, the budget, and the Obamacare website, plus President Obama moving onto immigration reform, not much of substance actually got done today in DC. Nicole will recap everything and get you caught up on the news today.\n\nIf it appeared to you like todays monkey court/House hearing on the federal health insurance website seemed a lot like the ridiculous Bengahzi hearings that revealed nothing, you're not alone. Senior fellow at Media Matters and co-author of 'The Benghazi Hoax', Ari Rabin-Havt will join us to talk about the right's campaign to politicize what was simply an American tragedy.\n\nAnother tragedy continues in Japan, at the massively damaged Fukushima nuclear power plant, where energy corporation TEPCO and the Japanese government are about to attempt one of the most complicated and dangerous nuclear clean-up operations ever. NukeFree.org's Harvey Wasserman will talk with Nicole about the likelyhood of success and if there's even such a thing as a safe nuclear power plant.\n\nFinally, comedian Dean Obeidallah will discuss his new movie 'The Muslims Are Coming', the Tea Party's war on comedy, and if Rep. Alan Grayson's recent comments comparing the tea party and the KKK ring true.","torrent":{"xt":"urn:btih:1d1d8c7d142b032e5843aac68d1bc511daad0107","amp;dn":"Randi+Rhodes+Show+with+Nicole+Sandler+-+October+24+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d1d8c7d142b032e5843aac68d1bc511daad0107","infoHashBuffer":{"type":"Buffer","data":[29,29,140,125,20,43,3,46,88,67,170,198,141,27,197,17,218,173,1,7]},"announce":[],"urlList":[]}}