{"title":"[Q-CLONE 005] The Bedroom Window (1987) UNCOMPRESSED DVD9 + ART","uid":5266950,"size":4476400405,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d249ee8313d16699e28fda96a769869f6ad6ad8&amp;dn=%5BQ-CLONE+005%5D+The+Bedroom+Window+%281987%29+UNCOMPRESSED+DVD9+%2B+ART&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Quidsane","files":-1,"time":1262917108,"description":"Relevant Info from Wiki:\n\nThe Bedroom Window is a 1987 thriller directed by Curtis Hanson. The movie is based on the novel &quot;The Witnesses&quot; by Anne Holden.\n\nTerry (Steve Guttenberg) is having an affair with his boss' wife Sylvia (Isabelle Huppert). One night after an office party, they are together and Sylvia witnesses an attack on Denise (Elizabeth McGovern) from Terry's bedroom window. She doesn't want to expose their relationship and so is reluctant about talking to the police. Terry, wanting to help, gives the police the description of the attacker. He soon becomes the main suspect in the case. He then sets out to find the real rapist/killer with some help from Denise.\n\nCast\n\n    * Steve Guttenberg : Terry Lambert\n    * Elizabeth McGovern : Denise\n    * Isabelle Huppert : Sylvia Wentworth\n    * Paul Shenar : Collin Wentworth\n    * Carl Lumbly : Quirke\n    * Wallace Shawn : Henderson's Attorney\n    * Frederick Coffin : Det. Jessup\n    * Brad Greenquist : Henderson\n    * Robert Schenkkan : State Attorney Peters\n\nRelevant Info from IMDB:\n\nTerry Lambert, played by Steve Guttenberg in what may just be his best performance, is a good man whose judgment isn't always the greatest. Terry is a business executive who makes the unwise decision of having an affair with his boss's wife, a beautiful French woman named Sylvia. One night at his apartment, she witnesses a young man assaulting a female. Obviously, she cannot go forward. Later, after learning of a different female being murdered near the scene that same night, he decides he'll go forward and report that he was the witness. &quot;It's my apartment, my bedroom window,&quot; he says in an attempt to justify the dishonesty.\n\nThe only problem, which proves to be a damaging blow, is that nothing can be proved about the murder. So, the only chance to convict the assailant is to prosecute on the assault case. The logic being it at least gives the authorities a chance to put the killer away to prevent him from hurting anyone else, while still hoping to find evidence connecting him to the murder. So Terry must testify during the trial that he witnessed the assault.\n\nAs the authorities become suspicious of Terry, he begins to bond, through shared experience with Denise, the woman who was assaulted outside his apartment. She later figures out that Sylvia, and not Terry, saw the murder. &quot;The question isn't What am I going to do? It's what are you going to do? And what is she going to do?,&quot; she says harshly and angrily, but not at all incorrectly.\n\nSteve Guttenberg is magnificent as the scared, confused, and conscientious Terry. Elizabeth McGovern and Isabelle Huppert are equally as good as the women who care about him, but are unsure how to figure him out, or what to do. McGovern shows her very good acting ability with non-verbals that demonstrate clearly that she knows something isn't right about Terry through her facial expressions and the looks in her eyes. The cast of this movie work together like a well-oiled machine, and the story may not have been as compelling had it not been for the convincing actors.\n\nThis is writing at it's best, top-notch acting, and film-making on a master scale. The movie is so well-made that we love the story, understand the characters and their situations, and just can't wait to see what happens next. This movie is a classic, and also a great thriller.\n\nR1 America - (Studio Canal/Lionsgate)\n\nSubtitles:  English, Spanish\nAspect Ratio:  2.35:1\nPicture Format:  ANAMORPHIC\nTV System:  NTSC\nSoundtrack(s):  English &amp; Spanish Dolby Digital Monaural 2.0 Audio\nCase type:  Keep Case (Amaray)\n\nNo shrinkage of ANY kind.\nComes with ALL artwork. (Hi-Res .png files)\nNo HD-DVD or Blu-Ray version has been released.\nAFAIK, this is the best version available...","torrent":{"xt":"urn:btih:1d249ee8313d16699e28fda96a769869f6ad6ad8","amp;dn":"%5BQ-CLONE+005%5D+The+Bedroom+Window+%281987%29+UNCOMPRESSED+DVD9+%2B+ART","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d249ee8313d16699e28fda96a769869f6ad6ad8","infoHashBuffer":{"type":"Buffer","data":[29,36,158,232,49,61,22,105,158,40,253,169,106,118,152,105,246,173,106,216]},"announce":[],"urlList":[]}}