{"title":"Kontakt Library Manager 3.0 - REUP.rar","uid":12265729,"size":2685540,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1e089fe250e270f76bcbc231d6d8936595f73de9&amp;dn=Kontakt+Library+Manager+3.0+-+REUP.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uraniumwilly","files":1,"time":1440230897,"description":"Reuploded this one as it seems to have some people interested it:\n\n\nThis is THE program you need for adding Kontakt Libraries to version of NI Kontakt 3.0 and above.\n\nNo dealing with editing confusing .nicnt files that won't work in the end anyway.\n\nNo going into regedit and dealing with complex registry issues. \n\nNo need to deal with .xml files in NI service Center.\n\n\nIt is basically a program that will create a .nct and .ncx file in your library folder. If you have a library now that gets added to Kontakt disappears on restart this will fix that. It adds and/or deletes registry entries for you. \n\nThere are three steps on the software interface, but you only need to do two things:\n\n1) Give the library a name relevant to the library itself (i.e. Morphestra or Cinematic Guitars). \n\n2) Locate the library wherever it is stored on your hard drive.\n\n3) This step is not necessary as far as my experiences go so long as you have a wallpaper already in your library (if not, make one). It locates your wallpaper. But if you have a wallpaper (and please, the image file (.png or .jpg) can only be named wallpaper of it will not work) it will find it automatically and a prompt will ask you if you want to skip this step. \n\nClick the + button and a couple command boxes and you will have your library in the side of your Kontakt browser, rather then in your quick load section.\n\nI found this after some researching. I downloaded another program or something here that was nothing but a convoluted set of instructions written in a confusing style about how to make a .nicnt file and edit your registry and this and that jibber jabber. You do not have to do any of that. Other options are that you can arrange your library using an alphabetical or numerical method, but I simply select position 1 when prompted - you will know what I mean - and then drag and drop it later to where I want it to be. \n\nI have added well over  a dozen libraries already and so I know this works and it is down to earth and straightforward. if you already tool around with Kontakt then you will be able to figure it out.  All credit goes to developers at Double YB and too bad this essential NI tool seems to have slipped under the radar. If you want Kontakt libraries for those collections that always tell you &quot;no library found&quot; then this is for you. The only draw back is you may have too many libraries in your browser soon and you won't be able to find anything, but that is half the fun. Hell, I don't use a 10th of what I have in Kontakt anyway, but I love to see those libraries with those wallpapers. You may have to make you own wallpapers like I did but you are on your own there. Good luck. \n\nYou may run into a glitch now and then and you will have to sort that out with your own system and set up. I had a few but with a little perseverance things got going. Of all the libraries I have worked on with this I only had one (Vintage Organs) that would not work for some reason and I later found a working version of that library somewhere anyway. And remember, if a library just will not load in your left hand browser area you can add to your quick launch area in Kontakt. It is drab maybe but it opens fine from there.\n\nUranium Willy","torrent":{"xt":"urn:btih:1e089fe250e270f76bcbc231d6d8936595f73de9","amp;dn":"Kontakt+Library+Manager+3.0+-+REUP.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e089fe250e270f76bcbc231d6d8936595f73de9","infoHashBuffer":{"type":"Buffer","data":[30,8,159,226,80,226,112,247,107,203,194,49,214,216,147,101,149,247,61,233]},"announce":[],"urlList":[]}}