{"title":"Enemies Within: The Culture of Conspiracy in Modern America","uid":6481154,"size":1236019,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e94ca3cdd28ee8ec68a16d9ab3530cd19441d5e&amp;dn=Enemies+Within%3A+The+Culture+of+Conspiracy+in+Modern+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1308520867,"description":"Historian Goldberg (Barry Goldwater) analyzes &quot;conspiracism&quot; in American history with balance and precision, presenting conspiracy belief as a traditional part of our culture rather than a fringe response from deranged or abnormal personalities. Goldberg discusses a range of examples, from the Salem witch trials, to the abolitionists' slave power conspiracies vs. the Confederates' slave insurrection plots, to the Klan's hatred of African Americans, Catholics, and Jews. However, he focuses his study on five post-World War II conspiracy theories: the Communist fifth column, the belief in the Antichrist, the assassination of JFK, the plot against black America, and the Roswell incident concerning a purported alien attack. Goldberg's writing is clear and vivid, and his willingness to tackle conspiracies emanating from many points of the political spectrum makes his argument more cogent. Underlying his analysis is the view that both the media and, ironically, the government have been instrumental in making these five conspiracy theories (and others) more credible. This important and unusually accessible study is strongly recommended for academic libraries, most public libraries, and large high school libraries. Jack Forman, San Diego Mesa Coll. Lib.\nCopyright 2002 Reed Business Information, Inc.\nReview\n&quot;An extraordinarily well-written and carefully analyzed study of alleged conspiracies in our midst since the end of World War II.&quot; -- Leonard Dinnerstein, University of Arizona\n\n&quot;From esoteric theologies . . . political scandals to blockbuster movies, Goldberg skillfully guides us through the foremost conspiracy theories in contemporary America.&quot; -- Leo P. Ribuffo, George Washington University\n\n. . .[C]lear and vivid. . . tackle[s] conspiracies emanating from many points of the political spectrum. . . [An] important and unusally accessible study. -- Library Journal\n &lt;a href=&quot;\nhttp://www.amazon.com/Enemies-Within-Culture-Conspiracy-America/dp/0300090005/ref=sr_1_1?ie=UTF8&amp;qid=1308513009&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Enemies-Within-Culture-Conspiracy-America/dp/0300090005/ref=sr_1_1?ie=UTF8&amp;qid=1308513009&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:1e94ca3cdd28ee8ec68a16d9ab3530cd19441d5e","amp;dn":"Enemies+Within%3A+The+Culture+of+Conspiracy+in+Modern+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e94ca3cdd28ee8ec68a16d9ab3530cd19441d5e","infoHashBuffer":{"type":"Buffer","data":[30,148,202,60,221,40,238,142,198,138,22,217,171,53,48,205,25,68,29,94]},"announce":[],"urlList":[]}}