{"title":"Snoop Lion - Reincarnated (2013) [FLAC]","uid":8409086,"size":313401909,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f376117744e26c1c1c9f9c1ed842331ed3a5104&amp;dn=Snoop+Lion+-+Reincarnated+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SmashAndGrab","files":-1,"time":1366870990,"description":"  Snoop Lion - Reincarnated (2013) [FLAC]\n\n  Released: 2013\n  Genre: Reggae\n  Style: Reggae, Dancehall\n  Codec: FLAC\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01. Rebel Way 4:44 \n  02. Here Comes The King 3:24 \n  03. Lighters Up 3:46 \n  04. So Long 3:40 \n  05. Get Away 3:27 \n  06. No Guns Allowed 3:31 \n  07. Fruit Juice 2:37 \n  08. Smoke The Weed 3:28 \n  09. Tired Of Running 4:10 \n  10. The Good Good 3:54 \n  11. Torn Apart 3:30 \n  12. Ashtrays And Heartbreaks 4:06\n\n  After a trip to Jamaica, Snoop Dogg returned as Snoop Lion, a reformed reggae singer/dancehall rapper who had seen the Rastafarian light. Violence was now something to fight against, and while Biblical, vegetarian, and other bits of Ital living can be found on Snoop's first reggae album, Reincarnated, utilizing Diplo as his co-captain seems like an odd choice if you want to go the full Peter Tosh. Here, the kinetic electro producer is co-credited under his Major Lazer moniker, and while Snoop follows Burning Spear (his soft singing voice poetically damning violence and hoping for a better tomorrow throughout the album) and Diplo chases the cutting edge of cool (the choices of dancehall vocalists Mr. Vegas, Collie Buddz, and Popcaan are just as wicked as his getting Dre Skull and 6Blocc behind the boards) this album is blunted by pop, pop-rap, pop-reggae, and pop-politics, all at their most bland. Weed references are repurposed as sweet nothings on &quot;The Good Good,&quot; a lazy, lazy lover written by Dianne Warren who comes off as hitmaker-for-hire here, but that isn't the oddest choice, as Miley Cyrus guests on &quot;Ashtrays and Heartbreaks,&quot; a sweet but ineffective number trying to adapt the &quot;pour one out&quot; tribute song for Snoop's new no-on-booze, yes-on-weed lifestyle. His charm and sincerity carry these merely good and midtempo numbers on an album that's got plenty of them, and while Reincarnated is no home run, it's no great embarrassment, either, and certainly comes alive during party numbers like &quot;Here Comes the King&quot; (hot-stepping meets dub-stepping with a winding bassline), &quot;Lighters Up&quot; (Snoop meets dancehall greats Mavado and Popcaan over the tastiest of beats), and &quot;Fruit Juice&quot; (it's like Kool Keith doing a tropical smoothie commercial with Mr. Vegas in tow). A little backstory goes a long way when it comes to this one, so fans who have seen the Reincarnated documentary and relate to the rapper's rebirth can go up one letter grade. Otherwise, Reincarnated the album is all heart and heart-in-the-right-place, threatening to mash up the system without ever even harshing the mellow.","torrent":{"xt":"urn:btih:1f376117744e26c1c1c9f9c1ed842331ed3a5104","amp;dn":"Snoop+Lion+-+Reincarnated+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f376117744e26c1c1c9f9c1ed842331ed3a5104","infoHashBuffer":{"type":"Buffer","data":[31,55,97,23,116,78,38,193,193,201,249,193,237,132,35,49,237,58,81,4]},"announce":[],"urlList":[]}}