{"title":"Air Pirates Funnies I &amp; II [Cbr - Eng][TNTVillage]","uid":10345469,"size":172000573,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:20a34648874eccee2ec41a7316e18690c97f168b&amp;dn=Air+Pirates+Funnies+I+%26amp%3B+II+%5BCbr+-+Eng%5D%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MoYan","files":2,"time":1402598891,"description":"Air Pirates Funnies\nI &amp; II\n\n[i]Why won't anybody fuck me?!?[/i]\nTopolino\n\n\n[b][color=green].: Details :.[/color][/b]\n\n[b]Author:[/b] [i]Air Pirates[/i]\n\n[b]Original Title:[/b] [i]Air Pirates Funnies I &amp; II[/i]\n[b]First Original Edition:[/b] [i]1971[/i]  \n[b]Publisher:[/b] [i]Hell Comics[/i]\n[b]File Format:[/b] [i]Cbr[/i]\n[b]Language:[/b] [i]English[/i]\n\n[b][color=green].: Review :.[/color][/b]\n\n\nThe Air Pirates were a group of cartoonists who created two issues of an underground comic called Air Pirates Funnies in 1971, leading to a famous lawsuit by The Walt Disney Company (then Walt Disney Productions). Founded by Dan O'Neill, the group also included Shary Flenniken, Bobby London, Gary Hallgren, and Ted Richards.\n\nThe collective shared a common interest in the styles of past masters of the comic strip, and in creating their stories for the collective each set out to imitate the style of an old time cartoonist: Flenniken emulated Clare Briggs and H. T. Webster in her Trots and Bonnie comics, London's strip Dirty Duck paid homage to the style of George Herriman's Krazy Kat, Richards' Dopin' Dan was supposed to be influenced by Bud Fisher but showed more similarity to Mort Walker's Beetle Bailey, and Gary Hallgren drew a strip called Pollyanna Pals in the style of Cliff Sterrett's Polly and Her Pals. The original Air Pirates were a gang of Mickey Mouse antagonists of the 1930s; O'Neill imagined Mickey Mouse to be a symbol of conformist hypocrisy in American culture, and therefore a ripe target for satire.\n\nThe first issue of Air Pirates Funnies was dated July 1971, and the second issue dated August. Both were published under the Hell Comics imprint, and were distributed through Ron Turner's Last Gasp publishing company. Both issues are considered highly collectible today.\n\nThe lead stories in both issues, created by O'Neill, Bobby London and Hallgren, focused on Walt Disney characters, most notably from Floyd Gottfredson's Mickey Mouse newspaper strip, with the Disney characters engaging in adult behaviors such as sex and drug consumption. O'Neill insisted it would dilute the parody to change the names of the characters, so his adventurous mouse character was called &quot;Mickey&quot;. Ted Richards took on the Big Bad Wolf and the Three Little Pigs opening up a second wave of parody attacking Disney's use of contemporary American and European folklore. In doing so, they infringed Disney's copyrights by using characters he created without permission.","torrent":{"xt":"urn:btih:20a34648874eccee2ec41a7316e18690c97f168b","amp;dn":"Air+Pirates+Funnies+I+%26amp%3B+II+%5BCbr+-+Eng%5D%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a34648874eccee2ec41a7316e18690c97f168b","infoHashBuffer":{"type":"Buffer","data":[32,163,70,72,135,78,204,238,46,196,26,115,22,225,134,144,201,127,22,139]},"announce":[],"urlList":[]}}