{"title":"CBS Radio Mystery Theatre-Episodes 1-64","uid":4486400,"size":698210022,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:214e0773b2284afb14c76bf88b21e03afff425de&amp;dn=CBS+Radio+Mystery+Theatre-Episodes+1-64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akimba7","files":1,"time":1225784876,"description":"CBS Radio Mystery Theater (aka Radio Mystery Theater and Mystery Theater, sometimes abbreviated as CBSRMT) was an ambitious and sustained attempt during the 1970s to revive the great drama of old-time radio. The series was created by Himan Brown, a radio legend due to his work on Inner Sanctum Mysteries and other shows dating back to the 1930s.\n\nOn CBS affiliates, the series began its long run January 6, 1974. The final episode was broadcast on December 31, 1982. The program aired nightly and ran for one hour, including news and commercials. Typically, a week consisted of three to four new episodes, with the remainder of the week filled out with reruns. There were a total of 1399 original episodes. The total number of broadcasts, including reruns, was 2969.\n\nThe format was similar to that of classic old time radio shows such as The Mysterious Traveler and The Whistler, in that a host (E.G. Marshall) introduces each episode and provides pithy wisdom throughout, but unlike the hosts of earlier programs, Marshall is fully mortal, merely someone whose heightened insight and erudition plunge the listener into the world of the macabre.\n\nThe show began with the ominous sound of a creaking crypt door, slowly opening to invite listeners in for the evening's adventure, accompanied by Marshall's disturbing utterance, &quot;Come in. Welcome. I am E.G. Marshall.&quot; At the end of each show, the door would swing shut, followed by Marshall's classic sign off, &quot;Until next time, pleasant... dreams?,&quot; segueing into the show's haunting woodwind theme music.\n\n","torrent":{"xt":"urn:btih:214e0773b2284afb14c76bf88b21e03afff425de","amp;dn":"CBS+Radio+Mystery+Theatre-Episodes+1-64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214e0773b2284afb14c76bf88b21e03afff425de","infoHashBuffer":{"type":"Buffer","data":[33,78,7,115,178,40,74,251,20,199,107,248,139,33,224,58,255,244,37,222]},"announce":[],"urlList":[]}}