{"title":"International Companion Encyclopedia of Children'","uid":4720132,"size":4037335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21875d1e4f86e6f7dcaaa80e299ce4435bd40321&amp;dn=International+Companion+Encyclopedia+of+Children%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"VasiaZozulia","files":1,"time":1234475516,"description":"Children's literature continues to be one of the most rapidly expanding and exciting inter-disciplinary academic fields--of interest to anyone concerned with literature, education, internationalism, childhood, or culture in general.\n\nThe second edition of Peter Hunt's acclaimed reference has been thoroughly revised and updated to incorporate the latest scholarship on children's literature from across the world. Expanded to nearly 700,000 words, it includes over 50 new articles on topics--such as Postcolonialism, Comparative Studies, Ancient Texts, Contemporary Children's Rhymes and Folklore, Contemporary Comics, War, Horror, Series Fiction, Film, Creative Writing, &quot;Crossover&quot; literature, and more. The international section has also been expanded to reflect world events, and now includes separate articles on countries--including the Baltic States, the Czech and Slovak Republics, Iran, Korea, Mexico and Central America, Slovenia, and Taiwan.\n\nAs children's publishing has become a hugeinternational industry and as the genre receives ever-increasing attention and grows faster than ever, this timely, new edition is an indispensable reference work for all literature collections.","torrent":{"xt":"urn:btih:21875d1e4f86e6f7dcaaa80e299ce4435bd40321","amp;dn":"International+Companion+Encyclopedia+of+Children%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21875d1e4f86e6f7dcaaa80e299ce4435bd40321","infoHashBuffer":{"type":"Buffer","data":[33,135,93,30,79,134,230,247,220,170,168,14,41,156,228,67,91,212,3,33]},"announce":[],"urlList":[]}}