{"title":"Percival Bland's Proxy and The Missing Mortgagee by R. Austin Fr","uid":8336642,"size":315163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2528de1e4803a701eda17dd3751c34375518505a&amp;dn=Percival+Bland%27s+Proxy+and+The+Missing+Mortgagee+by+R.+Austin+Fr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"imarion","files":-1,"time":1365000407,"description":"These are two short stories from the collection THE GREAT PORTRAIT MYSTERY: &quot;PERCIVAL BLAND'S PROXY&quot; and &quot;THE MISSING MORTGAGEE&quot;, wherein the brilliant medical investigator, Dr. Thorndyke, solves murderous crimes.\n\nPercival Bland was an uncommon criminal. He knew that his continual passing of counterfeit banknotes would eventually catch up with him, so he had a plan--precautions against the inevitable catastrophe. We can understand why he has created an alternate persona, Robert Lindsay, using disguises and renting two places of residence. No one seems to notice that he and his &quot;cousin&quot; Robert never are at their respective homes simultaneously, nor are they at home when the other visits, nor does anyone see the resemblance of their facial appearance under the makeup. But why does he buy human bones at auction? The lot was described in the catalog as &quot;a complete set of human osteology&quot; but they were not an ordinary &quot;student's set,&quot; for the bones of the hands and feet, instead of being strung together on cat-gut, were united by their original ligaments and were &quot;of an unsavoury brown colour.&quot; What does he want with those moldy bones? He has a nefarious plan, but it does not fool Dr. Thorndyke.\n\nAfter Dr. Thorndyke solved the case of Percival Bland, the doctor was called in by a life insurance company to investigate another case. There was apparently no doubt that Thomas Elton, a friendless, poverty-stricken artist, had fallen from the top of the overhanging cliff onto the beach. Now, one would suppose with the evidence of this fall of about a hundred and fifty feet, the smashed face and broken neck, there was not much room for doubt as to the cause of death. But Thorndyke indeed has his doubts. ","torrent":{"xt":"urn:btih:2528de1e4803a701eda17dd3751c34375518505a","amp;dn":"Percival+Bland%27s+Proxy+and+The+Missing+Mortgagee+by+R.+Austin+Fr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2528de1e4803a701eda17dd3751c34375518505a","infoHashBuffer":{"type":"Buffer","data":[37,40,222,30,72,3,167,1,237,161,125,211,117,28,52,55,85,24,80,90]},"announce":[],"urlList":[]}}