{"title":"The Emerald Planet - How Plants Changed Earth's History","uid":4859392,"size":3756296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2547921e477cc9dfc26a96b5cb4dcb48b081eccc&amp;dn=The+Emerald+Planet+-+How+Plants+Changed+Earth%5C%27s+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1240196669,"description":"Global warming is contentious and difficult to measure, even among the majority of scientists who agree that it is taking place. Will temperatures rise by 2oC or 8oC over the next hundred years? Will sea levels rise by 2 or 30 feet? The only way that we can accurately answer questions like these is by looking into the distant past, for a comparison with the world long before the rise of mankind. \nWe may currently believe that atmospheric shifts, like global warming, result from our impact on the planet, but the earth's atmosphere has been dramatically shifting since its creation. This book reveals the crucial role that plants have played in determining atmospheric change - and hence the conditions on the planet we know today. Along the way a number of fascinating puzzles arise: Why did plants evolve leaves? When and how did forests once grow on Antarctica? How did prehistoric insects manage to grow so large? The answers show the extraordinary amount plants can tell us about the history of the planet -- something that has often been overlooked amongst the preoccuputations with dinosaur bones and animal fossils. \nDavid Beerling's surprising conclusions are teased out from various lines of scientific enquiry, with evidence being brought to bear from fossil plants and animals, computer models of the atmosphere, and experimental studies. Intimately bound up with the narrative describing the dynamic evolution of climate and life through Earth's history, we find Victorian fossil hunters, intrepid polar explorers and pioneering chemists, alongside wallowing hippos, belching volcanoes, and restless landmasses. \n\n","torrent":{"xt":"urn:btih:2547921e477cc9dfc26a96b5cb4dcb48b081eccc","amp;dn":"The+Emerald+Planet+-+How+Plants+Changed+Earth%5C%27s+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2547921e477cc9dfc26a96b5cb4dcb48b081eccc","infoHashBuffer":{"type":"Buffer","data":[37,71,146,30,71,124,201,223,194,106,150,181,203,77,203,72,176,129,236,204]},"announce":[],"urlList":[]}}