{"title":"Celldweller_-_Live_Upon_A_Blackstar_2012","uid":7310852,"size":158114179,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2699e0e3c74178fbd6427d4f85cdf34e3cf86803&amp;dn=Celldweller_-_Live_Upon_A_Blackstar_2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"3BDRR7MAN","files":-1,"time":1338338902,"description":"While hard at work on his upcoming sophomore album Wish Upon A Blackstar, Celldweller mastermind Klayton took to the road on his first tour in five years, with Bret from Blue Stahli as the other half of the live crew. Featuring custom filmed &amp; edited video synchronized to every last second of of the continuous hour-long set, the Celldweller tour blew the doors off the standard concept of a live show. Now you can share the experience with Live Upon A Blackstar! This live DVD/Blu-Ray features footage taken in the US, Russia, Canada, and Japan, and has region free, NTSC 1080p HD video and a 5.1 Surround Sound mix. Live Upon A Blackstar is the definitive document of the 2010/2011 tour and captures a unique era of the live Celldweller show, which will expand and mutate into new experiences as time goes by. Live Upon A Blackstar features eleven songs from Wish Upon A Blackstar, Soundtrack for the Voices in My Head, and the self-titled debut, all revamped, remixed, and mashed up for an exclusive live experience. By your request, we've also included the full backing videos that were projected during the live performance in all of their High Definition glory.\n\nThe audio-only CD and digital release (with bonus track &quot;I Believe You&quot;) came out on March 27th. The first ever Celldweller full-length Blu-Ray/DVD has been delayed due to complex authoring and manufacturing difficulties. The Blu-Ray/DVD combo pack features over 150 minutes of footage, HD Video, Surround Audio and tons of bonus content and will begin shipping on or before June 12th, 2012. We sincerely apologize to those who have already pre-ordered this release and have had to endure a longer-than-expected pre-order period. This project has been an exhaustive process of documenting, editing and presenting a world-class experience of the Celldweller Live Show and we believe you will all be thrilled with the final product!\n\nREMEMBER: IF YOU LIKE IT BUY IT!! SUPPORT THE ARTIST!!\n &lt;a href=&quot;\nhttp://www.fixtstore.com/product/63930/Celldweller---Live-Upon-A-Blackstar-%28MP3-Album%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fixtstore.com/product/63930/Celldweller---Live-Upon-A-Blackstar-%28MP3-Album%29&lt;/a&gt;","torrent":{"xt":"urn:btih:2699e0e3c74178fbd6427d4f85cdf34e3cf86803","amp;dn":"Celldweller_-_Live_Upon_A_Blackstar_2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2699e0e3c74178fbd6427d4f85cdf34e3cf86803","infoHashBuffer":{"type":"Buffer","data":[38,153,224,227,199,65,120,251,214,66,125,79,133,205,243,78,60,248,104,3]},"announce":[],"urlList":[]}}