{"title":"Coast to Coast AM February 16 2013","uid":8155395,"size":57721362,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2773f6364910a3d4fda3ac6d54ec76f2f00ebd3a&amp;dn=Coast+to+Coast+AM+February+16+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1361152571,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-16-13\nHost: \tJohn B. Wells\nGuests: \tPaul Stamets, Joe Meyer\n\nJohn B. Wells was joined by fungi expert, Paul Stamets, who discussed how mushrooms can enhance the health of our forests, gardens and bodies. He attributed the limited knowledge about the power of mushrooms to their fleeting nature, which provides scientists little time to study them. Additionally, he mused that the varied effects of mushrooms, such as improved health, sustenance, and death, contribute to a sense of fear because &quot;they are so poorly understood.&quot; However, he marveled that there are over 5 million species of fungi on the planet, constituting more than half of the 10 million total species, of all organisms, on Earth. For more on Stamets' research, see this video.\n\nStamets shared numerous instances where the ability of fungi to survive and thrive in extreme environments has provided insights into potential ways that they could improve life on Earth. To that end, he revealed how, following the Chernobyl disaster, Ukranian scientists observed that mushrooms in the nearby forests were &quot;hyperaccumulating radioactivity,&quot; thus decontaminating large areas of land. As such, he suggested that the problems of radioactive fallout facing Japan, following the Fukushima disaster, may be alleviated via the use of mushrooms. Stamets also talked about how the unique survival abilities of various fungi forms could be used to both provide food for exploring astronauts as well as terraforming planets in the future.\n\nBeyond the environmental benefits attributed to mushrooms, Stamets also detailed a myriad of ways that fungi have shown to be beneficial to human health. For instance, he shared the story of his mother's battle with cancer and how, after being given six months to live in 2009, she supplemented her chemotherapy with 'Turkey Tail' mushrooms. Today, Stamets said, she has &quot;no detectable tumors whatsoever&quot; and her case has been called by cancer journals as a &quot;best case outcome.&quot; Furthermore, he cited studies of the 'lion's mane' mushroom which was shown to reverse the symptoms of Alzheimer's disease in laboratory mice. Stamets was also enthusiastic about the potential therapeutic applications for &quot;magic&quot; mushrooms, since research has indicated they help in treating alcoholism and post-traumatic stress disorder, calling them &quot;medicines for the soul.&quot;\nEconomic Update:\n\nIn the first hour, financial analyst Joseph Meyer provided an update on the economy and argued that the US should return to the gold standard. He pointed to indicators in the job and housing markets as well as stagnant income levels, high household debt, and weak consumer spending as signs that the economy continues to be in a troubled state despite media claims of a turnaround. He also called the increasing consolidation of wealth by a smaller percentage of the population a &quot;recipe for disaster&quot; which cannot sustain itself much longer. In light of the massive gold reserve held by the United States, Meyer surmised that America will be the first nation to return to a gold-backed financial system as the global economy falters.\nWebsite(s):\n\n    fungi.com\n    straightmoneyanalysis.com\n\nBook(s):\n\n    Growing Gourmet and Medicinal Mushrooms\n    Mycelium Running\n\n","torrent":{"xt":"urn:btih:2773f6364910a3d4fda3ac6d54ec76f2f00ebd3a","amp;dn":"Coast+to+Coast+AM+February+16+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2773f6364910a3d4fda3ac6d54ec76f2f00ebd3a","infoHashBuffer":{"type":"Buffer","data":[39,115,246,54,73,16,163,212,253,163,172,109,84,236,118,242,240,14,189,58]},"announce":[],"urlList":[]}}