{"title":"(PSX-PSP) South Park converted properly [ResourceRG Games by Klo","uid":4981504,"size":231202187,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:27dd6cf29c49080d6a1a8e9a8856e640f33307d5&amp;dn=%28PSX-PSP%29+South+Park+converted+properly+%5BResourceRG+Games+by+Klo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1246336553,"description":"SOUTH PARK:\n\nWhen a comet almost collides with Earth, a posse of bizarre turkeys and evil aliens lands in South Park, and the four foul-mouthed grade-schoolers are, of course, going to have to rescue everyone. Switch back and forth between the characters with the touch of a button, as you use yellow snowballs, sponge-dart guns, toilet plungers, and more to squelch the strange attack and restore peace to the sleepy mountain town. With lots of levels and difficult bosses, the game's obvious strength is its creativity the enemies are all hysterical, and the game ends up being as funny as the show itself. Based on the hit cartoon, SOUTH PARK (the game) actually uses custom speech from stars Trey Parker, Matt Stone, and Isaac Hayes to keep the faithful masses happy, and adds a creative storyline that falls right in line with what you'd expect from the show. The 3D animation is a definite update on the cartoon, but the animation is so good, you won't even blink at the difference. If you've never used a bazooka that shoots out cows in a videogame before, you haven't played SOUTH PARK.\n\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:27dd6cf29c49080d6a1a8e9a8856e640f33307d5","amp;dn":"%28PSX-PSP%29+South+Park+converted+properly+%5BResourceRG+Games+by+Klo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27dd6cf29c49080d6a1a8e9a8856e640f33307d5","infoHashBuffer":{"type":"Buffer","data":[39,221,108,242,156,73,8,13,106,26,142,154,136,86,230,64,243,51,7,213]},"announce":[],"urlList":[]}}