{"title":"Maiden America - Iron Maiden Tribute Plus Original Material","uid":9162752,"size":407721891,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:280e3155427bc8ca3f0847450fb5352c2f12c564&amp;dn=Maiden+America+-+Iron+Maiden+Tribute+Plus+Original+Material&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Tripower57","files":32,"time":1383898652,"description":"This is actually an interesting premise: Take a bunch of bands, many unknowns, but all with a love for and even traces of an IRON MAIDEN sound in their music. Put together a tribute album, but then be really, Really cool to the contributing bands and put in a second disk of the bands doing their OWN songs! While I wasn't wowed by all the bands featured, the idea behind this CD is pretty damn cool! This idea and concept was created by Chris Maycock and Don Anderson. The only reason this CD was made in the first place is because Chris (on behalf of DAWNBRINGER) and Don (of SCULPTURED), were turned down by a company wanting all European bands for their tribute. Chris and Don have enough class not to mention any names, thereby not shitting on the Euro bands who were chosen and have nothing to do with management decisions anyway.\n\nInstead, Don and Chris got together and created their own tribute to IRON MAIDEN, one that was all American (MAIDEN AMERICA, get it? Snap out of it already!)\n\nThe first band on the line-up is PHARAOH, who, it is painfully obvious from their photo, don't give a good damn about &quot;Metal costumes&quot; any more than bands like CHEAP TRICK or RED HOT CHILI PEPPERS. Tim Aymar on vocals doesn't have much of a singing voice which is just fine for their cover of &quot;Aces High&quot;. He tries to hit those high notes as well as the low and just basically tears his throat all to hell. Hey Tim, this is how Bruce and Brian screwed up their singing voices! Never the less, Tim and the band have heart and rip through &quot;Aces High&quot; as if it was the last song they were ever going to sing, giving it all they have. PHARAOH is from Pennsylvania. &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7e0e161f0c1f11163e1f13171d0c110d070d501d1113&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nOMEN comes into the disk with &quot;Murders In The Rue Morgue&quot;. Now if there is one thing I want to hear when someone is doing a cover of another band's song, it is to hear the cover band's own version. I already know that IRON MAIDEN rocks, and I don't need to hear some band trying to make carbon copies already! Its not as if those original Maiden tracks have been lost forever! OMEN takes an entirely different point of view however, as Bass guitarist Andy Hass says that they went out of their way to get Jason McMaster; who could do a better imitation of Paul Di'Anno than regular lead singer Matt Story! Not my thing personally, but hey, if you want folks who can do Xerox style copies of Iron Maiden, you might like this one. OMEN is from Texas. &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3e565c555750597e5b5f4c4a565257505510505b4a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nBig time favorite &quot;Killers&quot; is performed by FINAL PRAYER. The band is brief, short, and tight. This is bare bones Heavy Metal and it kicks ass because of that! I'm going to be looking for more FINAL PRAYER at the music stores. An excellent cover! FINAL PRAYER is from Pennsylvania.\nContact them via Keith, 3004 Eland Downe, Phoenixville, PA 19460 USA\n\nBORN OF FIRE take on IRON MAIDEN's rather dreamy &quot;Remember Tomorrow&quot;. Not so much a cover as a wholly new way of playing this song. I was surprised the first time I heard it played, going nearly a full minute into the track before I thought &quot;Oh yeah!&quot; Lead Guitarist Micha Kite actually tried to keep this song true to its original form instead of bastardize it. In that he failed, but its a good failure in that the song sounds more like a tribute instead of just a rip-off. J. Davis has an excellent voice for this song. Bobby Chaves on Bass Guitar and Keith Haney on Drums give &quot;Remember Tomorrow its much needed heft while Keyboardist Victor Morell gives the song an un-Maiden but never-the-less proper atmosphere. BORN OF FIRE is from Arizona. contact them via Bobby, 3036 W. Evans Dr., Phoenix AZ 85053 USA\n\nTWISTED TOWER DIRE does &quot;Powerslave&quot;. While the cover is musically unimpressive (again, the song rocks, but I already knew that), this track is saved by the superior vocals of Lead singer Tony Taylor and the back up vocals of Lead Guitarist Scott Waldrop and Drummer/ Percussionist Marc Stauffer. TWISTED TOWER DIRE is from Virginia. Contact them via Scott, 10021 Scenic View Drive, Vienna, VA 22182 USA\n\nBURNING INSIDE tackle &quot;Ghengis Khan&quot;. This is a song that is nothing without a solid drummer. Band guitarist Steve Childers, Bass/vocalist Jamie Prim and Guitarist Michael Estes were wise enough to not only accept this, but the whole band willingly pulled back their collective egos to give Drummer/Keyboardist Richard Christy full frontal sound. Christy doesn't disappoint as he takes a very unique approach to &quot;Ghengis Khan&quot;. A great cover by a band that puts the music first before themselves. BURNING INSIDE is from Florida. Contact them via Steve, PO Box 300761, Fern Park, FL 32730-0761 USA\n\n&quot;Heaven Can Wait&quot; is performed by DAWNBRINGER, one of two bands that caused this album to be made in the first place. The band does a respectful cover but never rises to go beyond the song and into something that is both MAIDEN and beyond. Lead Guitarist Bill Palko in particular tries to play this song note for note and brings nothing new to the table. DAWNBRINGER is from Pennsylvania. Contact them via\n\nEQUINOX does &quot;Wrathchild&quot;. While I have heard any number of &quot;Wrathchild&quot; covers done in this growly gutter voice, what saves this song is the excellent musicianship of all three members. There is such a tight and perfect musical interaction between band members Pete Slate on Guitars, Stephen Spillers on Drums, and Darkness on Bass and Vocals. Looking at their photograph, this band eschews the black concert T-Shirt look for the glam costumes of WASP and CELTIC FROST. That's not a bad thing if you've got the talent to back it up, and EQUINOX does!\nEQUINOX is from Florida. Contact them via Pete, PO Box 350333, Grand Island, FL 32735 USA.\n\nAfter what was apparently a long and drawn out argument as to what song they should cover for this disk, all the members of EDENROT found that they could only agree on &quot;Hallowed Be Thy Name&quot;. Sonically, this song is very multi-textured and not for amateurs who would turn the slow and dramatic intro into sap and the building crescendos into un-inspired Hollywood Hairband treble twanging. The words can also lend themselves very easily into a whining snivel as opposed to a man who is honestly facing the short-lived confusion of his rapidly approaching death. \n&quot;'cause at five o'clock /\nthey take me to the gallows.&quot;\nEDENROT pulls this song off beautifully. Complimenting IRON MAIDEN instead of just copying them. EDENROT is from Pennsylvania. Contact them via\n\nSADUS does &quot;Invaders&quot; and gives us a weird mix of both cleaving to the original Maiden sound and then going into sonic creativity when Guitarist/ vocalist Darren Travis sings. Not enough here to satisfy any IRON MAIDEN fan. Too bad too, because I thought that SADUS if anybody could give us something really worthy. SADUS is from California. Contact them via &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f3979281989b929f9fb3929c9fdd909c9e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nSCULPTURED, the other band co-responsible for this CD does a mind bendingly original cover of &quot;Iron Maiden&quot;. When the track first started playing my thought was &quot;Whoa! Are they making fun of Maiden?!? but as the song progresses and goes through itself again and again, it just keeps getting heavier and wilder and weirder with a crazed jazzy trumpet (!) provided by Burke Harris thrown in for good measure. SCULPTURED finishes the song running full bore to the finish line leaving choking dust in their wake. Another outstanding song that compliments, without copying IRON MAIDEN. SCULPTURED is from Washington. Contact them via &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;8dfeeef8e1fdf9f8bcbcbacdece2e1a3eee2e0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nI usually don't do this, but the cover art must be mentioned. Done by Artist Chris Cooper, it is a true tribute to Artist Derek Riggs early Maiden covers. The cover was based on an idea by Chris Cooper, Chris Maycock, and Jay Beiler\n\nAll told, and even with the songs I didn't like, nothing on this album is one I would hit the skip button on and most of them are good. This is the best IRON MAIDEN Tribute I've heard/reviewed so far (the other two being A CALL TO IRONS and A CALL TO IRONS 2). The fact that this is a double CD set - two full CDs!) for the price of a regular single disk makes this even better. \n\nRipped at 320 from my original CD, artwork is also included.","torrent":{"xt":"urn:btih:280e3155427bc8ca3f0847450fb5352c2f12c564","amp;dn":"Maiden+America+-+Iron+Maiden+Tribute+Plus+Original+Material","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"280e3155427bc8ca3f0847450fb5352c2f12c564","infoHashBuffer":{"type":"Buffer","data":[40,14,49,85,66,123,200,202,63,8,71,69,15,181,53,44,47,18,197,100]},"announce":[],"urlList":[]}}