{"title":"G.I. Jane(1997)DVDRip.AC3(ENG)-DROCK","uid":6359816,"size":733308360,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:284090b5466be00e74a2c5ed8bf2783ff1ea4679&amp;dn=G.I.+Jane%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1304293247,"description":"Ridley Scott directed this flawed but involving study of Lt. Jordan O'Neil (Demi Moore), a Navy topographic analyst who is chosen as a test case for the presence of women in combat. Aware that she is making history and knowing that 60% of all male trainees will fail the rigorous training, Lt. O'Neil struggles to prove herself physically and mentally worthy of becoming a Navy SEAL. What she doesn't know is that she is being sold out by hardbitten Texas senator Lillian DeHaven (Anne Bancroft in an amusing turn), who is being blackmailed by the Defense Department with politically fatal base closings unless O'Neil fails the program. The complicated political subplot, however, only distracts from the film's real virtues -- the wonderfully staged scenes of CRT selection training -- and fizzles at its climactic moment. The training scenes are wonderful, however, as the central recruits are pushed to their physical limits by a grueling weeding-out process. Viggo Mortensen is outstanding as Master Chief John James Urgayle, a steely-eyed, tough-as-nails instructor who somehow finds time to quote D.H. Lawrence when he isn't making people eat garbage and beating O'Neil senseless as part of a training exercise. Mortensen and the believably-buffed Moore are terrific, and their scenes of confrontation are the film's high points. Unfortunately, the screenplay by David Twohy and Danielle Alexandra falls down every time it attempts to sidestep a cliche, and the climactic mission (involving a downed satellite in the Libyan desert) positively wallows in a predictable Top Gun muddle. Still, the characters are engaging and those looking for an enjoyable variant on the basic-training subgenre of high-octane modern action films should be pleased.\n\nRipped with Handbrake.\n\nLength: 2 Hours 5 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:284090b5466be00e74a2c5ed8bf2783ff1ea4679","amp;dn":"G.I.+Jane%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"284090b5466be00e74a2c5ed8bf2783ff1ea4679","infoHashBuffer":{"type":"Buffer","data":[40,64,144,181,70,107,224,14,116,162,197,237,139,242,120,63,241,234,70,121]},"announce":[],"urlList":[]}}