{"title":"The Rocky Road to Dublin","uid":4591878,"size":713540216,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2862c516a001a291a49759d72ca806719c987507&amp;dn=The+Rocky+Road+to+Dublin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"issox","files":1,"time":1229867062,"description":"Rocky Road was the last film shown at the 1968 Cannes festival which was shutdown in soladarity with the student revolts in Paris. The students adopted Rocky Road and screened it in the vast amphitheatres of the Sorbonne, which was still besieged by riot police.\n\nLennon's theme was what do you do with a revolution once you've won. Lennon found that you give it straight back to the Bourgeoisie. At the centre of the film is the iron grip the Catholic Church held on Ireland after British occupation.\n\nWe see the young and hip Fr. Michael Cleary singing Chatanooga Shoeshine Boy to a maternity ward. We then see him extolling the virtues of celibacy and sex within marriage, this long before it was known that he had fathered 2 children by his housekeeper.\n\nThe film couldn't be banned in Ireland (the censors comment to the director was: &quot;Since there is no sex in the film, Peter, there is nothing I can do against you.&quot;) It was only picked up by one Dublin cinema for a short run. The church's iron grip on the country was thus shown when no other cinema dared show the film.\n\nLuckily things have changed enough that the Irish Film Institute has seen fit to restore the film and nearly 40 years after it was made it is again being shown in it's own country.\n","torrent":{"xt":"urn:btih:2862c516a001a291a49759d72ca806719c987507","amp;dn":"The+Rocky+Road+to+Dublin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2862c516a001a291a49759d72ca806719c987507","infoHashBuffer":{"type":"Buffer","data":[40,98,197,22,160,1,162,145,164,151,89,215,44,168,6,113,156,152,117,7]},"announce":[],"urlList":[]}}