{"title":"Net Transport v2.96a.581","uid":6088190,"size":7238308,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:29cfb722a5317d2fb88a162587ac593df13723ea&amp;dn=Net+Transport+v2.96a.581&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1294426857,"description":"Net Transport (also called NetTransport or NetXfer) is a faster, exciting and the most powerful downloading tool that you ever saw, now support the most prevalent Internet protocols, including: HTTP / HTTPS, FTP / through SSL (Secure Sockets Layer) / SFTP (SSH File Transfer Protocol), MMS (Microsoft Media Services), RTSP (Real-Time Streaming Protocol), PNM (rename PNM to RTSP), BitTorrent, eMule.\n\nWith independently developed Enhanced Multi-Threading (EMT) technology, can download MMS and RTSP streaming by multiple threads with perfect video &amp; audio quality. There are some other great features, like &quot;Site Manager&quot; which allows you to keep the active connection with the remote servers. In addition, the support for both SSL and SSH is hardly found in other upload/download tools.\n\nMain Features:\n1. You can use the simple but powerful &quot;File Manager&quot; to categorize and manage downloaded files more efficiently.\n2. Simple multi-user management. You can maintain several databases by logging on Windows with different username.\n3. You can use the inbuilt &quot;Site Explorer&quot; to list the directory structure of the remote server, and easily select the desired files. FTP is the most powerful item in NetXfer.\n4. FTP reuse mechanism allows you to use one connection to get different files from the same site. If you like, you can use accessory FTP client tool called &quot;FTP Transport (FtpXfer)&quot;.\n5. The &quot;Multiple Proxies mode&quot; allows you to assign every working thread a different proxy to break certain site restrictions, like only one connection per IP.\n6. Proxies with NTLM authentication can penetrate local firewall, like Microsoft ISA 2000.\n7. You can adjust the bandwidth usage of Net Transport to ensure surf at the same time.\n8. Monitor browser click. And you can add links through Internet Explorer extended context menu, or drag links to the &quot;drop zone&quot; window, etc.\n9. Net Transport can automatically shutdown the system or hang up the modem once all downloads are completed.\n10. Multilingual support for the user interface. I will be glad if you help me localize NetXfer.\n11. NTLM authentication is supported for both MMS and RTSP. In addition, RN5 authentication works for RTSP.\n12. You can use multi-threads for both MMS and RTSP to significantly reduce the time of downloads.\n13. Automatically parse streaming script such as .asx, .smi to acquire real URLs.\n14. Support SSL encryption for both HTTP and FTP, which is called https and ftps. Also support one-time password to protect your authentication information. Normally password is in the form of clear text, which is easily stolen by IP packet monitor tools. Presently NetXfer is the only one can download https streaming via SOCKS5.\n15. Support SSH encryption, which is hardly found in other upload/download tools for Windows.\n16. The flexible &quot;Scheduler Manager&quot; is also most powerful item in NetXfer. Even you can record the dynamic URL according to time and save it as your desire filename.\n17. In version 2, you can record the clip with range.\n18. On BitTorrent protocol, you can use proxy to download, upload by UPnP. NetXfer supports HTTP/HTTPS/UDP Tracker.\n\nChanges in Net Transport 2.95 (Aug 30, 2010):\n1. Fixed a bug for RTMP that program could not record certain of LIVE sites.\n2. Fixed that program would crash if &quot;piece length&quot; of a torrent file was not a multiple of 16K.\n3. Fixed that program probably crashed if parsing DNS failed.\n4. Fixed for new UI that the tool tip control of the Drop-Zone window didn't work if there were too many information to be updated.","torrent":{"xt":"urn:btih:29cfb722a5317d2fb88a162587ac593df13723ea","amp;dn":"Net+Transport+v2.96a.581","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29cfb722a5317d2fb88a162587ac593df13723ea","infoHashBuffer":{"type":"Buffer","data":[41,207,183,34,165,49,125,47,184,138,22,37,135,172,89,61,241,55,35,234]},"announce":[],"urlList":[]}}