{"title":"Resisting Hitler: Mildred Harnack and the Red Orchestra","uid":11710468,"size":3939201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29f5bf4ff10391a487e7a55323b1c1f59cef7998&amp;dn=Resisting+Hitler%3A+Mildred+Harnack+and+the+Red+Orchestra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424317693,"description":"This gripping and heartbreaking narrative is the first full account of an American woman who gave her life in the struggle against the Nazi regime. As members of a key resistance group, Mildred Harnack and her husband, Arvid, assisted in the escape of German Jews and political dissidents, and for years provided vital economic and military intelligence to both Washington and Moscow. But in 1942, following a Soviet blunder, the Gestapo arrested, tortured, and tried some four score members of the Harnacks' group, which the Nazis dubbed the Red Orchestra. Mildred Fish-Harnack was guillotined in Berlin on February 16, 1943, on the personal instruction of Adolf Hitler--she was the only American woman to be executed as an underground conspirator during World War II. Yet as the war ended and the Cold War began, her courage, idealism, and self-sacrifice went largely unacknowledged in America and the democratic West, and were distorted and sanitized in the Communist East. Only now, with the opening of long-sealed archives from Germany, the KGB, the CIA, and the FBI, can the full story be told.\nIn this superbly told life of an unjustly forgotten woman, Shareen Blair Brysac depicts the human side of a controversial resistance group that for too long has been portrayed as merely a Soviet espionage network","torrent":{"xt":"urn:btih:29f5bf4ff10391a487e7a55323b1c1f59cef7998","amp;dn":"Resisting+Hitler%3A+Mildred+Harnack+and+the+Red+Orchestra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f5bf4ff10391a487e7a55323b1c1f59cef7998","infoHashBuffer":{"type":"Buffer","data":[41,245,191,79,241,3,145,164,135,231,165,83,35,177,193,245,156,239,121,152]},"announce":[],"urlList":[]}}