{"title":"A Rabbi Looks at the Last Days - Jonathan Bernis","uid":11729922,"size":666322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a0b1f1ba0c1270b7302fd1c474e2d7323cc610a&amp;dn=A+Rabbi+Looks+at+the+Last+Days+-+Jonathan+Bernis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1425253774,"description":"\nFew topics capture the imagination of believers like the last days. Yet fear and incorrect teachings continue to surround this topic. Rabbi Jonathan Bernis, by contrast, offers with warmth and clarity a unique and surprising perspective on the end times.\n\nMany see explosive turmoil in the Middle East and the mark of the beast as signs of the return of the Messiah. Bernis points out an even clearer and more immediate sign: the fulfillment of Old Testament prophecies regarding the restoration of the land of Israel and the regathering of the Lost Tribes of Israel--which is happening in record numbers right now. This book unpacks surprising and life-changing insights on Israel, the last days, and the Messianic hope of every believer.\n\n\nAbout the author:\n Jonathan Bernis, president and CEO of Jewish Voice Ministries International, is the author of a number of popular books. He has been a leader in the Messianic Jewish Movement for over 30 years, serving as founding rabbi of congregations in Rochester, New York, and St. Petersburg, Russia. His weekly television show, Jewish Voice with Jonathan Bernis, is seen throughout the United States, Canada, Israel, the United Kingdom, Europe, and Asia. Jonathan has been interviewed on numerous media outlets, including Moody's In the Market with Janet Parshall and Chris Fabry Live! He and his family live in Phoenix, Arizona","torrent":{"xt":"urn:btih:2a0b1f1ba0c1270b7302fd1c474e2d7323cc610a","amp;dn":"A+Rabbi+Looks+at+the+Last+Days+-+Jonathan+Bernis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a0b1f1ba0c1270b7302fd1c474e2d7323cc610a","infoHashBuffer":{"type":"Buffer","data":[42,11,31,27,160,193,39,11,115,2,253,28,71,78,45,115,35,204,97,10]},"announce":[],"urlList":[]}}