{"title":"Christine Anu - Come My Way (2000)","uid":7573762,"size":110578372,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2a560ffc2d9f17f7c6984ff2b37edfb47c3c7bfa&amp;dn=Christine+Anu+-+Come+My+Way+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piratetorrent1989","files":14,"time":1346062123,"description":"Christine Anu (born 15 March 1970) is an Australian pop singer. Anu is mother of two children; Kuiam (born 1996) and Zipporah Mary (born 2002).\n\nAnu began performing as a dancer and later went on to sing back-up vocals for The Rainmakers, which included Neil Murray of the Warumpi Band. Her first recording was in 1993 with &quot;Last Train&quot;, dance remake of a Paul Kelly song. The follow-up, &quot;Monkey and the Turtle&quot;, was based on a traditional story. After &quot;My Island Home&quot;, she released her first album, Stylin' Up which went platinum, and also gained her a position as a spokeswoman for Aborigines and Torres Strait Islanders.\nIn 1995, Neil Murray won an Australasian Performing Right Association songwriting award for writing &quot;My Island Home&quot;. Christine Anu won an ARIA Award for best female recording artist as well as a Deadly Sounds National Aboriginal &amp; Islander Music Awards Award in 1996 for best female artist.\nBaz Luhrmann asked her to sing on the song &quot;Now Until the Break of Day&quot; on his Something for Everybody album. It was released as a single and the video then won another ARIA award and led to her being cast in Moulin Rouge!.\nIt took five years for a follow-up to Stylin' Up to be released; 2000's Come My Way made her a mainstream star. The single &quot;Sunshine On A Rainy Day&quot; was a Top 40 hit for 13 weeks in Australia. Come My Way went gold. In 2000 she sang the song &quot;My Island Home&quot; at the Sydney 2000 Olympics Closing Ceremony.\nAnu has been nominated for 16 ARIA Awards.\nOn 26 September 2010, she released a new digital only single, &quot;Come Home&quot;. This is her first solo single since 2003.","torrent":{"xt":"urn:btih:2a560ffc2d9f17f7c6984ff2b37edfb47c3c7bfa","amp;dn":"Christine+Anu+-+Come+My+Way+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a560ffc2d9f17f7c6984ff2b37edfb47c3c7bfa","infoHashBuffer":{"type":"Buffer","data":[42,86,15,252,45,159,23,247,198,152,79,242,179,126,223,180,124,60,123,250]},"announce":[],"urlList":[]}}