{"title":"BBC Jerusalem_ The Making of a Holy City 1 of 3 XviD AC3.avi","uid":6879488,"size":734939136,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2a795dc0a7864b903b270b8dbfc7e0a8d3cf8c9c&amp;dn=BBC+Jerusalem_+The+Making+of+a+Holy+City+1+of+3+XviD+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pharos01","files":1,"time":1323598367,"description":"58:59\n\n1. Wellspring of Holiness\n\nAuthor and historian Simon Sebag Montefiore presents a three-part series illuminating the history of the sacred and peerlessly beautiful city of Jerusalem.\n\nJerusalem is one of the oldest cities in the world. For the Jewish faith, it is the site of the Western Wall, the last remnant of the second Jewish temple. For Christians, the Church of the Holy Sepulchre is the site of the death and resurrection of Jesus Christ. For Muslims, the Al-Aqsa mosque is the third holiest sanctuary of Islam.\n\nIn episode one, Simon delves into the past to explore how this unique city came into being, explaining how it became of such major importance to the three Abrahamic faiths, and how these faiths emerged from the Biblical tradition of the Israelites.\n\nStarting with the Canaanites, Simon goes on a chronological journey to trace the rise of the city as a holy place and discusses the evidence for it becoming a Jewish city under King David. The programme explores the construction of the first temple by Solomon through to the life and death of Jesus Christ and the eventual expulsion of the Jews by the Romans, concluding in the 7th century AD, on the eve of the capture of Jerusalem by the Muslim caliph, Umar ibn al-Khattab.\n\n\nSource: BBC-HD\n\n\nA/R (WxH): 1:1.78 (720x400)\nVCodec: XviD (2 pass MPEG)\nACodec: AC3 2ch 192Kbps\n\nHD downsized/resized: 1920*1080 to 720*400\n\nFlawless encoding\n\nPls help seed to keep torrent alive!","torrent":{"xt":"urn:btih:2a795dc0a7864b903b270b8dbfc7e0a8d3cf8c9c","amp;dn":"BBC+Jerusalem_+The+Making+of+a+Holy+City+1+of+3+XviD+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a795dc0a7864b903b270b8dbfc7e0a8d3cf8c9c","infoHashBuffer":{"type":"Buffer","data":[42,121,93,192,167,134,75,144,59,39,11,141,191,199,224,168,211,207,140,156]},"announce":[],"urlList":[]}}