{"title":"Direct Alcohol Fuel Cells: Materials, Performance, Durability an","uid":9724669,"size":12512608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b72511b323609b2f96327f4bcfb85e5d18ff9a8&amp;dn=Direct+Alcohol+Fuel+Cells%3A+Materials%2C+Performance%2C+Durability+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394284842,"description":"2013 | PDF | 377 pages | 11.93 Mb\n\nDirect Alcohol Fuel Cells: Materials, Performance, Durability and Applications begins with an introductory overview of direct alcohol fuel cells (DAFC); it focuses on the main goals and challenges in the areas of materials development, performance, and commercialization. The preparation and the properties of the anodic catalysts used for the oxidation of methanol, higher alcohols, and alcohol tolerant cathodes are then described. The membranes used as proton conductors in DAFC are examined, as well as alkaline membranes, focusing on the electrical conductivity and alcohol permeability. The use of different kinds of carbon materials as catalyst supports, gas diffusion layers, and current collectors in DAFC is also discussed. State of the art of the modeling is used to estimate performance and durability. The closing chapter reviews the use of DAFC in portable equipment and mobile devices and features a detailed discussion on the mechanisms of component degradation which limits their durability.\nThis book is written to facilitate the understanding of DAFC technology, applications, and future challenges. It is an excellent introduction for electrochemical and material engineers interested in small fuel cells as portable energy sources, scientists focused on materials science for energy production and storage, as well as policy-makers in the area of renewable energies.","torrent":{"xt":"urn:btih:2b72511b323609b2f96327f4bcfb85e5d18ff9a8","amp;dn":"Direct+Alcohol+Fuel+Cells%3A+Materials%2C+Performance%2C+Durability+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b72511b323609b2f96327f4bcfb85e5d18ff9a8","infoHashBuffer":{"type":"Buffer","data":[43,114,81,27,50,54,9,178,249,99,39,244,188,251,133,229,209,143,249,168]},"announce":[],"urlList":[]}}