{"title":"tails-i386-0.9","uid":6814467,"size":600834884,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:2bd087a09b8442b7127c4f16417811d29eacd114&amp;dn=tails-i386-0.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cestpasgagne2","files":2,"time":1321148706,"description":"Tails is a live system: a complete operating-system designed to be used from a CD or a USB stick independently of the computer's original operating system. It is Free Software and based on Debian GNU/Linux.\nTails comes with several built-in applications pre-configured with security in mind: web browser, instant messaging client, email client, office suite, image and sound editor, etc.\n... &lt;a href=&quot;\nhttps://tails.boum.org/about/index.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://tails.boum.org/about/index.en.html&lt;/a&gt;\n\nNotable user-visible changes include:\n\n      Tor\n          o Upgrade to 0.2.2.34. This fixes CVE-2011-2768 and CVE-2011-2769 which prompted for manual updates for users of Tails 0.8.1.\n          o Suppress Tor's warning about applications doing their own DNS lookups. Some users have reported concerns about these warnings, but it should be noted that they are completely harmless inside Tails as its system DNS resolver is Torified.\n\n      Linux 3.0.0-6, which fixed a great number of bugs and security issues.\n\n      Iceweasel\n          o Upgrade to 3.5.16-11 ((fixes CVE-2011-3647, CVE-2011-3648, CVE-2011-3650).\n          o Torbutton: upgrade to 1.4.4.1-1, including support for the in-browser &quot;New identity&quot; feature.\n          o FireGPG: upgrade to 0.8-1+tails2. Users are notified that the FireGPG Text Editor is the only safe place for performing cryptographic operations, and these operations has been disabled in other places. Performing them outside of the editor opens up several severe attacks through JavaScript (e.g. leaking plaintext when decrypting, signing messages written by the attacker).\n          o Replace CS Lite with Cookie Monster for cookie management. Cookie Monster has an arguably nicer interface, is being actively maintained and is packaged in Debian.\n\n      Software\n          o Install MAT, the Metadata Anonymisation Toolkit. Its goal is to remove file metadata which otherwise could leak information about you in the documents and media files you publish. This is the result of a Tails developer's suggestion for GSoC 2011, although it ended up being mentored by The Tor Project.\n          o Upgrade WhisperBack to 1.5~rc1. Users are guided how to send their bug reports through alternative channels upon errors sending them. This will make bug reporting easier when there's no network connection available.\n          o Upgrade TrueCrypt to 7.1.\n\n      Miscellaneous\n          o The date and time setting system was completely reworked. This should prevent time syncing issues that may prevent Tor from working properly, which some users have reported. The new system will not leave a fingerprintable network signature, like the old system did. Previously that signature could be used to identify who is using Tails (but not deanonymize them).\n          o Erase memory at shutdown: run many instances of the memory wiper. Due to architectural limitations of i386 a process cannot access all memory at the same time, and hence a single memory wipe instance cannot clear all memory.\n          o Saner keyboard layouts for Arabic and Russian.\n          o Use Plymouth text-only splash screen at boot time.\n\nPlus the usual bunch of minor bug reports and improvements. &lt;a href=&quot;\nhttps://tails.boum.org/news/version_0.9/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://tails.boum.org/news/version_0.9/&lt;/a&gt;\n &lt;a href=&quot;\nhttps://tails.boum.org/download/index.en.html#index3h1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://tails.boum.org/download/index.en.html#index3h1&lt;/a&gt; (read on verifying the ISO image)\n\nTrackers : &lt;a href=&quot;\nhttp://z6gw6skubmo2pj43.onion:8080/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://z6gw6skubmo2pj43.onion:8080/announce&lt;/a&gt; &lt;a href=&quot;\nhttps://www.les-renseignements-genereux.org/tracker/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.les-renseignements-genereux.org/tracker/announce&lt;/a&gt;","torrent":{"xt":"urn:btih:2bd087a09b8442b7127c4f16417811d29eacd114","amp;dn":"tails-i386-0.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd087a09b8442b7127c4f16417811d29eacd114","infoHashBuffer":{"type":"Buffer","data":[43,208,135,160,155,132,66,183,18,124,79,22,65,120,17,210,158,172,209,20]},"announce":[],"urlList":[]}}