{"title":"Cadaver Dog Handbook{BBS}","uid":6649857,"size":1352806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c25afe3be60e0f580ee13c34f4d60dcdce3e72e&amp;dn=Cadaver+Dog+Handbook%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315096321,"description":"Every investigator should own the Cadaver Dog Handbook... Rebmann, David, and Sorg do a wonderful job of providing a foundation for the understanding of scent evidence and are a welcome addition to the limited research in this field. Handlers and administrators, as well as researchers and legal experts, should review this text and determine its many applications for themselves.\n-FBI Law Enforcement Bulletin, November 2001\nProduct Description\nIntended for those who train and handle cadaver dogs, this book also encompasses information for those who work closely with them, such as police, death investigators, and anthropologists. Its interdisciplinary approach is useful to any member of a forensic team who regularly participates in or evaluates the results of the human remains search effort.\nCadaver Dog Handbook sets out the principles and procedures for the training and handling of dogs for the location of human remains. It explains scent theory and its applications, introduces basic training and searching strategies/tactics, and covers the legal and taphonomic issues associated with dog searches. Intended for those who train and handle cadaver dogs, this book also encompasses information for those who work closely with them, such as police, death investigators, and anthropologists. Its interdisciplinary approach is useful to any member of a forensic team who regularly participates in or evaluates the results of the human remains search effort.\nProduct Details\n\n    * Hardcover: 232 pages\n    * Publisher: CRC Press; 1 edition (August 29, 2000)\n    * Language: English\n    * ISBN-10: 0849318866\n    * ISBN-13: 978-0849318863","torrent":{"xt":"urn:btih:2c25afe3be60e0f580ee13c34f4d60dcdce3e72e","amp;dn":"Cadaver+Dog+Handbook%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c25afe3be60e0f580ee13c34f4d60dcdce3e72e","infoHashBuffer":{"type":"Buffer","data":[44,37,175,227,190,96,224,245,128,238,19,195,79,77,96,220,220,227,231,46]},"announce":[],"urlList":[]}}