{"title":"Jay Munly...Munly &amp; The Lee Lewis Harlots(2004)[FLAC]","uid":6976264,"size":522280995,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2e3885b7a20820c9be202310ba9eaf718f343341&amp;dn=Jay+Munly...Munly+%26amp%3B+The+Lee+Lewis+Harlots%282004%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":19,"time":1327265136,"description":"[img]http://image.allmusic.com/00/amg/cov200/drg500/g535/g53520z86nt.jpg[/img]\n[color=Orange]Munly &amp; The Lee Lewis Harlots [2004]Alternative Tentacles / 324[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. Amen Corner 4:00\n2. Big Black Bull Comes Like A Caesar 6:45\n3. Old Service Road 3:56\n4. Another Song About Jesus, A Wedding Sheet, And A Bowie Knife 5:39\n5. Cassius Castrato The She-Male Of the Mens Prison 5:15\n6. 'Ragin' Cajun' 4:21\n7. Song Rebecca Calls,'that birdcage song' 6:13\n8. Goose Walking Over My Grave 5:40\n9. The Leavening Of the Spit-Bread Girls 3:07\n10. A Gentle Man's Jihad 5:04\n11. The Denver Boot Redux 5:37\n12. Of Silas Fauntleroys Willingness To Influence the Panel 3:35\n13. Jacob Dumb 4:41\n14. My Second Salvation Army Choir 5:38\n15. River Forktine Tppecanoe 7:28\n\n\nAlmost eight years since its release, Munly and the Lee Lewis Harlots' self titled CD sounds just as fresh as the day it hit the shelves, but to define it as simply a 'classic' would be to discredit the effort altogether. The musical philosophy lying within its soundscapes translates to an authentic transcendentalism. \nMunly, from Denver, has finally broken through on this one; he ventures far beyond his previous album Jimmy Carter Syndrome, another example of genius at work. Not only has his cryptic storytelling managed to surpass itself but his overall songwriting has grown. Already an acclaimed poet, Munly's pieces have become more perceptive towards the audience with their lyrically yet remain distinctly ambiguous, all the while maintaining a genuine reflection of gothic Americana. This paired with the Harlots' kinetic orchestral backing and female vocals is eye-opening, if not hallucinatory. \n\nThe album opens with &quot;Amen Corner,&quot; a song with a Nick Cave-like dreariness that develops into an aural assault of upbeat strings, pounding drums, and a preternatural yodel - a vocalist style that Munly has adopted to build musical momentum and capture lyrical essences that he knows are better left open to interpretation. It also serves as a symbol for his lack of apprehensiveness when it comes to displaying his musical range; demanding the audience accept just how heavy this shit really is. \n\nHis range is illustrated by more than just a yodel, however. On &quot;Cassius Castrato The She-Male of the Men's Prison&quot; Munly's voice reaches wavering heights and plummets to rumbling lows in a dialogue between the song's emasculated protagonist, Cassius, and the 'unsmiling' prison guards, a few of the album's many characters. \n\nThe last track, &quot;River Forktine Tippecanoe,&quot; closes the album with a seething tale of resentment, malformed brothers, and fishing in a jaw-dropping eight minutes of country spirit shouting through a tribal cage - a sound Munly's other band, Slim Cessna's Auto Club, has been experimenting with. \n\nAlthough this all may sound very lofty, Munly and Absinthe Studios had the insight to provide one indisputable denoting factor for newcomers and laymen alike: damn good sound. This album is a lesson in production qualities; building on minimalism and good, honest talent. Above that, the DVD includes a beautiful photographic slideshow that accompanies the 5.1 surround sound option, along with artwork and Easter eggs. \n\nIndeed this is everything the true music fan could/should ask for: it provides entertainment as well as introspective education. For Munly and his band it serves as the moment in history when the American music scene changed (not only in Denver); a dare to all bands, of every genre, to authenticate themselves.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2010/11/30/jay-munly/[/url]","torrent":{"xt":"urn:btih:2e3885b7a20820c9be202310ba9eaf718f343341","amp;dn":"Jay+Munly...Munly+%26amp%3B+The+Lee+Lewis+Harlots%282004%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e3885b7a20820c9be202310ba9eaf718f343341","infoHashBuffer":{"type":"Buffer","data":[46,56,133,183,162,8,32,201,190,32,35,16,186,158,175,113,143,52,51,65]},"announce":[],"urlList":[]}}