{"title":"The Black Hour by Lori Rader-Day (retail) {dwg}","uid":11049988,"size":8420114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2eecdf3ccd972ea0d15f46b538907fcf53e057c9&amp;dn=The+Black+Hour+by+Lori+Rader-Day+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1411007418,"description":"For Chicago sociology professor Amelia Emmet, violence was a research topic--until a student she'd never met shot her. \n\nHe also shot himself. Now he's dead and she's back on campus, trying to keep up with her class schedule, a growing problem with painkillers, and a question she can't let go: Why?\n\nAll she wants is for life to get back to normal, but normal is looking hard to come by. She's thirty-eight and hobbles with a cane. Her first student interaction ends in tears (hers). Her fellow faculty members seem uncomfortable with her, and her ex--whom she may or may not still love--has moved on.\n\nEnter Nathaniel Barber, a graduate student obsessed with Chicago's violent history. Nath is a serious scholar, but also a serious mess about his first heartbreak, his mother's death, and his father's disapproval.  Assigned as Amelia's teaching assistant, Nath also takes on the investigative legwork that Amelia can't do. And meanwhile, he's hoping she'll approve his dissertation topic, the reason he came to grad school in the first place: the student attack on Amelia Emmet. \n\nTogether and at cross-purposes, Amelia and Nathaniel stumble toward a truth that will explain the attack and take them both through the darkest hours of their lives","torrent":{"xt":"urn:btih:2eecdf3ccd972ea0d15f46b538907fcf53e057c9","amp;dn":"The+Black+Hour+by+Lori+Rader-Day+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eecdf3ccd972ea0d15f46b538907fcf53e057c9","infoHashBuffer":{"type":"Buffer","data":[46,236,223,60,205,151,46,160,209,95,70,181,56,144,127,207,83,224,87,201]},"announce":[],"urlList":[]}}