{"title":"Anne Murray - Christmas Wishes 320cbr (Big Papi) 1981 Birth Year","uid":9380091,"size":76806690,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2f1e92b083d066aab4900f8aa739516a4318cc81&amp;dn=Anne+Murray+-+Christmas+Wishes+320cbr+%28Big+Papi%29+1981+Birth+Year&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387697001,"description":"Source: 1981 CD\n \nAnne Murray - Christmas Wishes 320cbr (Big Papi) 1981 Birth Year of the Compact Disc\n\n\n1981 was the first year music was released to the public on compact discs. This Ann Murray CD rip represents a bit of history. As far as Anne's singing her voice is like a bird, but for some reason her voice in this album seems mechanical. If you;re a big Anne Murray fan you may love this but it actually bothers me to listen to it...... - Big Papi\n\n\nBy Lawrance M. Bernabo VINE VOICE\nAfter making her third album in 1970 a Christmas album, Canadian songbird Anne Murray waited until 1981 before releasing another holiday offering, &quot;Christmas Wishes.&quot; Oddly enough, I had never really enjoyed Murray as a contemporary pop singer, but ever since I first picked up this album she has been one of my favorite singers of Christmas songs. The only complaint with &quot;Christmas Wishes&quot; is that I wish there was more than ten tracks, although these are ten extremely solid songs. The title song is the one unfamiliar track, but you will be impressed with what Murray does with the holiday standards &quot;Winter Wonderland&quot; and &quot;I'll Be Home for Christmas,&quot; as well as the traditional folk song &quot;Go Tell it on the Mountain.&quot; She is equally adept at Christmas hymns like &quot;Joy to the World&quot; and &quot;Silent Night.&quot; There are a handful of singers who deserve to be part of your regular holiday rotation while trimming the tree and cooking the Christmas goose, and Anne Murray deserves to be in the mix. Just be aware that you will find most of these songs on her superb 2001 2-CD collection, &quot;What a Wonderful Christmas.&quot;","torrent":{"xt":"urn:btih:2f1e92b083d066aab4900f8aa739516a4318cc81","amp;dn":"Anne+Murray+-+Christmas+Wishes+320cbr+%28Big+Papi%29+1981+Birth+Year","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1e92b083d066aab4900f8aa739516a4318cc81","infoHashBuffer":{"type":"Buffer","data":[47,30,146,176,131,208,102,170,180,144,15,138,167,57,81,106,67,24,204,129]},"announce":[],"urlList":[]}}