{"title":"The Love Language - Libraries [2010] [EAC/FLAC]","uid":10363912,"size":243377092,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2fbf5ffec3a4674d1bdfae5cb27691c6f940ac45&amp;dn=The+Love+Language+-+Libraries+%5B2010%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":-1,"time":1402850697,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Merge #MRG366\nCountry: USA\nYear: July 13, 2010\nGenre: pop,rock\nFormat: CD,Album\n\n\n\n\n\n01 - Pedals\n02 - Brittany's Back\n03 - This Blood Is Our Own\n04 - Summer Dust\n05 - Blue Angel\n06 - Heart to Tell\n07 - Anthophobia\n08 - Horophones\n09 - Wilmont\n10 - This Room\n\n\n\n\nStuart McLamb proved he could make a pretty fine album all by himself with the Love Language's 2009 self-titled debut, and on Libraries, the first album on Merge for the &quot;group&quot; (essentially McLamb and whoever he chooses to bring along), he shows he can do even better with a bit of production help and a few musicians to help him with the tough parts. Unlike the first album, Libraries was recorded in an actual recording studio (with B.J. Burton serving as engineer and co-producer), and this set of songs retains McLamb's impressive gift for melodies while giving the surroundings just the right amount of polish, which serves McLamb's Spector-esque ambitions very well indeed. After making a big-sounding album on a makeshift home-recording setup, McLamb has crafted some truly epochal tracks for Libraries (particularly &quot;Anthophobia&quot; and &quot;Horophones&quot;), but he has a sure enough grasp of dynamics to know when to play to the last row of the balcony and when to go for something more intimate (cue up &quot;Pedals&quot; and &quot;This Room&quot;), and though he plays most of the instruments himself, the participation of several members of his road band and a few special guests lends some cleaner lines to the performances, which serve them well. And while McLamb's indie pop craft is tighter and better executed, at heart he still sounds like the same guy who made the debut -- a little confused, a little obsessive, and still figuring out this whole human relationship business, which has inspired more great pop music than anything else you can name. For all its ambition, Libraries retains nearly everything that was memorable about the Love Language's debut as it improves on what McLamb accomplished before; if he can do that again, who knows where this admirably screwy genius could end up.","torrent":{"xt":"urn:btih:2fbf5ffec3a4674d1bdfae5cb27691c6f940ac45","amp;dn":"The+Love+Language+-+Libraries+%5B2010%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fbf5ffec3a4674d1bdfae5cb27691c6f940ac45","infoHashBuffer":{"type":"Buffer","data":[47,191,95,254,195,164,103,77,27,223,174,92,178,118,145,198,249,64,172,69]},"announce":[],"urlList":[]}}