{"title":"Jenny Milewski - Yuko - Svensk","uid":14755333,"size":464413100,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2fcd69bd7eee638a7487f795d623ff5fb6fab824&amp;dn=Jenny+Milewski+-+Yuko+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":102,"time":1464800826,"description":"Jenny Milewski – Yuko\r\n\r\nYuko är lika otäck som The Shining, lika hårresande som The Grudge och ytterligare ett bevis på att svensk skräck ligger i framkant.\r\n\r\nStudentkorridoren på Ryds Allé i Linköping verkar vara som de flesta studentkorridorer när Malin flyttar in. Hennes första egna bostad, med badkar och källarförråd. Men hennes korridorskamrater agerar konstigt och snart känner Malin att de döljer något för henne, något som alla är överens om att hon inte ska få veta.\r\nNär Malin får veta att Yuko som bodde i hennes rum tog livet av sig i badkaret blir hon skakad, men det är inget mot vad hon blir när det kommer svart hår ur badkarsavloppet och dörrarna i korridoren stängs, trots att bara Malin är hemma.\r\n\r\nAllt oftare slängs alla deras skor huller om buller i korridoren, teven byter kanaler av sig själv och när Camilla försvinner spårlöst börjar hela situationen kännas ohanterlig men vad ska de göra? Ingen kommer tro dem om de säger att Yuko spökar.\r\nDet blir allt tydligare att Yuko inte kommer lägga fingrarna emellan för att göra livet till ett helvete för studenterna i korridoren och att det inte finns någon gräns för hur långt hon tänker gå.\r\n\r\nYuko är en gastkramande spökhistoria där greppen från 90-talets klassiska college-skräck ställs mot asiatisk spöktradition. Under studenternas förtvivlade kamp mot det obegripliga väcks frågor om kulturell förståelse och människans eviga jakt efter mening.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Viktoria Flodström\r\nSpeltid: Ca 8 timmar","torrent":{"xt":"urn:btih:2fcd69bd7eee638a7487f795d623ff5fb6fab824","amp;dn":"Jenny+Milewski+-+Yuko+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fcd69bd7eee638a7487f795d623ff5fb6fab824","infoHashBuffer":{"type":"Buffer","data":[47,205,105,189,126,238,99,138,116,135,247,149,214,35,255,95,182,250,184,36]},"announce":[],"urlList":[]}}