{"title":"Mannheim Steamroller - Fresh Aire II - FLAC (Big Papi)","uid":9496827,"size":193687923,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:302a5e006c30e220d9a9dc4b2907fb14448e931c&amp;dn=Mannheim+Steamroller+-+Fresh+Aire+II+-+FLAC+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1390092203,"description":"Source: 1992 CD (1 of a 4 box set. Cover art is not accurate for the set)\n\nimage\n\nimage\n\nBy David\n\nAfter eight albums of &quot;Fresh Aire,&quot; and several albums in various other series, this second album remains among my favorites. It introduces the &quot;Going To Another Place&quot; theme, which has become something of a signature piece for Mannheim (used in various forms on many of their albums), and for that track alone, it's worth a listen.\nThe concept may be too &quot;new agey&quot; for some. The first half of the album is presented as though you are standing in an arena of sorts, and various doors surrounding you are opening and revealing different emotions. For example, when Door #4 (track 4) opens, you're supposed to feel relaxed, hence the quiet nature of that piece. When Door #5 opens, there's a sense of &quot;frenetic energy,&quot; and the music is appropriately upbeat. Yes, it's a corny ploy, and I'm not sure how it fits the concept of Fall that this album is supposedly built around, but the music is good regardless.\nMuch of the music makes use of Baroque instruments-- harpsichords, recorders, trumpets, etc... but quite often arranged in a modern style. This has been a hallmark of Chip Davis' composition in the early part of the Fresh Aire series, and it works particularly well here.","torrent":{"xt":"urn:btih:302a5e006c30e220d9a9dc4b2907fb14448e931c","amp;dn":"Mannheim+Steamroller+-+Fresh+Aire+II+-+FLAC+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302a5e006c30e220d9a9dc4b2907fb14448e931c","infoHashBuffer":{"type":"Buffer","data":[48,42,94,0,108,48,226,32,217,169,220,75,41,7,251,20,68,142,147,28]},"announce":[],"urlList":[]}}