{"title":"Brian A. Pavlac - Witch Hunts in the Western World [2009][A]","uid":9998339,"size":4532686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:309fea870051747faa74f971c748ac939306eaa2&amp;dn=Brian+A.+Pavlac+-+Witch+Hunts+in+the+Western+World+%5B2009%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397948425,"description":"Description\nProduct details\nBook Title: Witch Hunts in the Western World: Persecution and Punishment from the Inquisition to the Salem Trials\t\nBook Author: Brian Alexander Pavlac (Author)\nHardcover: 272 pages\nPublisher: Greenwood Press; First Edition, First Printing edition (17 Feb 2009)\nLanguage: English\nISBN-10: 0313348731\nISBN-13: 978-0313348730\n\nBook Description\nPublication Date: 17 Feb 2009\nThis book explores the evolution of western attitudes towards religion, politics, and the supernatural, which manifested in the witch hunts in Europe and the New World. This in-depth and comprehensive resource explores the intersection of religion, politics, and the supernatural that spawned the notorious witch hunts in Europe and the New World.&quot;Witch Hunts in the Western World&quot; traces the evolution of western attitudes towards magic, demons, and religious nonconformity from the Roman Empire through the Age of Enlightenment, placing these chilling events into a wider social and historical context. Witch hunts are discussed in fascinating detail by region, highlighting the cultural differences of the people who incited them as well as the key reforms, social upheavals, and intellectual debates that shaped European thought. Vivid accounts of trials and excerpts from the writings of both witch hunters and defenders throughout the Holy Roman Empire, France, the British Isles and colonies, Southern Europe, Scandinavia, and Eastern Europe bring to life one of the most intriguing and shocking periods in Western history.Accessible narrative chapters make this a fascinating volume for general readers while offering a wealth of historic information for students and scholars. Features include a complete glossary of terms, time line of major events, recommended reading selections, index, and black and white illustrations.\n\nAbout the Author\nBrian A. Pavlac is Chair of the History Department at King's College in Wilkes-Barre, PA where he teaches European History.\n","torrent":{"xt":"urn:btih:309fea870051747faa74f971c748ac939306eaa2","amp;dn":"Brian+A.+Pavlac+-+Witch+Hunts+in+the+Western+World+%5B2009%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"309fea870051747faa74f971c748ac939306eaa2","infoHashBuffer":{"type":"Buffer","data":[48,159,234,135,0,81,116,127,170,116,249,113,199,72,172,147,147,6,234,162]},"announce":[],"urlList":[]}}