{"title":"Wave Alarm ( APK )","uid":10812928,"size":21728881,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:311861362a881705ce8cd67bf8d68baf558ddd62&amp;dn=Wave+Alarm+%28+APK+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougstamper","files":-1,"time":1408444454,"description":"Description\n\n\nWave Alarm is not your ordinary alarm clock application. Wave Alarm is something new... Wave Alarm features Motion Control technology, a new way to wake up in the morning. With Wave Alarm, you never have to touch your phone to silence or snooze, just wave off the alarm! No more fumbling around for your phone in the dark just to turn off the alarm, a simple gesture and Wave Alarm will silence or snooze it for you!\n\nHow it works:\nWave Alarm is a revolutionary Alarm Clock application that will change the way you wake up! Utilizing Motion Control and detection, you never need to touch your phone again in the morning to turn off the alarm or to snooze, just wave your hand over the device when the alarm is sounding, and Wave Alarm will snooze or silence the alarm for you!\n\nBesides revolutionary motion control, wave alarm features:\nâ˜… Beautiful, modern interface with both analog and digital features\nâ˜… Real-time weather\nâ˜… Finger touch brightness control\nâ˜… 10 beautiful new alarms sounds to choose from\nâ˜… Ability to wake up to music from your music library\nâ˜… Background alarms, so you never miss a wake up\nâ˜… Gentle Alarm feature to wake you up naturally\n\nTry Wave Alarm and you wont go back to those ordinary alarm clock apps ever again!\n\nNOTE: Motion Detection requires a front facing camera and can be activated by things like ceiling fans and other moving objects in your room. This application is not designed to function from the SD card. Some features require upgrade to full version.\n\n\nBy Doug Stamper\n\n","torrent":{"xt":"urn:btih:311861362a881705ce8cd67bf8d68baf558ddd62","amp;dn":"Wave+Alarm+%28+APK+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"311861362a881705ce8cd67bf8d68baf558ddd62","infoHashBuffer":{"type":"Buffer","data":[49,24,97,54,42,136,23,5,206,140,214,123,248,214,139,175,85,141,221,98]},"announce":[],"urlList":[]}}