{"title":"Landforms of the World with Google Earth - Understanding our Env","uid":12522243,"size":101303496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3210fc60f2c535258f29e4d0a99d3d1cfdc4e953&amp;dn=Landforms+of+the+World+with+Google+Earth+-+Understanding+our+Env&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1443898969,"description":"Publisher: Springer; 2015 edition (March 12, 2015)\r\nLanguage: English\r\nISBN-10: 9401797129\r\nISBN-13: 978-9401797122\r\n\r\nThis book of phenomenal illustrations provides a wealth of visual information on the wide variety of landform processes over all latitudes, climates and geological time-scales. It invites you to observe the surface of planet Earth, to appreciate its astonishing beauty and to explore scientific explanations for the form of our landscapes.\r\n\r\n250 full-colour images from Google Earth enable all types of terrestrial environments and landforms to be appreciated at a glance. Images are explained with scales, coordinates, explanatory text and references, making the landform processes active on our globe easy for the reader to comprehend.\r\n\r\nSee the effects of both sudden and slow forming agents such as the impact of a comet or meteorite, and erosion and deposition processes through wind, flowing water, creeping glacier ice, or frost in the ground. Appreciate how landscapes are shaped by processes such as weathering, transport and erosion and how that erosion enables us to look into endogenic processes (those within the Earth´s crust), called tectonics. These images and the processes that they document show that continents are shifting, mountains are uplifting, and ocean bottoms may sink deeper.\r\n\r\nThis collection will appeal to everyone: researchers, students and non-experts alike can take inspiration from these images, which bring the landforms of the world to life. The scientific discipline of geomorphology becomes accessible through the fascinating insights that these clear, well explained images allow","torrent":{"xt":"urn:btih:3210fc60f2c535258f29e4d0a99d3d1cfdc4e953","amp;dn":"Landforms+of+the+World+with+Google+Earth+-+Understanding+our+Env","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3210fc60f2c535258f29e4d0a99d3d1cfdc4e953","infoHashBuffer":{"type":"Buffer","data":[50,16,252,96,242,197,53,37,143,41,228,208,169,157,61,28,253,196,233,83]},"announce":[],"urlList":[]}}