{"title":"The Year's Best Horror Stories 10 and 12","uid":8401156,"size":2056178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3293446c68b9f67629de537541c310cfc37c9941&amp;dn=The+Year%27s+Best+Horror+Stories+10+and+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eddiehjjjfcfjfc","files":-1,"time":1366700732,"description":"Epub &amp; Mobi\n\nIncludes:\n\nKarl Edward Wagner (Ed.) - The Year's Best Horror Stories 10\nKarl Edward Wagner (Ed.) - The Year's Best Horror Stories 12\n\nThe Year's Best Horror Stories was a series of annual anthologies published by DAW Books from 1971 to 1994 under the successive editorships of Richard Davis from 1971 to 1973, and, after a two year hiatus, Gerald W. Page from 1976 to 1979, and Karl Edward Wagner from 1980 to 1994. The series was discontinued after Wagner's death. It was a companion to DAW's The Annual World's Best SF and The Year's Best Fantasy Stories, which performed a similar office for the science fiction and fantasy genres.\n\nEach annual volume reprinted what in the opinion of the editor was the best horror short fiction appearing in the previous year. The series also aimed to discover and nurture new talent. It featured both occasionally recurring authors and writers new to the horror genre. Veterans among the contributing authors included Brian Lumley, David Drake, Eddy C. Bertin, Kit Reed, Lisa Tuttle, R. Chetwynd-Hayes, Ramsey Campbell, Richard Matheson, Robert Bloch, Stephen King, and Tanith Lee; some of the then-newcomers to the field featured were Al Sarrantonio, Dennis Etchison, Jessica Amanda Salmonson, Juleen Brantingham, and Nina Kiriki Hoffman.","torrent":{"xt":"urn:btih:3293446c68b9f67629de537541c310cfc37c9941","amp;dn":"The+Year%27s+Best+Horror+Stories+10+and+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3293446c68b9f67629de537541c310cfc37c9941","infoHashBuffer":{"type":"Buffer","data":[50,147,68,108,104,185,246,118,41,222,83,117,65,195,16,207,195,124,153,65]},"announce":[],"urlList":[]}}