{"title":"Quask Form Artist Professional","uid":4422911,"size":33456725,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3317644718b71bc21c8c81c4587ba21c10fae7e4&amp;dn=Quask+Form+Artist+Professional&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mobie9","files":1,"time":1222877128,"description":"Release Description:\nÃ‚Â±  ~~~~~~~~~~~~~~~~~~~\n\n   Quask FormArtist will appeal to anyone who wants to fully integrate their \n   forms and surveys into their own web pages. With Quask FormArtist, web \n   designers can create forms, which look great and are fun to fill in. \n   Forms can be embedded into websites, directly into e-mails or pop-up in \n   their own windows. Instead of hours of cumbersome design work, achieve \n   the same result in minutes. \n\n   With Quask FormArtist, you can easily create forms, which look great and \n   are fun to fill in. Forms can be embedded into websites, directly into \n   e-mails or pop-up in their own windows. Instead of hours of cumbersome \n   design work, achieve the same result in minutes. It covers the entire \n   survey process from form design, distribution, data collection through \n   to the analysis of your data. Quask uses unique Interactive Images \n   (Emoticons) in addition to the available standard survey tools. You are \n   in full control of the entire process.\n\nFormArtist Professional ($899) software provides you with an advanced electronic forms and survey solution. If you require unbranded forms, offline as well as online form filling, the ability to produce advanced exports such as SPSS and HTML, or support for CRM software and ODBC datasources, you need to look at the Professional edition.  \n\n\nAll the features of the Standard edition. \nNo Quask branding. \nPDF form creation. \nOffline as well as online form completion. \nSupport for CRM software such as ACT!, GoldMine and Microsoft CRM. \nODBC support. \nAdvanced Scripting such as page and response randomization. \nSPSS, ODBC, Snap and Triple-S exports. \nCreate reports in HTML. \nAutomated data retrieval. \nThe ability to program JavaScripts in your forms and interact with HTML or JavaScript elements on your web page. \nAutomatic issue of follow-up reminders to non-respondents. \nSpell Checker. \n\n","torrent":{"xt":"urn:btih:3317644718b71bc21c8c81c4587ba21c10fae7e4","amp;dn":"Quask+Form+Artist+Professional","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3317644718b71bc21c8c81c4587ba21c10fae7e4","infoHashBuffer":{"type":"Buffer","data":[51,23,100,71,24,183,27,194,28,140,129,196,88,123,162,28,16,250,231,228]},"announce":[],"urlList":[]}}