{"title":"Spectrals - Sob Story (2013) [FLAC]","uid":8600837,"size":261619690,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3456f52ff569062ce558facc9bdf4cf04407e3be&amp;dn=Spectrals+-+Sob+Story+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1371875300,"description":"\n  Spectrals - Sob Story (2013) [FLAC]\n\n  * Genre: Pop/Rock\n  * Styles: Indie Pop, Indie Rock, Noise Pop\n  * Source: WEB\n  * Codec: FLAC\n  * Bit Rate: ~ 950 kbps\n  * Bit Depth: 16\n  * Sampling Rate: 44,100 Hz\n\n  * 01 Let Me Cave In \n  * 02 A Hearbeat Behind\n  * 03 Karaoke \n  * 04 Sob Story \n  * 05 Milky Way \n  * 06 Friend Zone \n  * 07 Limousine \n  * 08 Something To Cry About \n  * 09 Blue Whatever \n  * 10 Keep Your Magic Out Of My House\n  * 11 Gentle \n  * 12 In A Bad Way \n\n  * After releasing an album in 2011, Bad Penny, on which he played most of the instruments, Spectrals frontman Louis Jones changes things up a bit on the follow-up, 2013's Sob Story. The Richard Formby-produced debut fell just short of success thanks to some overly clean production and songs that weren't quite there in the hooks department. This time out, Jones adds a few extra musicians, including his brother William on drums again, installs Chet &quot;JR&quot; White (formerly of Girls) in the producer's chair, and gives his sophisticated guitar pop a more lived-in and scruffy sound. It's just the thing Jones needed to make the songs come to life. Last time out, the slick surfaces and studied melodies let the tunes slip right past; this time they are more likely to stick. The thumping &quot;Let Me Cave In&quot; starts things off swimmingly, with Jones' slurred vocals bolstered by some strong drumming and muscular guitar. \n\n  * The rest of the album is made up of songs that have snappy hooks and come across as the kind of songs one might find buried on an XTC album (&quot;A Heartbeat Behind&quot;), on a power pop compilation (the very peppy &quot;Gentle&quot;), or on a Let's Active B-side (&quot;Milky Way&quot;). Songs that are a little complicated and fussy, but full of heart and spunk. There are a couple outliers that show how Jones' songwriting has grown, like the chugging rocker &quot;Keep Your Magic Out of My House&quot; and the swaggering jangler &quot;Karaoke,&quot; which sounds almost exactly like a lost Trash Can Sinatras classic. There are also a couple of songs that let down the side miserably, namely the ballads &quot;Sob Story&quot; and &quot;In a Bad Way.&quot; These songs are draggy and tuneless, with Jones' vocals sounding totally wrong. His marble-mouthed vocals sound a little odd on the uptempo tracks, but in a very appealing Edwyn-Collins-on-cough-syrup kind of way. On the slower songs, they don't work at all. Best to ignore these two misfits and think of all the finely played and sung modern guitar pop that surrounds them. Because that stuff will make fans of Prefab Sprout, Orange Juice, and all the bands who have stolen from them through the years very happy and satisfied indeed.","torrent":{"xt":"urn:btih:3456f52ff569062ce558facc9bdf4cf04407e3be","amp;dn":"Spectrals+-+Sob+Story+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3456f52ff569062ce558facc9bdf4cf04407e3be","infoHashBuffer":{"type":"Buffer","data":[52,86,245,47,245,105,6,44,229,88,250,204,155,223,76,240,68,7,227,190]},"announce":[],"urlList":[]}}