{"title":"Gusher of Lies: The Dangerous Delusions of Energy Independence","uid":8454408,"size":3441355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34648aa860b69e84833a15686db142f14103fee6&amp;dn=Gusher+of+Lies%3A+The+Dangerous+Delusions+of+Energy+Independence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1368077521,"description":" Robert Bryce, &quot;Gusher of Lies: The Dangerous Delusions of Energy Independence&quot;\nEnglish | 2008 | ISBN: 1586483218, 158648690X | 384 pages | PDF | 3 MB\n\nA surprising, irreverent, and scrupulously reported deconstruction of today's fashions in energy policy.\n\nEverybody is talking about &quot;energy independence.&quot; But is it really achievable? Is it actually even desirable? In this controversial, meticulously researched book, Robert Bryce exposes the false promises behind the rhetoric while blasting nearly everybody--Republicans, Democrats, environmentalists, and war-mongering neoconservatives--for misleading voters about our energy needs.\n\nGusher of Lies explains why the idea of energy independence appeals to voters while also showing that renewable sources like wind and solar cannot meet America's growing energy demand. Along the way, Bryce eviscerates the ethanol scam. Whether the issue is cost, water consumption, or food prices, corn ethanol is one of the longest-running robberies ever perpetrated on American taxpayers.\n\nConsumers concerned about peak oil and the future of global energy supplies need to understand that energy security depends on embracing free markets and the realities of interdependence. Gusher of Lies is illuminating, vital reading.","torrent":{"xt":"urn:btih:34648aa860b69e84833a15686db142f14103fee6","amp;dn":"Gusher+of+Lies%3A+The+Dangerous+Delusions+of+Energy+Independence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34648aa860b69e84833a15686db142f14103fee6","infoHashBuffer":{"type":"Buffer","data":[52,100,138,168,96,182,158,132,131,58,21,104,109,177,66,241,65,3,254,230]},"announce":[],"urlList":[]}}