{"title":"The Nest.mp4","uid":11703040,"size":666556440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34a1ae51b42db8e28496ba2a8c89330fb36b13c9&amp;dn=The+Nest.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MoofieMan","files":1,"time":1423997391,"description":"The Nest is a classic 'B' Horror movie by the master of high turnover filmmaking Roger Corman. In this movie, a small island off the coast of America is overrun with killer cockroaches that can't be exterminated with normal insecticides. There is an evil corporation behind the conspiracy (having created the insect monsters), a suave police chief that has to save the town, a love story woven into it, plenty of grisly deaths and some pretty gruesome but budget special effects.\n\nHaving said all that, it's a great movie that I looked for over many years of torrenting and couldn't find it. One day I stumbled across it on a free streaming site and joyfully downloaded it. The result did not disappoint! It's a not-too-bad MP4 version in full 16:9 ratio (720x400) @ only 562 kbps, so the file size is pretty small. Typically, I remastered the audio (compressed for vocals, levelled and amplified to -2dB) then re-rendered @ 448kbps AC3. This fully preserves the re-rendered, new characteristics of the soundtrack. It is very watchable and audible.\n\nSo, to all of you Roger Corman fans, 'B' movie enthusiasts, 1980's flick-o-philes or anyone else who likes easy, watchable movies, download and enjoy... The Nest!\n\nCheers,\nMoofieMan","torrent":{"xt":"urn:btih:34a1ae51b42db8e28496ba2a8c89330fb36b13c9","amp;dn":"The+Nest.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34a1ae51b42db8e28496ba2a8c89330fb36b13c9","infoHashBuffer":{"type":"Buffer","data":[52,161,174,81,180,45,184,226,132,150,186,42,140,137,51,15,179,107,19,201]},"announce":[],"urlList":[]}}