{"title":"Jack Elliott - Jack Takes The Floor (1958)","uid":4217342,"size":63461184,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3552f0aa9ed9c807617fdd81fe9f39a3c458eb03&amp;dn=Jack+Elliott+-+Jack+Takes+The+Floor+%281958%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"davjoh1","files":16,"time":1212416423,"description":"  In the engine of modern music, this is one of the spark plugs. Jack Elliott Takes The Floor (later released as Muleskinner) was recorded off the cuff at London\\&amp;#039;s Topic Records. Jack talks us into each song with wry, leisurely intros that are worth the price of admission alone. His guitar technique was an education to the hard-stumming \\&quot;folk singers\\&quot; of the time, but also impacted on later popular music.\n  The album pulls together a pantheon of previously little-known source - including Jesse Fuller, Reverend Gary David, field holler, and prison blues - and is remarkably hard edged. The raw, unadorned beauty of \\&quot;Dinky\\&amp;#039;s Song\\&quot; och \\&quot;Black Baby\\&quot; remain spine-chilling highlights. \\&quot;Mule Skinner\\&amp;#039;s Blues\\&quot; and \\&quot;San Francisco Bay Blues\\&quot; bacame hallmarks of Elliott\\&amp;#039;s work.\n  Jack played frequently with Woodie Guthrie in tie 1950s. Having settled in New York in 1961, he met a kid in Guthrie\\&amp;#039;s hospital room who was soon to have a poster annoucning his own first NYC gig: \\&quot;Son of Jack Elliott - Bob Dylan\\&quot;. In chronicles, Dylan desribes first hearing ... Takes the floor: \\&quot;I felt like I\\&amp;#039;d been into sudden hell ... His voice leaps all over the room ... and he plays the guitar effortlessy in a fluid flat-picking perfect style...\\&quot;\n  Paul McCartney, Mick Jagger, and Keith Richards have all also acknowledged Jack\\&amp;#039;s influence. Little wonder: this release is still as engaging as it was in 1958.\n(Src: SJar, 1001 Albums you must hear before you die)","torrent":{"xt":"urn:btih:3552f0aa9ed9c807617fdd81fe9f39a3c458eb03","amp;dn":"Jack+Elliott+-+Jack+Takes+The+Floor+%281958%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3552f0aa9ed9c807617fdd81fe9f39a3c458eb03","infoHashBuffer":{"type":"Buffer","data":[53,82,240,170,158,217,200,7,97,127,221,129,254,159,57,163,196,88,235,3]},"announce":[],"urlList":[]}}