{"title":"The Animals - Animal Tracks (1965) [Japanese Edition 1995]","uid":8625925,"size":190098816,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:35fd9354dd1a247946e38c565672188b89b27f60&amp;dn=The+Animals+-+Animal+Tracks+%281965%29+%5BJapanese+Edition+1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"saintsmon","files":42,"time":1372467078,"description":"This is the same torrent that was uploaded to Demonoid in July 2008.\n\n\nThe Animals - Animal Tracks (1965) [Japanese Edition 1995]\n &lt;a href=&quot;\nhttp://image.allmusic.com/00/amg/cov200/dri800/i866/i86676szrq8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.allmusic.com/00/amg/cov200/dri800/i866/i86676szrq8.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 16 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nOne of the most important bands originating from England's R&amp;B scene during the early '60s, the Animals were second only to the Rolling Stones in influence among R&amp;B-based bands in the first wave of the British Invasion. The Animals had their origins in a Newcastle-based group called the Kansas City Five, whose membership included pianist Alan Price, drummer John Steel, and vocalist Eric Burdon. Price exited to join the Kontours in 1962, while Burdon went off to London. The Kontours, whose membership included Bryan &quot;Chas&quot; Chandler, eventually were transmuted into the Alan Price R&amp;B Combo, with John Steel joining on drums. Burdon's return to Newcastle in early 1963 heralded his return to the lineup. The final member of the combo, guitarist Hilton Valentine, joined just in time for the recording of a self-produced EP under the band's new name, the Animals. That record alerted Graham Bond to the Animals; he was likely responsible for pointing impresario Giorgio Gomelsky to the group. ....\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jiftxqw5ldae~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jiftxqw5ldae~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nThe Animals' second British album, recorded just before Alan Price exited the lineup, displays far more energy and confidence than its predecessor, and it's fascinating to speculate where they might've gone had the original lineup held together. There are a few lightweight tunes here, such as &quot;Let the Good Times Roll&quot; and the rollicking opener, &quot;Mess Around,&quot; that capture the Animals loosening up and having fun, but much of Animal Tracks is pretty intense R&amp;B-based rock. &quot;How You've Changed&quot; is a reflective, downbeat Chuck Berry number that Eric Burdon turns into a dark romantic confessional/inquisition, matched by Hilton Valentine's chopped out, crunchy lead work over the break, while Alan Price does his best to impersonate Johnnie Johnson. The group doesn't do as well with their cover of Billy Boy Arnold's &quot;I Ain't Got You&quot; as the Yardbirds did with the same number, treating it in a little too upbeat a fashion, and Hilton Valentine and Alan Price failing to add very much that's interesting to the break (especially in comparison to Eric Clapton's solo on the Yardbirds' version). &quot;Roberta,&quot; by contrast, is a great rock &amp; roll number, and their version of &quot;Bright Lights, Big City,&quot; sparked by Burdon's surging, angry performance and Price's hard-driving organ solo. Price's playing opens what is easily the best blues cut on the album, &quot;Worried Life Blues,&quot; where Hilton Valentine steps out in front for his most prominent guitar solo in the early history of the band, backed by Price's surging organ. Burdon and company also excel on a pair of Ray Charles covers, turning in a jauntily cheerful, euphoric performance of &quot;Hallelujah I Love Her So,&quot; his jubilation matched by Price's ebullient organ work; and a slow, pain-racked performance by Burdon and company on the slow blues &quot;I Believe to My Soul,&quot; arguably -- along with &quot;Worried Life Blues&quot; -- the singer's best performance on either of the group's EMI long-players, and matched by Price's quick-fingered yet equally ominous piano playing. [The 1995 Japanese edition features nine bonus tracks.]\n\nTrack List:\n\n01. Don't Let Me Be Misunderstood\n02. Blue Feeling\n03. I Ain't Got You\n04. Bright Lights Big City\n05. Let The Good Times Roll\n06. For Miss Caulker\n07. Roadrunner\n08. Bring It On Home To Me\n09. Mess Around\n10. How You've Changed\n11. Hallelujah I Love Her So\n12. I Believe To My Soul\n13. Worried Life Blues\n14. Roberta\n15. Club A Go Go\n16. We're Gotta Get Out Of This Place\n17. I Can't Believe It\n18. It's My Life\n19. I'm Gonna Change The World\n\nMore album detail at: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:d9fpxzqgld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:d9fpxzqgld6e&lt;/a&gt;\n","torrent":{"xt":"urn:btih:35fd9354dd1a247946e38c565672188b89b27f60","amp;dn":"The+Animals+-+Animal+Tracks+%281965%29+%5BJapanese+Edition+1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35fd9354dd1a247946e38c565672188b89b27f60","infoHashBuffer":{"type":"Buffer","data":[53,253,147,84,221,26,36,121,70,227,140,86,86,114,24,139,137,178,127,96]},"announce":[],"urlList":[]}}