{"title":"AOP in .NET","uid":9651451,"size":9225548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:363e396f0181ce83d852a9c720ed06ea8f47d85d&amp;dn=AOP+in+.NET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"LFgroup","files":-1,"time":1393080974,"description":"Summary\n\nAOP in .NET introduces aspect-oriented programming to .NET developers and provides practical guidance on \nhow to get the most benefit from this technique in your everyday coding. The book's many examples concentrate \non modularizing non-functional requirements that often sprawl throughout object-oriented projects. Even if \nyou've never tried AOP before, you'll appreciate the straightforward introduction using familiar C#-based \nexamples. AOP tools for .NET have now reached the level of practical maturity Java developers have relied \non for many years, and you'll explore the leading options, PostSharp, and Castle DynamicProxy.\nABOUT THE TECHNOLOGY\n\nCore concerns that cut across all parts of your application, such as logging or authorization, are difficult\n to maintain independently. In aspect-oriented programming (AOP) you isolate these cross-cutting concerns \ninto their own classes, disentangling them from business logic. Mature AOP tools like PostSharp and Castle \nDynamicProxy now offer .NET developers the level of support Java coders have relied on for years.\nABOUT THIS BOOK:\n\nAOP in .NET introduces aspect-oriented programming and provides guidance on how to get the most practical \nbenefit from this technique. The book's many examples concentrate on modularizing non-functional requirements\n that often sprawl throughout object-oriented projects. You'll appreciate its straightforward introduction \nusing familiar C#-based examples.\n\nThis book requires no prior experience with AOP. Readers should know C# or another OO language.\nWhat's Inside\n\n    Clear and simple introduction to AOP\n    Maximum benefit with minimal theory\n    PostSharp and Castle DynamicProxy\n\nAbout the Author\n\nMatthew D. Groves is a developer with over ten years of professional experience working with C#, ASP.NET, \nJavaScript, and PHP.\n\nJune, 2013 | 296 pages\nISBN: 9781617291142\n\nIf you download this upload, please make sure you seed it till atleast 1:1 ratio. We all work very hard to get this stuff. Even a little help is greatly appreciated.","torrent":{"xt":"urn:btih:363e396f0181ce83d852a9c720ed06ea8f47d85d","amp;dn":"AOP+in+.NET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363e396f0181ce83d852a9c720ed06ea8f47d85d","infoHashBuffer":{"type":"Buffer","data":[54,62,57,111,1,129,206,131,216,82,169,199,32,237,6,234,143,71,216,93]},"announce":[],"urlList":[]}}