{"title":"Assassin's Creed Pirates Apk v1.2.1 NOMOD+ Mod [MAX Money]","uid":9837831,"size":968664004,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3648d0f9d05d4893ffb1ca626a47dada81c69cc6&amp;dn=Assassin%27s+Creed+Pirates+Apk+v1.2.1+NOMOD%2B+Mod+%5BMAX+Money%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1395942433,"description":"Transform into one of the most feared pirates of the Caribbean on this unique adventure Assassin's Creed smartphone or tablet!\n\nPlay as Alonzo Batilla, an ambitious young captain, a pirate looking forward to face the fiercest enemies ... Break all the rules, challenge empires and build your own fortune! CATCH NAVAL BATTLES BRUTAL Join naval battles in real time throughout the Caribbean Sea. Choose from a wide range of weapons to destroy the enemy and become a true legend among pirates! RIDE YOUR CREW AND HIS SHIP Get the most iconic ships from the Golden Age of Piracy, the lower the true gunboat floating fortresses as ships of the line Improve your vessel using the numerous remains of its clashes Recruit the best members for his crew and learn about 50 new hacking techniques to improve as captain and become the true master of naval combat. ENJOY 3D GRAPHICS IN REVOLUTIONARY YOUR MOBILE PHONE OR TABLET The constantly changing weather conditions have a direct impact on gameplay and redefine each landscape. Beware of treacherous storms and fog that hides the enemies to the last moment! Bask in the sun of the West Indies, admire the beautiful sunset and navigate the night by coastal breathtaking. EXPLORE THE CARIBBEAN IMMENSITY Browse countless islands while exploring a huge map of the Caribbean Enjoy over 50 primary and secondary missions, search for nearly a hundred treasures and Lost Scrolls and compete with friends by major withdrawals. BOARDING ON A EPIC ADVENTURE IN SEARCH OF A LEGENDARY TREASURE Experience an adventure that will reveal the truth about the mysterious lost treasure of La Buse. Cruze path of assassins and Templars and join this fight centennial . Meet the most notorious pirates and colorful era, as Sam Bellamy, Hornigold and Blackbeard Ben! game available in: English, French, Italian, German, Spanish, Portuguese (Brazil), Chinese, Japanese, Korean and Russian.","torrent":{"xt":"urn:btih:3648d0f9d05d4893ffb1ca626a47dada81c69cc6","amp;dn":"Assassin%27s+Creed+Pirates+Apk+v1.2.1+NOMOD%2B+Mod+%5BMAX+Money%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3648d0f9d05d4893ffb1ca626a47dada81c69cc6","infoHashBuffer":{"type":"Buffer","data":[54,72,208,249,208,93,72,147,255,177,202,98,106,71,218,218,129,198,156,198]},"announce":[],"urlList":[]}}