{"title":"Power Rangers: Mighty Morphin' S01 (Legacy Collection) (fixed)","uid":11734021,"size":21643226047,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36a84763ff5dca0ca5d6beca21c072aecdfa6e5f&amp;dn=Power+Rangers%3A+Mighty+Morphin%27+S01+%28Legacy+Collection%29+%28fixed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"CeraKesh","files":61,"time":1425489022,"description":"Rangers Forever! Earth's defenders never surrender!\n\nPrevious torrents have run into problems of my source files hashing differently and therefore can't be completed. I tried remaking it with some variations in piece size and now my local copy rechecks 100%. So please try this (it uses the same folder as the original but I'd HIGHLY recommend backing up your files from the original torrent just in case). If this works, I'll re-make torrents for the other files.\n\nThese are HQ rips from the Power Rangers Legacy Collection DVDs.\n\n \nMighty Morphin Power Rangers is a live-action television series adapted from the tokusatsu Super Sentai series Ky?ry? Sentai Zyuranger. The first season first aired on Fox Kids on August 28, 1993, and ended on May 23, 1994. Although it was a children's series, it became an iconic part of 1990s pop culture.\n\nLong ago, the ancient wizard Zordon did battle with the evil witch Rita Repulsa. After long years of battle, he managed to defeat her using five magical power coins. As punishment for her loss, she was sealed in a canister on the Earth's moon. However, before being sealed away, Rita trapped Zordon in a time warp.\n\n10,000 years later, Rita and her minions have escaped their prison and are out to conquer Earth. Zordon, desperate to stop her, has his assistant Alpha 5 recruit five &quot;teenagers with attitude&quot;: Jason, Trini, Kimberly, Zack, and Billy. Granted the powers of prehistoric animals in the form of Power Coins, they become the Mighty Morphin Power Rangers","torrent":{"xt":"urn:btih:36a84763ff5dca0ca5d6beca21c072aecdfa6e5f","amp;dn":"Power+Rangers%3A+Mighty+Morphin%27+S01+%28Legacy+Collection%29+%28fixed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36a84763ff5dca0ca5d6beca21c072aecdfa6e5f","infoHashBuffer":{"type":"Buffer","data":[54,168,71,99,255,93,202,12,165,214,190,202,33,192,114,174,205,250,110,95]},"announce":[],"urlList":[]}}