{"title":"One Hundred Victories: Special Ops and the Future of American Wa","uid":8965887,"size":3587701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36d385408d4ff67e40d897c23e32a2d766c4b716&amp;dn=One+Hundred+Victories%3A+Special+Ops+and+the+Future+of+American+Wa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1380220262,"description":"One Hundred Victories: Special Ops and the Future of American Warfare\nby Linda Robinson\n\nDESCRIPTION:\nBased on unique inside access and new on-the-ground reporting, the author of the New York Times bestseller Masters of Chaos and Notable Book of the Year, Tell Me How This Ends explains why the future of US military presence abroad belongs to the Special Forces: how that happened and what it means. In her previous books Linda Robinson combined vibrant on the ground reportage of the special forces in action at close quarters with a strategic understanding of their larger role in handling conflict, and how they were reshaping the US approach to war. Now, incorporating new reporting from the ground in Afghanistan and interviews with key players inside the national defense community, Robinson shows how the special forces are on the cusp of taking over the US combat role abroad and the challenges they will face as they become not merely the point of the spear but the whole damn shaft. She spent much of the last two years in Afghanistan to study their largest and longest deployment since Vietnam, living in mud-walled compounds in the mountains and deserts of the insurgent-dominated southern and eastern Afghanistan. She has had exclusive sustained access to the 5,000 special operators engaged in this country-wide initiative, which has raised an indigenous force of 17,000 civil defense police in 65 sites in over half of Afghanistan. They have also trained and mentored and conducted operations side by side with Afghan special operators. She has come under fire repeatedly as the small teams of special operators work with the villagers, Afghan commandos and Afghan special forces, as well as local tribal elders and officials, to try to wrest their lands away from Taliban control. The Afghan special operations forces, as in Colombia and Iraq and other countries, were raised by US SOF and will form the primary line of defense of the country when the US leaves in 2014. The intensive mentoring by US SOF has made them the most proficient element of the Afghan army, and the primary hope for the endgame. They are the only element conducting air-mobile operations, flying their own MI-17 helicopters. Special operators, who have been in Afghanistan since the first days of the war, have unique understanding of the country and deep relationships with its key figures at the national level and in the provinces, where the contest is decided. Robinson has interviewed serving special forces officers and their commanders. She shows the gritty reality of the challenges they undertake, and the constant danger in which they operate. In Afghanistan, the experience has been especially tough - SOF have had run-ins with the CIA, found themselves unsupported by the conventional forces, and under constantly shellfire from the Pakistanis across the border. The book will include many dramatic new accounts of the SOF in action.\n\nAmzon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/One-Hundred-Victories-Special-American/dp/1610391497&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/One-Hundred-Victories-Special-American/dp/1610391497&lt;/a&gt;","torrent":{"xt":"urn:btih:36d385408d4ff67e40d897c23e32a2d766c4b716","amp;dn":"One+Hundred+Victories%3A+Special+Ops+and+the+Future+of+American+Wa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d385408d4ff67e40d897c23e32a2d766c4b716","infoHashBuffer":{"type":"Buffer","data":[54,211,133,64,141,79,246,126,64,216,151,194,62,50,162,215,102,196,183,22]},"announce":[],"urlList":[]}}