{"title":"N.T. Wright - 2 Corinthians for Everyone (pdf)","uid":8254714,"size":2035455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:371a5e0e33cb7787bdc58ffefe90ef66e929fafd&amp;dn=N.T.+Wright+-+2+Corinthians+for+Everyone+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1363239204,"description":"Paul for Everyone: 2 Corinthians (Westminster John Knox Press, 2004).\n\nTwelfth in the series New Testament for Everyone; click my username to find other volumes in the series. Soon the whole series will be posted on tpb.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nBrief commentary on Paul's Second Letter to the Corinthians.\n\n\nMaking use of his scholar's understanding, yet writing in an approachable and anecdotal style, Tom Wright helps us to understand from the beginning of the second letter to the Corinthians that something unexplained yet terrible has happened. We feel the pain of Paul from the very opening lines as he confronts dreadful issues of sorrow and hurt, emerging with a clearer picture of what it meant to say that Jesus himself suffered for us and rose up in triumph. The letter itself moves through tragedy and from there leads into the sunlight.Tom Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion, with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nAbout the Author\n\nTom Wright is Research Professor of New Testament and Early Christianity at the University of St Andrews. He is a regular broadcaster on radio and television. Tom Wright is the author of over forty books, including the other For Everyone guides to the New Testament, the best-selling Simply Christian, Surprised by Hope, and Virtue Reborn; and the magisterial series entitled Christian Origins and the Question of God.","torrent":{"xt":"urn:btih:371a5e0e33cb7787bdc58ffefe90ef66e929fafd","amp;dn":"N.T.+Wright+-+2+Corinthians+for+Everyone+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"371a5e0e33cb7787bdc58ffefe90ef66e929fafd","infoHashBuffer":{"type":"Buffer","data":[55,26,94,14,51,203,119,135,189,197,143,254,254,144,239,102,233,41,250,253]},"announce":[],"urlList":[]}}