{"title":"Age of Context - Scoble &amp; Israel - Audible Audiobook MP3 CBR","uid":10176259,"size":174349853,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:376d1009837fbcb05b37a40442ba337b0b23a432&amp;dn=Age+of+Context+-+Scoble+%26amp%3B+Israel+-+Audible+Audiobook+MP3+CBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1400466729,"description":"MP3 CBR 64k Joint Stereo.\nThis will work best with dedicated audiobook reader apps.\n\n\nAge of Context: Mobile, Sensors, Data and the Future of Privacy\n\nWritten by: Robert Scoble, Shel Israel\nNarrated by: Jeffrey Kafer\nLength: 6 hrs and 2 mins \nFormat: Unabridged\nRelease Date:10-25-13\nProgram Type: Audiobook\n\nIn 2006, co-authors Robert Scoble and Shel Israel wrote Naked Conversations, a book that persuaded businesses to embrace what we now call social media. Six years later they have teamed up again to report that social media is but one of five converging forces that promise to change virtually every aspect of our lives. You know these other forces already: mobile, data, sensors and location-based technology. Combined with social media they form a new generation of personalized technology that knows us better than our closest friends. Armed with that knowledge our personal devices can anticipate what we'll need next and serve us better than a butler or an executive assistant. The resulting convergent superforce is so powerful that it is ushering in an era the authors call the Age of Context.\n\nIn this new era, our devices know when to wake us up early because it snowed last night; they contact the people we are supposed to meet with to warn them we're running late. They even find content worth watching on television. They also promise to cure cancer and make it harder for terrorists to do their damage. Astoundingly, in the coming age you may only receive ads you want to see. Scoble and Israel have spent more than a year researching this book. They report what they have learned from interviewing more than a hundred pioneers of the new technology and by examining hundreds of contextual products.\n\nWhat does it all mean? How will it change society in the future? The authors are unabashed tech enthusiasts, but as they write, an elephant sits in the living room of our book and it is called privacy. We are entering a time when our technology serves us best because it watches us; collecting data on what we do, who we speak with, what we look at. There is no doubt about it: Big Data is watching you. The time to lament the loss of privacy is over. The authors argue that the time is right to demand options that enable people to reclaim some portions of that privacy.\n","torrent":{"xt":"urn:btih:376d1009837fbcb05b37a40442ba337b0b23a432","amp;dn":"Age+of+Context+-+Scoble+%26amp%3B+Israel+-+Audible+Audiobook+MP3+CBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"376d1009837fbcb05b37a40442ba337b0b23a432","infoHashBuffer":{"type":"Buffer","data":[55,109,16,9,131,127,188,176,91,55,164,4,66,186,51,123,11,35,164,50]},"announce":[],"urlList":[]}}