{"title":"Invisible Giants: Fifty Americans Who Shaped the Nation but Miss","uid":11069185,"size":3823360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37f1174f204fdc960dc2de41d5630d4f96b69d36&amp;dn=Invisible+Giants%3A+Fifty+Americans+Who+Shaped+the+Nation+but+Miss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1411246531,"description":"Product Details\nHardcover: 336 pages\nPublisher: Oxford University Press (May 16, 2002)\nLanguage: English\nISBN-10: 0195154177\nISBN-13: 978-0195154177\n\n\nHistory records the accomplishments of individuals. For successive generations of Americans, iconic figures such as Abraham Lincoln, Susan B. Anthony, Thomas Edison, and Emily Dickinson have been household names and role models, inspiring us all by the lessons their lives teach us. But some great Americans, just as worthy, never attain this recognition. Because history is as fallible as the people who record it, many of those who shaped the nation and its future have receded from public memory. In celebration of these lives-and to demonstrate the lasting power history's giants have over their successors-Oxford University Press recently asked fifty accomplished personalities from a diverse range of industries and interests to each select a person from the 24-volume American National Biography that they felt deserved more attention. The biographies of these forgotten figures appear alongside the often-personal comments of their selectors in Invisible Giants, a varied and lively collection of portraits celebrating history's forgotten and fading heroes.\nIn Invisible Giants we discover the man who inspired Sherwin Nuland to become a doctor, the writer Jacques Barzun considers America's first cultural critic, and the woman who taught Tina Brown to bare her teeth. We learn of the poetry recited to Henry Louis Gates, Jr., as a boy, the magazine Helen Gurley Brown required every one of her editors to subscribe to, and the book Andy Rooney deems &quot;better than the Bible and easier to understand.&quot; Whether encountering these figures for the first time or uncovering surprising details in the lives you thought you knew, today's public thinkers guide us on a journey into the deep folds of our rich biographical tapestry.","torrent":{"xt":"urn:btih:37f1174f204fdc960dc2de41d5630d4f96b69d36","amp;dn":"Invisible+Giants%3A+Fifty+Americans+Who+Shaped+the+Nation+but+Miss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37f1174f204fdc960dc2de41d5630d4f96b69d36","infoHashBuffer":{"type":"Buffer","data":[55,241,23,79,32,79,220,150,13,194,222,65,213,99,13,79,150,182,157,54]},"announce":[],"urlList":[]}}