{"title":"A Spicy Secret - D. Savannah George","uid":11675654,"size":620738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:381750f3b35b8b215930c0fa7cdda8852e526043&amp;dn=A+Spicy+Secret+-+D.+Savannah+George&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1422854048,"description":"Alice MacFarlane is known far and wide for her baking skills, but her mojo has suddenly gone missing. It all started with the discovery of a jarful of recipes beneath the floor of the carriage house that she calls home. Alice, ever the adventurer, decides to give the recipes a try. The results have been mixed at best. The first dish was downright repulsive, and now Gwendolyn Palmer, one of Alice's friends from the Hook and Needle Club, is in the ICU -- and Alice can't help but believe that her latest dish from the mysterious recipes may be to blame. Alice's home shares a scenic hillside vista with Grey Gables, the stately Victorian home owned by Annie Dawson, Alice's best friend. Annie -- a transplant from Texas to Stony Point, Maine -- inherited Grey Gables from her late grandmother, Elizabeth Holden. Now Annie must help Alice find out where the recipes came from, and if there is some kind of dark secret associated with them. At the same time, the Hook and Needle Club has taken on a gargantuan task -- to provide handmade blankets for each resident of an orphanage in Haiti. The work must be completed in time for a mission trip led by Reverend Roy Wallace, pastor of the Stony Point Community Church. &quot;Blanket Haiti&quot; is one of the most ambitious projects undertaken by the club, known for its charitable works. But the project is complicated by the illness of Gwen -- and Alice's fear that she is somehow to blame. With the help of their Hook and Needle Club comrades, Alice and Annie set out to discover the truth behind the mysterious spicy secret","torrent":{"xt":"urn:btih:381750f3b35b8b215930c0fa7cdda8852e526043","amp;dn":"A+Spicy+Secret+-+D.+Savannah+George","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"381750f3b35b8b215930c0fa7cdda8852e526043","infoHashBuffer":{"type":"Buffer","data":[56,23,80,243,179,91,139,33,89,48,192,250,124,221,168,133,46,82,96,67]},"announce":[],"urlList":[]}}