{"title":"Gay - 21 Hump Street","uid":7700227,"size":511701074,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:390c468c55d0a41c9f30b16eb3b9fb2ff26be7bb&amp;dn=Gay+-+21+Hump+Street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Codex999","files":-1,"time":1349485074,"description":"21 Hump Street.flv\n488 GB\n\nSynopsis\n\n&quot;Their cover isn't the only thing getting blown tonight. Jet Set Men presents the hardcore gay parody 21 Hump Street. Riley Price and newcomer Jason Goodman deliver incredible lead performances as two undercover cops poised to infiltrate a local high school. Along the way the pair of muscle-bound sleuths accidentally trip on a new drug called &quot;HFS&quot; - aka &quot;Horny Fucking Shit&quot; - after scoring it off local hunky drug dealer Kris Jamieson.\n\nThe legendary Ron Jeremy, in a rare gay porn appearance, offers advice to the duo before hard dicks break out and Goodman unleashes a pounding on Price in the boys room. Hung Chief Steve Stiffer and ripped-bodied Captain Robert Axel are also players in the game of trying to uncover who is supplying Jamieson's &quot;HFS.&quot; Chief Stiffer shows off his abilities to suck his own cock during an investigation with Doug Acres, a cute young student who has reached the final phase of &quot;HFS&quot; known as The Homo-Blast, a wild phase that induces intense cock cravings. Price and Goodman hit the high school prom where they run across another legs-up situation that leads to Coach Bryce Star being taken down to the 21 Hump Street headquarters for a deep undercover investigation.&quot;\n\nTrailer\n\nCast:  Jason Goodman, Riley Price, Bryce Star, Doug Acre, Kris Jamieson, Robert Axel, Steve Stiffer\n\nDirector:  Chris Steele\n\nScreenwriter:  Chris Steele\n\nNon-Sexual:  Ron Jeremy ","torrent":{"xt":"urn:btih:390c468c55d0a41c9f30b16eb3b9fb2ff26be7bb","amp;dn":"Gay+-+21+Hump+Street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"390c468c55d0a41c9f30b16eb3b9fb2ff26be7bb","infoHashBuffer":{"type":"Buffer","data":[57,12,70,140,85,208,164,28,159,48,177,110,179,185,251,47,242,107,231,187]},"announce":[],"urlList":[]}}