{"title":"Drake feat. Trey Songz - Replacement Girl  (2nafish)","uid":5241863,"size":141776900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:39163fb8ce276fbe861fc2776e00d1f4670adcf2&amp;dn=Drake+feat.+Trey+Songz+-+Replacement+Girl++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1261802191,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Replacement Girl&quot; is the debut single from Drake's second mixtape, Comeback Season. It was produced by Boi-1da and T-Minus. The track features Drake's close friend Trey Songz. The song also appears in Trey Songz's mixtape, The Ladies Choice.\n\nThe music video was released on April 26, 2007 on BET as the &quot;Joint of the Day&quot; and Drake became the first unsigned Canadian rapper to have a video featured on BET.\n\nComeback Season is the second mixtape from Canadian rapper Drake. It was released on October 16, 2007.\n\nAubrey Drake Graham (born October 24, 1986) is a Canadian actor and recording artist. He originally became known for playing character Jimmy Brooks on the television series Degrassi: The Next Generation. As a rapper, he performs under the mononym Drake. Drake continued to recognize a close affiliation with Lil Wayne's Young Money Entertainment, before officially signing with the record label in June 2009. His first studio album, Thank Me Later, is expected to be released on the label sometime in 2010.\n\nIn February 2006, Drake released his first mixtape Room for Improvement. It was made available via his website and official MySpace page. From the success of his first mixtape, he later began releasing more, capitalizing from the buzz. In 2007, he released Comeback Season to much critical acclaim and praise. Which produced a single and a music video for Replacement Girl featuring Trey Songz. It also contained a freestyle over a song with Lil Wayne, a remix of the already popular song &quot;Man of the Year&quot; originally by Brisco and Flo-Rida. Also in 2007, Drake became the first unsigned Canadian rapper to have his music video featured on BET when his first single, &quot;Replacement Girl&quot; was featured as the &quot;New Joint of the Day&quot; on April 30, 2007. In 2008, Lil Wayne was given some of Drake's music from Rap-A-Lot founder, J. Prince's son and he called Drake immediately to fly to Houston to come and tour with him. Drake and Wayne had recorded a couple of songs during the time including, 'Ransom', The original version of 'I Want This Forever' and the remix to Drake's song, 'Brand New'. Although after becoming apart of Lil Wayne's crew, Young Money, Drake was still not signed.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:39163fb8ce276fbe861fc2776e00d1f4670adcf2","amp;dn":"Drake+feat.+Trey+Songz+-+Replacement+Girl++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39163fb8ce276fbe861fc2776e00d1f4670adcf2","infoHashBuffer":{"type":"Buffer","data":[57,22,63,184,206,39,111,190,134,31,194,119,110,0,209,244,103,10,220,242]},"announce":[],"urlList":[]}}