{"title":"Kristen Iversen - Full Body Burden: Growing Up in the Nuclear Sh","uid":8806913,"size":1667817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:398a2ff8c78c98adbb478e0d7e36d46e399c6148&amp;dn=Kristen+Iversen+-+Full+Body+Burden%3A+Growing+Up+in+the+Nuclear+Sh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Wazabbi","files":-1,"time":1376357699,"description":"Full Body Burden is a haunting work of narrative nonfiction about a young woman, Kristen Iversen, growing up in a small Colorado town close to Rocky Flats, a secret nuclear weapons plant once designated &quot;the most contaminated site in America.&quot; It's the story of a childhood and adolescence in the shadow of the Cold War, in a landscape at once startlingly beautiful and--unknown to those who lived there--tainted with invisible yet deadly particles of plutonium. \n\nIt's also a book about the destructive power of secrets--both family and government. Her father's hidden liquor bottles, the strange cancers in children in the neighborhood, the truth about what was made at Rocky Flats (cleaning supplies, her mother guessed)--best not to inquire too deeply into any of it. \n\nBut as Iversen grew older, she began to ask questions. She learned about the infamous 1969 Mother's Day fire, in which a few scraps of plutonium spontaneously ignited and--despite the desperate efforts of firefighters--came perilously close to a &quot;criticality,&quot; the deadly blue flash that signals a nuclear chain reaction. Intense heat and radiation almost melted the roof, which nearly resulted in an explosion that would have had devastating consequences for the entire Denver metro area. Yet the only mention of the fire was on page 28 of the Rocky Mountain News, underneath a photo of the Pet of the Week. In her early thirties, Iversen even worked at Rocky Flats for a time, typing up memos in which accidents were always called &quot;incidents.&quot;\n\nAnd as this memoir unfolds, it reveals itself as a brilliant work of investigative journalism--a detailed and shocking account of the government's sustained attempt to conceal the effects of the toxic and radioactive waste released by Rocky Flats, and of local residents' vain attempts to seek justice in court. Here, too, are vivid portraits of former Rocky Flats workers--from the healthy, who regard their work at the plant with pride and patriotism, to the ill or dying, who battle for compensation for cancers they got on the job. \n\nBased on extensive interviews, FBI and EPA documents, and class-action testimony, this taut, beautifully written book promises to have a very long half-life.\n\n","torrent":{"xt":"urn:btih:398a2ff8c78c98adbb478e0d7e36d46e399c6148","amp;dn":"Kristen+Iversen+-+Full+Body+Burden%3A+Growing+Up+in+the+Nuclear+Sh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"398a2ff8c78c98adbb478e0d7e36d46e399c6148","infoHashBuffer":{"type":"Buffer","data":[57,138,47,248,199,140,152,173,187,71,142,13,126,54,212,110,57,156,97,72]},"announce":[],"urlList":[]}}