{"title":"Noche en el museo.[HDRip-XviD.AC3.]","uid":4914950,"size":2570874242,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a2840bf7d34ac7acb3425aa46b3b0e4f05d8f88&amp;dn=Noche+en+el+museo.%5BHDRip-XviD.AC3.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1243376016,"description":"DirecciÃƒÂ³n: Shawn Levy.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2006.\nDuraciÃƒÂ³n: 108 min.\nGÃƒÂ©nero: Comedia, acciÃƒÂ³n.\nInterpretaciÃƒÂ³n: Ben Stiller (Larry Daley), Carla Gugino (Rebecca), Dick van Dyke (Cecil Fredricks), Mickey Rooney (Gus), Bill Cobbs (Reginald), Robin Williams (Teddy Roosevelt), Jake Cherry (Nick), Ricky Gervais (Dr. McPhee), Kim Raver (Erica Daley), Patrick Gallagher (Atila), Rami Malek (Ahkmenrah), Steve Coogan (Octavio), Anne Meara (Debbie).\nGuiÃƒÂ³n: Robert Ben Garant y Thomas Lennon; basado en el libro de Milan Trenc.\nProducciÃƒÂ³n: Shawn Levy, Chris Columbus y Michael Barnathan.\nMÃƒÂºsica: Alan Silvestri.\nFotografÃƒÂ­a: Guillermo Navarro.\nMontaje: Don Zimmerman.\nDiseÃƒÂ±o de producciÃƒÂ³n: Claude ParÃƒÂ©.\nVestuario: RenÃƒÂ©e April.\nEstreno en USA: 22 Diciembre 2006.\nEstreno en EspaÃƒÂ±a: 26 Enero 2007.\n\nSINOPSIS\n\nEl eterno soÃƒÂ±ador Larry Daley (Ben Stiller), a pesar de no contar a menudo con la suerte a su favor, estÃƒÂ¡ convencido de estar predestinado a hacer algo grande. Pero nunca pensÃƒÂ³ en algo tan &quot;grande&quot; cuando aceptÃƒÂ³ lo que parecÃƒÂ­a ser un sencillo trabajo como guarda de seguridad nocturno del Museo de Historia Natural de Nueva York. Durante la vigilancia de Larry empiezan a suceder cosas extraordinarias: mayas, gladiadores romanos y cowboys salen de sus exposiciones para participar en batallas ÃƒÂ©picas; en su bÃƒÂºsqueda del fuego, un neandertal prende fuego a su propia exposiciÃƒÂ³n; Atila el huno se dedica a saquear las exposiciones vecinas, mientras que el tyrannosaurus rex se encarga de recordar a todo el mundo por quÃƒÂ© es considerado el depredador mÃƒÂ¡s fiero de la Historia. Entre todo este caos, la ÃƒÂºnica persona que puede ayudar a Larry es la figura de cera del presidente Teddy Roosevelt (Robin Williams), quien intenta que nuestro hÃƒÂ©roe pueda tener todo bajo control lo antes posible, parar una trama vil y salvar el museo.","torrent":{"xt":"urn:btih:3a2840bf7d34ac7acb3425aa46b3b0e4f05d8f88","amp;dn":"Noche+en+el+museo.%5BHDRip-XviD.AC3.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a2840bf7d34ac7acb3425aa46b3b0e4f05d8f88","infoHashBuffer":{"type":"Buffer","data":[58,40,64,191,125,52,172,122,203,52,37,170,70,179,176,228,240,93,143,136]},"announce":[],"urlList":[]}}