{"title":"All Summer Long - {CHB Books}","uid":14995462,"size":1191435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a79e96ff5ccbaf83534e47c06cf6eb7cf52ac6f&amp;dn=All+Summer+Long+-+%7BCHB+Books%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rahul8826","files":2,"time":1466350551,"description":"Author: Dorothea Benton Frank \r\nHardcover: 384 pages\r\nPublisher: William Morrow (May 31, 2016)\r\nLanguage: English\r\nISBN-10: 0062390759\r\nISBN-13: 978-0062390752\r\n\r\n\r\n\r\nDorothea Benton Frank novels are filled with smart and witty fiction that every reader wants on their bookshelf: soulful, edgy stories about realistic characters familiar to us all that explore the most deeply felt moments of life with wry humor and heart.\r\nAll Summer Long follows one charming New York couple – prominent interior designer Olivia Ritchie and her husband Nicholas Seymour, an English professor and true southern gentleman. They are seemingly polar opposites, yet magnetically drawn together and in love for more than fourteen years.\r\nAs they prepare to relocate to Charleston, S.C., Olivia, the ultimate New Yorker, has reservations about the promise she made to retire in the Lowcountry, where Nick wants to return home and lead a more peaceful life. They are moving north to south, fast pace versus slow pace and downsizing. Nick is ecstatic. Olivia is not. She can’t let Nick know that their finances are not what he thought. Her client list is evaporating, their monetary reserves are dwindling and maybe that house she picked out on Sullivans Island needs too much work. Thank God, for her assistant, Roni Larini, her right (and sometimes left) hand. \r\nAs they find themselves pondering the next step of their lives, Olivia and Nick travel with her billionaire clients and their friends and are swept up into the world of the ultra-rich and explore the globe with a cast of zany eccentrics over one tumultuous, hot summer. All as Olivia grapples with what lies ahead for her and Nick.\r\nThis is a story of how plans evolve and lives change in unexpected ways, how even those who have everything are still looking for something more. Even the most successful people can often struggle to keep things together. All Summer Long asks the ultimate question: can money buy happiness? From Sullivans Island to Necker Island to Nantucket to the beaches of Southern Spain, we’ll come to recognize the many faces of true love, love that deepens and endures but only because one woman makes a tremendous leap of faith. And that leap","torrent":{"xt":"urn:btih:3a79e96ff5ccbaf83534e47c06cf6eb7cf52ac6f","amp;dn":"All+Summer+Long+-+%7BCHB+Books%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a79e96ff5ccbaf83534e47c06cf6eb7cf52ac6f","infoHashBuffer":{"type":"Buffer","data":[58,121,233,111,245,204,186,248,53,52,228,124,6,207,110,183,207,82,172,111]},"announce":[],"urlList":[]}}