{"title":"Coast to Coast AM January 20 2013","uid":8048644,"size":57777212,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3ad7428cec66d498ed01081e6d7f46364b1db00b&amp;dn=Coast+to+Coast+AM+January+20+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1358807258,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-20-13\nHost: \tGeorge Knapp\nGuests: \tRay Waru, Geoff Notkin\n\nJoining George Knapp, New Zealand broadcaster and author, Ray Waru (book link), discussed intriguing stories from New Zealand archives. He was given access to thousands of boxes that included records of secret tsunami-causing weapons, grisly exhibits from murder trials, and famous UFO sightings. Waru uncovered documents about 'Project Seal,' a joint US-New Zealand effort begun in 1944 to potentially create huge tsunami or tidal waves that could damage coastal cities or military sites. A US naval officer named Gibson came up with the idea when he noticed that unexpectedly large waves were produced when using explosions to clear coral reefs for military installations.\n\nSome 4,000 experimental explosions were conducted off New Caledonia island, and while the tests showed promise using an array of explosions near the surface, its use as a tsunami weapon was shelved after the nuclear attacks on Japan, he recounted, suggested that the procedure had likely been developed for potential use against Japan during WWII. Waru delved into documents about UFO sightings in New Zealand that dated as far back as 1909, when a kind mystery &quot;airship&quot; described as a long black object was repeatedly seen. The pilot/adventurer Francis Chichester, who conducted the first solo flight between New Zealand and Australia in 1931, told of an encounter with a &quot;dull grey-white airship&quot; that almost collided with him during the flight.\n\nWaru detailed the 1978 Kaikoura Lights sightings, in which pilots saw unexplained lights that seemed to move around their aircraft, and the objects were tracked by Wellington radar. Subsequently, a TV crew took the same route as the original flight, and saw and captured the mysterious lights on film, he reported. He also spoke about viewing a letter written by the great 18th century navigator Capt. James Cook, the treatment of the Maori in New Zealand, and a dolphin that guided ships in a stretch of water between two islands.\nMeteorite Hunting\n\nFirst hour guest, star of the Science Channel's Meteorite Men, Geoff Notkin, discussed his adventures in search of rare and valuable space rocks, and why they're so interesting to scientists. Meteorites enable us to study the make-up of other bodies in the solar system, and are like &quot;snapshots&quot; of how our solar system formed, he explained. He talked about what he called &quot;meteor wrongs,&quot; objects that he pulled out of the ground while hunting, such as frontier era tools, and Civil War objects. He also offered tips for the layperson in how to get involved in meteorite hunting.\nWebsite(s):\n\n    notkin.net\n\nBook(s):\n\n    Secrets and Treasures\n    Rock Star: Adventures of a Meteorite Man\n    Meteorite Hunting\n\n","torrent":{"xt":"urn:btih:3ad7428cec66d498ed01081e6d7f46364b1db00b","amp;dn":"Coast+to+Coast+AM+January+20+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ad7428cec66d498ed01081e6d7f46364b1db00b","infoHashBuffer":{"type":"Buffer","data":[58,215,66,140,236,102,212,152,237,1,8,30,109,127,70,54,75,29,176,11]},"announce":[],"urlList":[]}}