{"title":"1963 - ALAN MOORE","uid":4002304,"size":50565879,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3b830d0b8467f1ef896e568bd68c7ace093a4127&amp;dn=1963+-+ALAN+MOORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mirrorspocks","files":8,"time":1201635782,"description":"1963 is a 6 issue comic book limited series written by Alan Moore in 1993. The six issues hark back to the Silver Age of American comics (in particular, the early Marvel Comics).\n\nIssue one introduced Mystery Incorporated, a Fantastic Four surrogate.\n\nIssue two, No-one Escapes the Fury, featured The Fury, based on Spider-Man, as well as Sky Solo, Lady of L.A.S.E.R., a female version of Nick Fury, agent of S.H.I.E.L.D..\n\nIssue three, an anthology comic called Tales of the Uncanny, featured USA, Ultimate Special Agent based on Captain America, and Hypernaut, who was based on Iron Man, with elements taken from Silver Surfer, Green Lantern and Swamp Thing\n\nIssue four, another anthology comic called Tales From Beyond, introduces readers to N-Man, based on The Incredible Hulk, and Johnny Beyond, a beatnik version of Dr. Strange.\n\nIssue five was devoted to Horus, Lord of Light, based on The Mighty Thor.\n\nIssue six told the story of the Tomorrow Syndicate, based on the Avengers. This comic brought back Horus, Lord of Light, Hypernaut, N-Man, and USA, and also introduced Infra-Man, based on Henry Pym, and Infra-Girl, based on Janet Van Dyne.\n\nALL HAIL THE ORIGINAL SCANNERS!","torrent":{"xt":"urn:btih:3b830d0b8467f1ef896e568bd68c7ace093a4127","amp;dn":"1963+-+ALAN+MOORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b830d0b8467f1ef896e568bd68c7ace093a4127","infoHashBuffer":{"type":"Buffer","data":[59,131,13,11,132,103,241,239,137,110,86,139,214,140,122,206,9,58,65,39]},"announce":[],"urlList":[]}}