{"title":"Confessions Of A Transsexual Porn Star","uid":8086017,"size":5193352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c870b122ff1da7db7453adb8f66a171d5b74cd0&amp;dn=Confessions+Of+A+Transsexual+Porn+Star&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1359621109,"description":"This is the true story of transsexual adult film superstar Meghan Chavalier as told by Meghan herself. Meghan will take you through her years as a stage performer, a dancer, and ultimately how she became the most famous transsexual adult film star in the world. It hasn't all been all fame and fortune, in fact, Meghan will walk you through the tumultuous steps in her life, growing up with an alcoholic abusive father, drug abuse, prostitution, the adult film industry, the failed relationships, the love she finally found that changed her life and a lifelong struggle with Bipolar Disorder and Manic Depression. You'll finally learn everything you wanted to know about Meghan Chavalier including. *The transsexual film industries ups and downs *The truth about two of Hollywood's most famous male celebrities. *What really goes on behind closed doors in those strip clubs in New Orleans, Louisiana. *Drugs, sex, prostitution, legal trouble and married men *The nervous breakdown that almost destroyed her life Confessions of a Transsexual Porn Star will bring you into the life of Meghan Chavalier and show you how a small town kid went on to become a world famous transsexual star.","torrent":{"xt":"urn:btih:3c870b122ff1da7db7453adb8f66a171d5b74cd0","amp;dn":"Confessions+Of+A+Transsexual+Porn+Star","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c870b122ff1da7db7453adb8f66a171d5b74cd0","infoHashBuffer":{"type":"Buffer","data":[60,135,11,18,47,241,218,125,183,69,58,219,143,102,161,113,213,183,76,208]},"announce":[],"urlList":[]}}