{"title":"Philippines Anal Teeny Sucks Shyte Off Shaft","uid":12061954,"size":703277009,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3cca786a01592f23d2e486213c82915cf8a84946&amp;dn=Philippines+Anal+Teeny+Sucks+Shyte+Off+Shaft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sarah.jensen","files":1,"time":1435291242,"description":"Aye aye, Sailor is back and locked in stocks getting sperm penetrated at both ends of her intestines. Her suction deep throat cleans off all yellow smears that might have accumulated on my cock after being up her bugger hole. There is no shyte up there, none at all. Merely semen. From countless foreigners who have all buggered her, or shoved their entire heads up her supple anus. Anyone who is not Asian can quite easily fuck Sailor's ass. If they do not have to queue up. Pretty much everyone has. The hotel where she plies her trade loves her, as their hotel is always full. Better than fucking room service. She will just get on all fours on a bed as the room maid finished making up the suite for a new customer. She will stay there doggy style with her ass up in the air as the new customer enters the room. She won't even look round to see their face, just as long a penis enters her. Just as long as the penis ejaculates more life giving sperm into her. Then she will clean it off with a vacuum gobble, smile and ask for more. If she don't get more, she will hold her hand out for money, quickly, so she can go off and find another cock. Ten guys a day is nothing for Sailor. And they should all come more than once. How many is that in a week? More than a hundred. Since she first dropped her little knickers, Sailor has pleasantly received several hundred thousand ejaculations, mostly up her ass hole. If you think that you have ever been with a girl that truly enjoyed sex, you have never even started with Sailor. Get your own cock up the rectum that has enjoyed in high definition, half the world","torrent":{"xt":"urn:btih:3cca786a01592f23d2e486213c82915cf8a84946","amp;dn":"Philippines+Anal+Teeny+Sucks+Shyte+Off+Shaft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cca786a01592f23d2e486213c82915cf8a84946","infoHashBuffer":{"type":"Buffer","data":[60,202,120,106,1,89,47,35,210,228,134,33,60,130,145,92,248,168,73,70]},"announce":[],"urlList":[]}}