{"title":"Scott Fields Ensemble - Samuel (2009)","uid":14237699,"size":351057255,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d5152029b597376352783c89eab935bbcc67bb7&amp;dn=Scott+Fields+Ensemble+-+Samuel+%282009%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":7,"time":1460109538,"description":"New World Records: 80695-2 \nhttp://www.newworldrecords.org/album.cgi?rm=view&amp;album_id=82787\r\n\r\n* Scott Fields: electric guitar\r\n* Matthias Schubert: tenor saxophone\r\n* Scott Roller: cello\r\n* John Hollenbeck: percussion\r\n \nhttp://www.scottfields.com/ \nhttp://de.wikipedia.org/wiki/Matthias_Schubert \nhttp://www.scottroller.de/ \nhttp://www.johnhollenbeck.com/\r\n\r\nRecorded by Reinhard Kobialka at Topaz Studio on January 23 and 24, 2009.\r\n\r\nSamuel Beckett\r\n~~~~~~~~~~~~~~ \nhttp://en.wikipedia.org/wiki/Samuel_Beckett \nhttp://fr.wikipedia.org/wiki/Samuel_Beckett \nhttp://de.wikipedia.org/wiki/Samuel_Beckett \nhttp://es.wikipedia.org/wiki/Samuel_Beckett\r\n\r\n\r\nReviews\r\n~~~~~~~\r\n\r\nBy Bill Shoemaker \nhttp://www.pointofdeparture.org/PoD24/PoD24MoreMoments3.html\r\n\r\nScott Fields’ music prompts questions, usually quickly: Where’s the line\r\nbetween the bold conceptions and the meticulous execution? Between the composer\r\nand the improviser? Between the jazz and what’s beyond category? Much to the\r\nguitarist’s credit, the answers are almost always elusive, as is the case with\r\nSamuel, Fields’ second collection of compositions drawn from the texts of\r\nSamuel Beckett. Given that, as measured in discographical time, the album comes\r\non the heels of Beckett – the 2006 Clean Feed collection also featuring Fields’\r\nquartet with tenor saxophonist Matthias Schubert, cellist Scott Roller and\r\npercussionist John Hollenbeck – spinning this more innocuously titled album\r\nwithout making the connection is not surprising. The music is sufficiently\r\ncompelling to initially keep the booklet with Dan Warburton’s informative notes\r\noff to the side. The quartet has an incisive bead on the material; their\r\nensembles are bristling; and their ability to sustain the finely calibrated\r\ndevelopment of the materials in three contrasting pieces of 20 to 25 minutes in\r\nduration reflects an exemplary, collectively honed discipline. Sure, knowing\r\nFields painstakingly ascribed pitch and duration values to Beckett’s texts\r\nfacilitates a fuller reception of the work; yet, it is not required to dig the\r\njagged and jangling materials. It certainly explains the ensemble’s aversion to\r\nlustrous decay; in conveying the bluntness of expression fundamental to\r\nBeckett’s texts, their dampened attack and clipped phrases establishes a\r\ntemperamental continuity that is as essential to the music as adherence to the\r\nscores and the parameters for improvisation. This tints materials that would\r\notherwise be more easily compared to the graying generation of Midwestern\r\nstructuralist composers (although Fields has lived in Cologne since 2003,\r\nChicago is still discernable in his music). Still, the ensemble’s\r\nfastidiousness in articulating Fields’ compositions does not diminish the\r\nindividualism of the players; on the contrary, these are among the more\r\nengaging performances to date by Fields himself and by Schubert and Hollenbeck,\r\nthe more widely documented of his cohorts (the guitarist-like dexterity of\r\nRoller’s pizzicato always prompts a desire to hear more). This is another\r\nsignificant recording by Fields.\r\n\r\n--\r\n\r\nScott Fields \nhttp://www.scottfields.com/samuel.html\r\n\r\nBy François Couture \nhttp://www.allmusic.com/album/samuel-mw0000822807\r\n\r\nBy Troy Collins \nhttp://www.allaboutjazz.com/samuel-scott-fields-new-world-records-review-by-troy-collins.php","torrent":{"xt":"urn:btih:3d5152029b597376352783c89eab935bbcc67bb7","amp;dn":"Scott+Fields+Ensemble+-+Samuel+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d5152029b597376352783c89eab935bbcc67bb7","infoHashBuffer":{"type":"Buffer","data":[61,81,82,2,155,89,115,118,53,39,131,200,158,171,147,91,188,198,123,183]},"announce":[],"urlList":[]}}