{"title":"Fritz Lang - While the City Sleeps (1956)","uid":4934140,"size":734367632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3db525827fafe4c6259a6de10ac9d1e5a3c15ee3&amp;dn=Fritz+Lang+-+While+the+City+Sleeps+%281956%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lllTgolll","files":4,"time":1244171076,"description":"Fritz Lang - While the City Sleeps (1956)\n\n[img]http://image.allmusic.com/00/avg/cov200/drv200/v202/v20219hvvsi.jpg[/img]\n\nA serial killer is terrorizing the women of New York. In the midst of an internal power struggle, a newspaper gets closer and closer to the story.\n\nReview (All Movie Guide)\n--\nWhile the City Sleeps (1954) was Fritz Lang's last fully successful film, one of a pair of movies that he made with independent producer Bert E. Friedlob (the other was Beyond a Reasonable Doubt). Additionally, it has proved to be one of his more enduring successes over the decades, due to the combination of its virtues as a thriller and also as a snapshot of American mores circa 1954. It may not be as respected as, say, M (1931) or Fury (1936), but it might be the Lang film that Americans of the baby-boom generation know best, through countless television showings in the 1960s and '70s, and like most for its sinister subtext. Strangely enough, While the City Sleeps was not a story that Lang that set out to tell -- producer Bert E. Friedlob rejected several of the director's proposed subjects and imposed the story on Lang, as he had already bought the rights to Charles Einstein's novel The Bloody Spur. That book was based on the criminal career of William Heirens, who had terrorized that city with a string of burglaries, sexual assaults, and murders during the mid-'40s. Heirens was identified as the &quot;Lipstick Killer&quot; when he left a message, scrawled in lipstick, at one of his crime scenes, asking the police to stop him. He was later caught, and he confessed and was given a life sentence (which he was still serving as of 2003).\n\nLang jumped into this project with more enthusiasm than he had historically shown for subjects imposed from outside, primarily because he was familiar with the case and had followed it himself from newspaper articles in the mid-'40s. He made several important changes from the original story, shifting the setting from Chicago to a vaguely accurate (for the period) New York City, and moving it up to the early '50s, which allowed him to add elements of popular culture and cultural reality that were far more relevant to (and evocative of) 1954 than they would have been to 1946. The most notable of these were the intrusion of television into the news media, and the supposed corrupting influence of comic books on young readers, which is referred to as part of the killer's sickness. Lang also had fun with the casting, using actors with genuine talent and varying degrees of quirky flashiness into the leading roles; he was forced to tone down some of the more hardboiled sexuality in Einstein's book -- there were no musings by Dana Andrews' Ed Mobley about having sex with Ida Lupino's Mildred Donner here, but there was everything else but. Lang replaced the overt sexuality with a strangely neurotic coyness -- the script spends a lot of time dancing around sexuality, in connection with Ed Mobley and his fiancÃƒÂ©e (Sally Forrest), conniving Harrry Kritzer (James Craig) and Mrs. Kyne (Rhonda Fleming), and slutty Mildred Donner in connection with just about everyone.\n\nThe picture moves a little slowly at times for some modern viewers, and may seem too conventional by modern standards, but it's a major Lang film just the same, winding its tensions and its just-short-of-bizarre neuroses agonizingly tight across 100 minutes of screen time, and telling some truths about that period in America in the process. In the latter connection, it's a fascinating popular culture document, bringing to the fore the various sexual hypocrisies of the '50s and some aspects of American business that were still being debated 50 years later -- While the City Sleeps was one of the earliest screenplays to hook its plot around the idea and setting of the modern media conglomerate. In the end, the Lipstick Killer is almost more a pawn (though hardly an &quot;innocent&quot; one) being manipulated in the larger game of corporate one-upmanship being played by the competing executives, whose near-total amorality has them treating his crimes as a commodity rather than an abomination. Thus, the movie has been given very much of a dual edge to cut with, a sinister crime thriller that is also a searing and engrossing social commentary, and nearly as vicious in that mode as Lang's earlier, ultra-cynical classic The Blue Gardenia. -- Bruce Eder\n\nScreens\n\n[img]http://i267.photobucket.com/albums/ii297/vicenteribeiro/while_the_city_1.jpg[/img]\n[img]http://i267.photobucket.com/albums/ii297/vicenteribeiro/while_the_city_2.jpg[/img]\n[img]http://i267.photobucket.com/albums/ii297/vicenteribeiro/while_the_city_3.jpg[/img]\n[img]http://i267.photobucket.com/albums/ii297/vicenteribeiro/while_the_city_4.jpg[/img]\n\nRip Specs\n\nFile Name .............: Fritz.Lang.While.the.City.Sleeps.TVRip.XviD.Mp3.MKO\nFile Size (in bytes) ..: 734,027,776 bytes\nRuntime (# of frames) .: 01:39:36 (143277 frames)\n\nVideo Codec ...........: XviD\nFrame Size ............: 576x432 (1.33:1) [=4:3]\nFPS ...................: 23.976 FPS\nVideo Bitrate .........: 898 kb/s\nBits per Pixel ........: 0.151 bpp\nAutoGK Quality ........: 94.27\nB-VOP, QPel, GMC ......: [B-VOP]...[]...[]\n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 80 kb/s [1 channel(s)] CBR audio\nInterleave ............: 83 ms\nNo. of audio streams ..: 1\n\nSubtitles .............: English .srt [Captions]\n\nSource ................: Dig Cab -&gt; ReplayTV DVR -&gt; AutoGK XviD (IVTC'd)\nRipped by .............: rentboy \n\n*********************************** FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:3db525827fafe4c6259a6de10ac9d1e5a3c15ee3","amp;dn":"Fritz+Lang+-+While+the+City+Sleeps+%281956%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db525827fafe4c6259a6de10ac9d1e5a3c15ee3","infoHashBuffer":{"type":"Buffer","data":[61,181,37,130,127,175,228,198,37,154,109,225,10,201,209,229,163,193,94,227]},"announce":[],"urlList":[]}}