{"title":"Xilisoft YouTube Video Converter 3.3.3","uid":7714050,"size":23240522,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3e35bf2c1e3cbf6b38cfb7cc86cc128ef12f5ed3&amp;dn=Xilisoft+YouTube+Video+Converter+3.3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1349884467,"description":"Xilisoft YouTube Video Converter is a powerful YouTube video downloader &amp; YouTube video converter to download YouTube video fromand convert YouTube video to AVI, MPEG, MP4, 3GP, DivX, XviD. With Xilisoft YouTube Video Converter, you can easily download and convert YouTube videos, and play them on your PSP, iPod, iPhone, Apple TV, Zune, mobile phone, etc.\n\nKey features:\nÂ» Support downloading YouTube videos by the proxy server set in the program itself.\nÂ» Provide lots of classified profiles with all the parameters optimized for different multimedia devices.\nÂ» The built-in browser lists YouTube videos by categories and allows you to search for videos.\nÂ» Allow you to browse YouTube videos in IE, and directly download and convert YouTube videos from IE right-click menu.\nÂ» Adjust resolution, video quality, audio quality, channel and more parameters for customization.\nÂ» Allow you to view tasks in table or icon list, and sort them by file size, name, output format, output path and task status.\nÂ» As a YouTube video downloader + converter, it provides the highest speed to download and convert YouTube videos.\nÂ» Support &quot;Drag and Drop&quot; FLV video files to the main window and directly convert FLV files to AVI, MP4, etc.\nÂ» Show file info like bit rate, frame rate and sample rate, and rename the downloaded YouTube video file.\nÂ» Provide several after done actions: shut down, hibernate, stand by, and quit.\n\n- run app\n- insert serial","torrent":{"xt":"urn:btih:3e35bf2c1e3cbf6b38cfb7cc86cc128ef12f5ed3","amp;dn":"Xilisoft+YouTube+Video+Converter+3.3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e35bf2c1e3cbf6b38cfb7cc86cc128ef12f5ed3","infoHashBuffer":{"type":"Buffer","data":[62,53,191,44,30,60,191,107,56,207,183,204,134,204,18,142,241,47,94,211]},"announce":[],"urlList":[]}}