{"title":"World Sex Tour 24: Canada [DVDRip]","uid":8438011,"size":734036001,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3f919252adf554ce75aa8db0b1571970f6a19012&amp;dn=World+Sex+Tour+24%3A+Canada+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":2,"time":1367691020,"description":"World Sex Tour 24: Canada [DVDRip]\n\nCAST\nAngel, Bobby Vitale, Daisy Fox, Erik Everhard, Jon Dough, Judy Starr, Lanny Barbie, Lexington Steele, Naomi\n\nWorld Sex Tour 24: NAOMIE is an incredibly sexy trim 20 year old Canadian. She shocked the hell out of us by taking Lexington Steele balls deep in her ass, during this, her 1st time ever adult movie adventure! (We scored her a perfect 10)\n\nDAISY FOX- Anal, Double-Vaginal, Double-Penetration with Bobby Vitale &amp; Erik Everhard, what more need we say?\n\nLittle 19 year old JUDY STAR is possibly the hottest 5-foot tall firecracker we've ever met. In this scene she shows Erik and Jon Dough that it's possible for Lesbians to appreciate hard cock just as much as their hetro sisters!\n\nLANNY BARBIE makes her screen debut just 2 weeks after giving birth! Oh what a girl!\n\nELSA BANGZ is definitely a sex monster! (With a sorid past) This girl deep throats, eats ass, fucks, and sucks and is basically just an insatiable fuck machine! She is ready, willing and able to do pretty much whatever is asked of her (we admire that in a woman) While sexing our four studs she gets double penetrated and also does double vagina!! Eventually she gets the hot jizz she has been thirsty for! Her ample ass, big breasts, and sexy smile put her at the top of most every sex-fiends wish list!\n\n19 year old ANGEL was the first scene we shot in Canada, we were overjoyed, we got to take her Video cherry, and deflower her Ass-hole as well!! This young lady is one hot, horny, honey! \n\nThese girls are great, I hope you enjoy watching our sexy Northern neighbors as much as I enjoyed shooting them! Special thanks to the entire Anabolic team for enduring crowded rooms and chilly temperatures, just to bring our viewers awesome erotic entertainment! \n\nStarring: Angel, Naomie, Judy Starr, Daisy Fox, Elsa Bangz, Lanny Barbie, Bobby Vitale, Jon Dough, Erik Everhard, Lexington Steele\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=67yaqjxg1uj7q5yogllh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=67yaqjxg1uj7q5yogllh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=ozeovlmbs78r0sjoqviv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=ozeovlmbs78r0sjoqviv.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3f919252adf554ce75aa8db0b1571970f6a19012","amp;dn":"World+Sex+Tour+24%3A+Canada+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f919252adf554ce75aa8db0b1571970f6a19012","infoHashBuffer":{"type":"Buffer","data":[63,145,146,82,173,245,84,206,117,170,141,176,177,87,25,112,246,161,144,18]},"announce":[],"urlList":[]}}