{"title":"Lou Bega - A Little Bit of Mambo","uid":6610433,"size":341851322,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3fce02aa62cc799a42c830eef48415669ada9c6f&amp;dn=Lou+Bega+-+A+Little+Bit+of+Mambo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1313569887,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51pfIVOcaPL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51pfIVOcaPL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: A Little Bit of Mambo\nArtist: Lou Bega\nAudio CD (August 24, 1999)\nOriginal Release Date: August 24, 1999\nNumber of Discs: 1\nGenre: Mambo\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Mambo No. 5 (a Little Bit of...)\n02. Baby Keep Smiling\n03. Lou's CafÃƒÂ©\n04. Can I Tico Tico You\n05. I Got a Girl\n06. Tricky, Tricky\n07. Icecream\n08. Beauty On the TV-Screen\n09. 1+1=2\n10. The Most Expensive Girl In the World\n11. The Trumpet Part II\n12. Behind Stage\n13. Mambo Mambo\n\n\nAmazon Review:\nWhat sounds like an early-model Casio playing &quot;Wake Me Up Before You Go Go&quot; quickly gives way to a classic Perez Prado riff. On top of it all, Lou Bega--born in Germany to a Ugandan father and Italian mother--hoarsely exhorts the floor to &quot;Mambo No. 5.&quot; A runaway hit in more than a dozen countries, it's an agreeable trifle, if ultimately not as charming as &quot;Macarena&quot; proved to be a few summers back. Throughout this cash-in album, Bega comes off like a cross between a less clever Tone-Loc and a less inspired Buster Poindexter. If there's a great Europop-Cuban fusion in the making, its standard-bearers will have to come up with more durable trashy fun than this.\n\nAllmusic Review:\nOut of left field came German-born, Italian/Ugandan Lou Bega, scoring an international chart-topping single with his infectious &quot;Mambo No. 5&quot; -- the only thing that kept it from reaching the top of the U.S. charts was the fact that no American commercial single was ever issued. The rest of Bega's album, A Little Bit of Mambo, follows pretty much the same recipe as &quot;Mambo No. 5.&quot; A couple of songs, including &quot;1+1=2&quot; and &quot;I Got a Girl&quot; are virtual rewrites of the aforementioned hit -- meaning that if one didn't enjoy &quot;Mambo No. 5,&quot; then one would have a difficult time enjoying the rest of the album. Nonetheless, this breezy, feel-good disc is entirely intoxicating, incorporating Caribbean rhythms and instrumentals (&quot;The Most Expensive Girl in the World,&quot; &quot;Icecream&quot;), mambo-meets-techno influences (&quot;Can I Tico Tico You&quot;), jazz and hip-hop (&quot;The Trumpet Part II&quot;), and old-time nostalgia (&quot;Baby Keep Smiling&quot;), to create one of 1999's most unusual and unique albums. Lou Bega's vocals are limited, to be sure, and the lyrics deal with little more than girls and partying (and are too ridiculous to be taken seriously), yet his charisma and good-natured intentions are undeniable. None of the songs on this disc came close to matching the success of &quot;Mambo No. 5.&quot; The second single, the hypnotic, brass-heavy &quot;Tricky Tricky&quot; failed to even ignite the U.S. Top 40, rendering Bega as more a novelty act than anything else. Nonetheless, this album is unique in the pantheon of 1990s pop music, and those who enjoyed his hit will likely enjoy the rest of this feel-good, summery concoction.","torrent":{"xt":"urn:btih:3fce02aa62cc799a42c830eef48415669ada9c6f","amp;dn":"Lou+Bega+-+A+Little+Bit+of+Mambo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fce02aa62cc799a42c830eef48415669ada9c6f","infoHashBuffer":{"type":"Buffer","data":[63,206,2,170,98,204,121,154,66,200,48,238,244,132,21,102,154,218,156,111]},"announce":[],"urlList":[]}}