{"title":"The Clandestine Saga - I.D. Johnson","uid":11983111,"size":753636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40054350d88b45cbc6e80f6b833aee835656933b&amp;dn=The+Clandestine+Saga+-+I.D.+Johnson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1433282858,"description":"01. Transformation [The Clandestine Saga, #01] - I.D. Johnson\n\n\n\nVampires don't exist.\nUnless they do....\nAnd if that's the case, then one better be prepared.\nFor Cadence Findley, Vampire Hunting isn't a choice: it's in her blood. Of course, she doesn't know that until she happens to meet a Vampire.\nWhen her friend Drew disappears at a creepy Eidolon Festival, it is up to Cadence to save her, and that's when she realizes exactly who she really is: Cadence Findley, Vampire Hunter extraordinaire.\nWith the help of the Guardians, will Cadence successfully hunt down the ancient Vampire Holland, or will Cadence be the next victim?\n\n\n\n02. Resurrection [The Clandestine Saga, #02] - I.D. Johnson\n\n\n\nCadence Findley is finally adjusting to her new life as a Vampire Hunter, when she receives an alarming phone call from her ex-boyfriend...who just happens to be dead.\n\nOr is Jack Cook actually un-dead?\n\nResurrection, the second installment in The Clandestine Saga picks up where Transformation left off. Vengeance against the ancient Vampire, Holland, has been served and Cadence is ready to pursue her relationship with the mysterious Guardian Leader, Aaron, when she discovers her sleepy little town of Shenandoah, Iowa, has been affected by the blood-suckers once again. When Jack begins to break the rules and prey upon Innocents, Cadence is faced with the unfathomable--destroy Jack or leave her team of Vampire Hunters forever. In the end, will Cadence be strong enough to look the man she once loved in the eyes and pull the trigger?","torrent":{"xt":"urn:btih:40054350d88b45cbc6e80f6b833aee835656933b","amp;dn":"The+Clandestine+Saga+-+I.D.+Johnson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40054350d88b45cbc6e80f6b833aee835656933b","infoHashBuffer":{"type":"Buffer","data":[64,5,67,80,216,139,69,203,198,232,15,107,131,58,238,131,86,86,147,59]},"announce":[],"urlList":[]}}