{"title":"Margaret Wertheim: The beautiful math that links coral, crochet ","uid":4878600,"size":59269482,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4066705591a7f88e9b45bbb1cde1e4276c1c771c&amp;dn=Margaret+Wertheim%3A+The+beautiful+math+that+links+coral%2C+crochet+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263490,"description":"Margaret Wertheim: The beautiful math that links coral, crochet and hyperbolic geometry\n\nMargaret Wertheim leads a project to re-create the creatures of the coral reefs using a crochet technique invented by a mathematician -- celebrating the amazements of the reef, and deep-diving into the hyperbolic geometry underlying coral creation.\n\nSnowflakes, fractals, the patterns on a leaf -- there's beauty to be found at the intersection of nature and physics, beauty and math. Science writer Margaret Wertheim (along with her twin sister, Christine) founded the Institute for Figuring to advance the aesthetic appreciation of scientific concepts, from the natural physics of snowflakes and fractals to human constructs such as Islamic mosaics, string figures and weaving.\n\nThe IFF's latest project is perhaps its most beguilingly strange -- a coral reef constructed entirely by crochet hook, a project that takes advantage of the happy congruence between the mathematical phenomena modeled perfectly by the creatures of the reef,  and repetitive tasks such as crocheting -- which, as it turns out, is perfectly adapted to model hyperbolic space. It is easy to sink into the kaleidoscopic, dripping beauty of the yarn-modeled reef, but the aim of the reef project is twofold: to draw attention to distressed coral reefs around the world, dying in droves from changing ocean saline levels, overfishing, and a myriad of threats; and to display a flavor of math that was previously almost impossible to picture. By modeling these complex equations in physical space, this technique can help mathematicians see patterns and make breakthroughs.\n\nWertheim is now working on a book about maverick scientist James Carter.\n\n    &quot;Margaret Wertheim might technically fall under the oh-so-banal title of a science communicator. But this fiery Australian native has roamed far beyond the standard definition of one who just talks about science.&quot;\n\nKristin Abkemeier, Inkling Magazine","torrent":{"xt":"urn:btih:4066705591a7f88e9b45bbb1cde1e4276c1c771c","amp;dn":"Margaret+Wertheim%3A+The+beautiful+math+that+links+coral%2C+crochet+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4066705591a7f88e9b45bbb1cde1e4276c1c771c","infoHashBuffer":{"type":"Buffer","data":[64,102,112,85,145,167,248,142,155,69,187,177,205,225,228,39,108,28,119,28]},"announce":[],"urlList":[]}}