{"title":"Dungeon Rushers v0.8.42","uid":14592513,"size":132100441,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:40dee0c3a5980e6ec24918849d78499d8bc72d74&amp;dn=Dungeon+Rushers+v0.8.42&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1463001969,"description":"\nAbout This Game\r\nDungeon Rushers is a 2D tactical RPG combining dungeon crawler’s gameplay and turn based fights. Manage your team, loot dusty dungeons, crush armies of monsters and craft mighty equipment. Be part of an epic adventure with a colorful cast of characters in an off-beat universe. Build your own dungeon and challenge other players!\r\nThe Game:\r\nOver the course of an epic quest, explore many dungeons and loot their guarded treasures. Build your own team by choosing the best hero combination to overcome traps and monsters lurking in the shadows.\r\n\r\nUpgrade the skills of your heroes to make them even more fearsome and place them strategically to achieve victory.\r\n\r\nCraft your equipment on your own with components gathered during your journey thanks to an advanced system consisting of six different craftsmen.\r\n\r\nComplete dungeons and their bonus challenges to unlock the Heroic difficulty, where only the best can make their way to the treasure!\r\n\r\nBuild your own dungeon in which you can spread traps and monsters to prevent other adventurers from looting your chest! Hire your « dream team » by exploring a world where dungeons and manors have been abandoned by men in favor of the worst creatures, then attack other players' dungeons to plunder their treasure!\r\nFeatures:\r\n\r\n    Campaign mode full of humor with various sound and graphic environments\r\n    Interactive exploration system\r\n    Revised turn based fights with a hint of nostalgia\r\n    Advanced team management (equipment, skills upgrade, in-fight position, ...)\r\n    Wide range of skills to use (scout, heals, dodge, trap deactivation, monsters stalking)\r\n    Crafting system featuring many recipes to unlock\r\n    High replay value with a Heroic difficulty for each dungeon\r\n    Online arena system with matchmaking and ranking\r\n    Battles among friends, to die against people you love\r\n    Epic custom-made soundtrack","torrent":{"xt":"urn:btih:40dee0c3a5980e6ec24918849d78499d8bc72d74","amp;dn":"Dungeon+Rushers+v0.8.42","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40dee0c3a5980e6ec24918849d78499d8bc72d74","infoHashBuffer":{"type":"Buffer","data":[64,222,224,195,165,152,14,110,194,73,24,132,157,120,73,157,139,199,45,116]},"announce":[],"urlList":[]}}