{"title":"The La's - There She Goes  (2nafish)","uid":5543430,"size":104734724,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:40ec6692696a69e8b4af1f0b3123bea42d35e9c5&amp;dn=The+La%5C%27s+-+There+She+Goes++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1273310849,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;There She Goes&quot; is a song written by Liverpudlian singer/guitarist Lee Mavers and recorded first by Mavers' band, The La's.\n\nThe song has also been covered by, amongst others, Sixpence None the Richer, Robbie Williams, The Wombats and The Boo Radleys. You Am I included the song in their set for their Let's Be Dreadful Tour in 2008.\n\nThe first version of the song was released by The La's in 1988, and again on January 2, 1989, but failed to chart. The track was remixed by Steve Lillywhite in 1990 for inclusion on their debut album The La's. This remixed version was issued as a single on October 22, 1990, and hit number 13 in the UK charts (and later hit number 49 in the U.S.). It was the biggest success The La's were ever to enjoy and remains the song for which the band is chiefly remembered.\n\nIn May 2007, NME magazine placed &quot;There She Goes&quot; at number 45 in its list of the 50 Greatest Indie Anthems Ever. In 2008, it was also re-released as a vinyl single for its 20th anniversary.\n\nStructurally, the song is very simple and contains no verses, only a single chorus repeated four times and a bridge.\n\n&quot;There She Goes&quot; has gained a reputation for being about the use of heroin; the lyrics seem to refer to a woman, but on closer inspection of some lines (&quot;There she goes again... racing through my brain... pulsing through my vein... no one else can heal my pain&quot;), the possible drug connotations become apparent. Several newspapers ran articles about The La's and their apparent ode to heroin. When asked about the rumor in 1995, the group's bassist John Power replied, &quot;I don't know. Truth is, I don't wanna know. Drugs and madness go hand in hand. People who you've known all your life... they're steady, then they're not. But you can't ponder, 'cause it kills you, la.'&quot; However, in the 2003 book In Search of The La's : A Secret Liverpool by MW Macefield, ex-La's guitarist Paul Hemmings denied the rumour.\n\nIt has appeared on several film soundtracks, including The Parent Trap, Fever Pitch, Girl, Interrupted and So I Married an Axe Murderer  (where both the original and Boo Radleys version appear).\n\nFor several seasons in the 1990s the song's distinctive guitar riff was used as backing for the 'Goal of the Month' clips on BBC TV's Match Of The Day.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:40ec6692696a69e8b4af1f0b3123bea42d35e9c5","amp;dn":"The+La%5C%27s+-+There+She+Goes++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40ec6692696a69e8b4af1f0b3123bea42d35e9c5","infoHashBuffer":{"type":"Buffer","data":[64,236,102,146,105,106,105,232,180,175,31,11,49,35,190,164,45,53,233,197]},"announce":[],"urlList":[]}}