{"title":"Eddie Hazel - Jams Fron the Heart (1975) [FLAC]","uid":10757887,"size":193753488,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40fa07ae5a1d84930d4039a5b28e69b084b7e1b8&amp;dn=Eddie+Hazel+-+Jams+Fron+the+Heart+%281975%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Eugene_Debs","files":-1,"time":1407948448,"description":"A1 \tSmedley Smorganoff \t3:04\nA2 \tLampoc Boogie \t11:45\nB1 \tFrom The Bottom Of My Heart \t12:30\nB2 \tUnkut Funk \t1:55\n\n\n\nEddie Hazel rose to fame in the early '70s as part of George Clinton's Parliament/Funkadelic troupe. An extremely talented and underappreciated guitarist/songwriter, Hazel had no problem nailing down Hendrix-like guitar freakouts (&quot;Maggot Brain&quot;) or nasty, straight-up funk (&quot;Loose Booty,&quot; &quot;Red Hot Mama&quot;). Although drug abuse would hinder his talents (he went to prison in the late '70s and eventually died in 1993 because of it), Hazel still came through when inspired and focused. Although he did release one official solo album in 1977 (Games, Dames &amp; Guitar Thangs), there wasn't much material left behind where the listener could hear Hazel cut loose on guitar due to the Clinton-generated pressure to write a hit single. All of this is solved by the Jams From the Heart EP, which features some of Hazel's greatest playing ever committed to tape. The tracks are from a 1975 studio session, when he was laying down demos for his upcoming solo debut. Quite simply, Hazel rips on guitar. &quot;Smedley Smorganoff&quot; opens up with Hazel getting the feel for the other musicians, while the near 12-minute &quot;Lampoc Boogie&quot; is the near-ultimate guitar showcase for him (the above-mentioned &quot;Maggot Brain&quot; gets top honors). The gut-wrenching ballad &quot;From the Bottom of My Heart&quot; is another long track, and is the only song on the album to contain vocals. The final selection, the short &quot;Unkut Funk,&quot; features some great band interplay on a fat groove, which wraps up the EP nicely. A wonderful introduction for those curious about the many talents of Eddie Hazel, especially since it's nearly 30 minutes long yet priced as a mini-album.","torrent":{"xt":"urn:btih:40fa07ae5a1d84930d4039a5b28e69b084b7e1b8","amp;dn":"Eddie+Hazel+-+Jams+Fron+the+Heart+%281975%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40fa07ae5a1d84930d4039a5b28e69b084b7e1b8","infoHashBuffer":{"type":"Buffer","data":[64,250,7,174,90,29,132,147,13,64,57,165,178,142,105,176,132,183,225,184]},"announce":[],"urlList":[]}}