{"title":"Fountains of Wayne - Out-of-State Plates Disc 1 [2005]","uid":9575685,"size":285413610,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4175b8473480c01214d3b32e66a4715238123c78&amp;dn=Fountains+of+Wayne+-+Out-of-State+Plates+Disc+1+%5B2005%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1391699613,"description":"Review by Stephen Thomas Erlewine  [-]\nMost bands wouldn't follow up their long-awaited commercial breakthrough with a double-disc rarities collection, so it's hard not to see Fountains of Wayne's 2005 odds-n-sods comp, Out-of-State Plates, as either a contractual obligation or a way to buy time as the group works on the real sequel to 2003's Welcome Interstate Managers and its surprise smash single, &quot;Stacy's Mom.&quot; Either way, it doesn't change the fact that Out-of-State Plates is a ragged collection of hits and misses that will satisfy FOW completists, while being of intermittent interest to recent converts or general power pop fans. Like most '90s bands, Fountains of Wayne were required to fill out multi-part CD singles with non-LP material and had a tendency to contribute to soundtracks, benefit albums, and tribute albums, plus they had a handful of unreleased cuts as well, so they had a surplus of stray tracks uncollected on a proper album prior to this comp. To sweeten the pot for fans who kept up with European singles, there are two brand-new recordings (one for each disc) added to the mix: &quot;Maureen&quot; and &quot;The Girl I Can't Forget.&quot; Considering the number of different sources for these tracks, it shouldn't be surprising that this plays like a hodgepodge, bouncing between live tracks, jokes, covers, musical allusions, full-fledged forgotten gems, radio interview snippets, and utter throwaways. Unlike such '90s B-side comps like Suede's Sci-Fi Lullabies or Oasis' The Masterplan, this isn't a consistent collection of songs that could have shown up on proper albums; this is a clearing-house and only the devoted will find something to love in all 30 tracks (well, it's really closer to 28, since both discs begin with brief spoken introductions that aren't songs). The less forgiving will find this to vacillate between fizzy fun and incomplete recordings, sometimes sounding cloying and sometimes a little dull, due to its sprawling length and wildly inconsistent nature. Even the best of the songs carry the smirky humor that made &quot;Stacy's Mom&quot; a novelty hit: the speedy, trashy new single &quot;Maureen&quot; is about a guy whose female friend tells him all about her sex life in excruciating detail; as catchy as &quot;California Sex Lawyer&quot; is, it's as obviously jokey as the title; the holiday single &quot;I Want an Alien for Christmas&quot; tries a bit too hard to be seasonal novelty; the ripping Oasis parody &quot;Elevator Up&quot; is irresistible, even if it's too knowing in its drug references; and while the group claim that their crawling, guitar-driven cover of Britney Spears' &quot;...Baby One More Time&quot; is not ironic, it's hard not to take the song that way, given the band's somber treatment. While this may not bother some listeners, particularly those who found the MILF anthem hilarious, it does tend to undercut the group's quite genuine pop gifts, since their humor is always smug; instead of having fun, they're making fun. That's been true on all their albums, but here it seems even stronger since the best songs are also the smirkiest. Again, this is something that wouldn't bother most fans, particularly those with the patience to sit through a double-disc set of rarities, but for the power pop fan who appreciates the tunes and craft of FOW, if not the attitude, it makes this grab bag of gems and duds a frustrating journey, because even when a song sounds right here, it doesn't necessarily feel right. (3/5)","torrent":{"xt":"urn:btih:4175b8473480c01214d3b32e66a4715238123c78","amp;dn":"Fountains+of+Wayne+-+Out-of-State+Plates+Disc+1+%5B2005%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4175b8473480c01214d3b32e66a4715238123c78","infoHashBuffer":{"type":"Buffer","data":[65,117,184,71,52,128,192,18,20,211,179,46,102,164,113,82,56,18,60,120]},"announce":[],"urlList":[]}}