{"title":"Trek Nation (2010).avi","uid":8321024,"size":2221917200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:417db66f205cc6660da753e75ce3b02e4273cb92&amp;dn=Trek+Nation+%282010%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wmoecke","files":1,"time":1364672580,"description":"Eugene &quot;Rod&quot; Roddenberry, Jr.'s narration of this wonderful documentary for all the trekkies (or trekkers) highlights his father's vision and brilliance in creating one of the most fascinating show on American television. But most importantly, the documentary presents a complex and bittersweet relationship between Rod and his father. Through the webs of the nostalgia - from the history of Gene's life (a war veteran, a PanAm's pilot, a police officer and then becoming the genius behind &quot;Star Trek&quot;) to Gene's successes and failures with his foresight of the future through the medium of television - the film digs deeper on the son's craving to know how millions of people were influenced by the same father whom he had very few things in common. It is very touching to see how Rod somehow struggle emotionally on his interviews with people close to or admirer/fans of his father and how life has passed years after his father died, and how now he craves for so many questions that he failed to ask his dad when he was still alive. Every human being can definitely relate to this principle.\n\nThe whole film is not only intriguing but a revelation even to those fans who know most things about Star Trek. Die hard trekkies will find few things that they will never know of unless they watch this documentary.\n\nJessica Brunetto did a great job in writing and director, cinematographer and producer Scott Colthorp captures a very inspiring and yet emotional journey of all the entities surrounding the well-loved &quot;Star Trek.&quot;\n\n\nI have decided to post this as an alternative to the existing 8GB torrent that is currently the only one available here. The video is not HD, the audio is excellent, and overall a very good and watchable copy. I am not a transcoding expert, so I did what I could with the tools I have at hand, trying not to compromise the video quality over size. The end result is 2GB.\n\n\nIf you like it, seed. If you don't, go after the DVD and buy it. Then you can complain.  ;)","torrent":{"xt":"urn:btih:417db66f205cc6660da753e75ce3b02e4273cb92","amp;dn":"Trek+Nation+%282010%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"417db66f205cc6660da753e75ce3b02e4273cb92","infoHashBuffer":{"type":"Buffer","data":[65,125,182,111,32,92,198,102,13,167,83,231,92,227,176,46,66,115,203,146]},"announce":[],"urlList":[]}}