{"title":"Grant C. Butler - Kings and Camels. An American in Saudi Arabia ","uid":9992450,"size":12990652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41f7b205dfb0eb95cb438fc723dac2908c7dc2b2&amp;dn=Grant+C.+Butler+-+Kings+and+Camels.+An+American+in+Saudi+Arabia+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397866704,"description":"Description\nProduct details\nBook Title: Kings and Camels: An American in Saudi Arabia\t\nBook Author: Grant C. Butler (Author)\nPaperback: 136 pages\nPublisher: Garnet Publishing; 2nd edition edition (10 Mar 2008)\nLanguage: English\nISBN-10: 1859642004\nISBN-13: 978-1859642009\n\nBook Description\nPublication Date: 10 Mar 2008 | ISBN-10: 1859642004 | ISBN-13: 978-1859642009 | Edition: 2nd edition\nFirst published in 1960, &quot;Kings and Camels&quot; is a straightforward account of how an American went to work in Saudi Arabia and came home to America to realize how little the average American appreciated the strategic importance of the area and, more crucially still, how little he understood the people in the area. Butler presents his material in the form of an informal account of his personal experiences in the Middle East, both while he lived there, working for the Arabian American Oil Company (ARAMCO), and as a successful lecturer and writer who has returned to the area often.The book goes behind the scenes in the Arab world, and into private audience with the legendary Ibn Saud. It explains Islam, the religion of the Arabs. It introduces the reader to the desert Bedouin, and the Arab of the cities. It focuses on human interest, on the Americans who lived and worked in Saudi Arabia. Above all, the book's emphasis is on the cultivation of understanding between the American and Arab peoples. It points out how vital such understanding is to Saudi Arabia, to the Arabs themselves, and to Americans.\n\nAbout the Author\nGrant C. Butler worked in oil industry public relations for ten years, both in the Middle East and in the United States. He also gave thousands of lectures on the Arabs and the Middle East across America, and his articles and stories appeared in the Chicago Herald-American, the Los Angeles Times, The Christian Science Monitor amongst others.\n","torrent":{"xt":"urn:btih:41f7b205dfb0eb95cb438fc723dac2908c7dc2b2","amp;dn":"Grant+C.+Butler+-+Kings+and+Camels.+An+American+in+Saudi+Arabia+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f7b205dfb0eb95cb438fc723dac2908c7dc2b2","infoHashBuffer":{"type":"Buffer","data":[65,247,178,5,223,176,235,149,203,67,143,199,35,218,194,144,140,125,194,178]},"announce":[],"urlList":[]}}