{"title":"Lawrence E. Joseph - Słoneczny kataklizm [POLISH]","uid":15803656,"size":12910833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43686001f3032d876a68e794e817ba3bcec000ce&amp;dn=Lawrence+E.+Joseph+-+S%C5%82oneczny+kataklizm+%5BPOLISH%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BanchMon2","files":1,"time":1473544101,"description":"Lawrence E. Joseph - Słoneczny kataklizm. W jaki sposób Słońce ukształtowało historię i co możemy zrobić, by ocalić przyszłość [PDF] [PL] \r\n\r\nOto książka, która rzuca nowe światło na tajemniczą, choć tak bliską nam gwiazdę – Słońce. Badając historię cyklów aktywności słonecznej i ich wpływu na historię Ziemi, Lawrence E . Joseph dochodzi do zaskakujących wniosków, które wymagają zastanowienia się nad stworzeniem systemu obrony przed słonecznym atakiem.\r\n\r\n Słoneczny kataklizm daje zupełnie nowe wyobrażenie na temat potencjalnego zagrożenia, które kryje się za wybuchami na Słońcu i może doprowadzić do zniszczenia bądź znacznego uszkodzenia świata, który znamy.\r\n\r\n Nie jest to jednak opowieść o końcu ludzkości. Nasz los – zarówno jako zbiorowości, jak i indywidualnych jednostek – nie jest totalnie uzależniony od słonecznych kaprysów.\r\n\r\n Za pomocą napisanych błyskotliwą prozą fascynujących opowieści Joseph pokazuje, w jaki sposób powinniśmy wykorzystać dostępną nam wiedzę i narzędzia – w tym pozyskane niedawno wyniki badań nad Słońcem oraz najnowsze zdobycze techniki, a także ludzką pomysłowość i instynkt przetrwania – w celu stawienia czoła zagrożeniom, jakie mogą nas spotkać ze strony naszej gwiazdy, a także w celu zabezpieczenia ludzkiej egzystencji, ziemskiej atmosfery, systemu satelitów, sieci energetycznej i infrastruktury jądrowej przed nadchodzącym kataklizmem","torrent":{"xt":"urn:btih:43686001f3032d876a68e794e817ba3bcec000ce","amp;dn":"Lawrence+E.+Joseph+-+S%C5%82oneczny+kataklizm+%5BPOLISH%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43686001f3032d876a68e794e817ba3bcec000ce","infoHashBuffer":{"type":"Buffer","data":[67,104,96,1,243,3,45,135,106,104,231,148,232,23,186,59,206,192,0,206]},"announce":[],"urlList":[]}}