{"title":"Dixie Kwankwa - Sadness and Joy [1959]","uid":7885061,"size":76599496,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:44667aa724ed129fc3495a4fb97c85d3b989ef8a&amp;dn=Dixie+Kwankwa+-+Sadness+and+Joy+%5B1959%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1354595225,"description":"âˆ’ 1959 - Troubadour / LPA1 / Sadness and Joy /\n\nmp3 320\n\nSouth African twee/folk from 1959. Vinyl rip(not mine). Very nice!\n\nFrom Electric Jive:\nThis is the first LP in South Africa on the Troubadour label and is presented as &quot;Sadness and Joy - Dixie Kwankwa in an Evening of African Cabaret&quot;. Dixie had a hit in London and Southern Africa with the song My Nyasaland Love which was issued in the UK on Melodisc 1573 (c.1961). In a strange way Dixie reminds me of Simphiwe Dana with an assured but quiet and confident delivery and none of the urgency or forcefullness of her peers. In listening to the LP today you can almost visualise this slotting in next to the Harry Belafonte, Bing Crosby and Frank Sinatra records that the white middle classes were enjoying at the the time. Record players that could play 33rpm records were rare and expensive and until at least the mid-sixties the predominant format in South Africa was the 78 single play.\n\nThere is not a lot more information on Dixie apart from what can be gleaned from the sleeve notes which are written in the quaint and mostly patronising manner of the times. Dixie did win the Miss South Africa title in 1957 and in the following year as part of the show African Bandwagon got her first singing job before being signed to Troubadour Records.\n\nThere are some great songs here including a take on Ghanaian Hi Life and a rock and roll tune. The accompaniment and chorus is under the direction of Cuthbert Mathumba whilst the LP is produced and arranged by Stuart Cook. Enjoy the ride!\n\nDixie Kwankwa - Sadness and Joy (Troubadour, LPA1, c 1959)\n1. Hush A Bye\n2. Kulusizi\n3. Hi-Life the Ghana Way\n4. Mary Jane\n5. When the One You Love\n6. Lost on the Mountain\n7. My Heart is Waiting for the Sunrise\n8. Kwa Zulu\n9. Memories of My Love\n10. Nice Time Baby\n11. Pick Up The Axe, Sebenza\n12. When You Walk Alone","torrent":{"xt":"urn:btih:44667aa724ed129fc3495a4fb97c85d3b989ef8a","amp;dn":"Dixie+Kwankwa+-+Sadness+and+Joy+%5B1959%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44667aa724ed129fc3495a4fb97c85d3b989ef8a","infoHashBuffer":{"type":"Buffer","data":[68,102,122,167,36,237,18,159,195,73,90,79,185,124,133,211,185,137,239,138]},"announce":[],"urlList":[]}}