{"title":"[PDF-ITA]JK-Rowling.Harry-Potter.La.Saga.Completa[CR-Bt]","uid":4877315,"size":13236998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4515903afefa97182e324b67ddd66234bc81186b&amp;dn=%5BPDF-ITA%5DJK-Rowling.Harry-Potter.La.Saga.Completa%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":1,"time":1241195717,"description":"Harry Potter ÃƒÂ¨ una saga letteraria fantasy in sette libri, ideata dalla scrittrice inglese Joanne Kathleen Rowling all'inizio degli anni novanta e concretizzata negli anni successivi, tra il 1997 e il 2007.\n\nL'opera descrive le avventure del mago adolescente Harry Potter e dei suoi migliori amici e coetanei, Ron Weasley e Hermione Granger. L'ambientazione principale ÃƒÂ¨ la Scuola di Magia e Stregoneria di Hogwarts dove vengono educati alle arti magiche i giovani maghi e streghe del Regno Unito.\n\nL'arco narrativo copre un periodo di sette anni - uno per ogni libro della serie - dal momento in cui Harry Potter, un undicenne orfano che abita a Little Whinging con gli sgradevoli zii adottivi Vernon e Petunia Dursley, apprende della sua condizione speciale e inizia a frequentare Hogwarts allo scontro aperto con il suo antagonista, il malvagio mago Lord Voldemort, responsabile dell'assassinio dei genitori di Harry nel suo primo tentativo di ottenere il dominio del mondo magico.\n\nHarry Potter ÃƒÂ¨ esploso dapprima come fenomeno letterario in Inghilterra nel 1997, anno di pubblicazione nel Regno Unito del primo episodio della saga del piccolo mago, dal titolo Harry Potter and the Philosopher's Stone. Nel 1998 il successo assume dimensione mondiale: solo in Italia il libro, tradotto come Harry Potter e la pietra filosofale e pubblicato con una tiratura iniziale di 20.000 copie, vince nel dicembre dello stesso anno il Premio Cento, riconoscimento dedicato alla letteratura per ragazzi; negli Stati Uniti la casa cinematografica Warner Bros. acquista i diritti cinematografici del volume e nel novembre 2001, per la regia di Chris Columbus, la storia di Harry Potter - interpretato dall'attore Daniel Radcliffe - conquista l'intera platea mondiale. Ad aprile 2007, i primi sei libri hanno venduto un totale di 400 milioni di copie e sono stati tradotti in piÃƒÂ¹ di 64 lingue.","torrent":{"xt":"urn:btih:4515903afefa97182e324b67ddd66234bc81186b","amp;dn":"%5BPDF-ITA%5DJK-Rowling.Harry-Potter.La.Saga.Completa%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4515903afefa97182e324b67ddd66234bc81186b","infoHashBuffer":{"type":"Buffer","data":[69,21,144,58,254,250,151,24,46,50,75,103,221,214,98,52,188,129,24,107]},"announce":[],"urlList":[]}}