{"title":"Extreme.Weight.Loss.S03E12.Cassandra.HDTV.x264-NY2.mp4","uid":8863489,"size":644514991,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:45496092411e6610f8800b2234ea990786c78172&amp;dn=Extreme.Weight.Loss.S03E12.Cassandra.HDTV.x264-NY2.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TroyHorse","files":-1,"time":1377833889,"description":"Originally Titled &quot;Extreme Makeover: Weight Loss Edition&quot;\n\nExtreme Weight Loss\nSeason 3 , Episode 12 - &quot;Cassandra&quot;\n\nOnce a four-time All American athlete, Cassandra no longer plays any sports and now weighs 364 pounds. After a messy divorce, the heartbroken 45-year-old from Quartz Hill, CA turned to food to bury her sorrows. A high school guidance counselor and coach for the track and field team, she tells her students they can achieve anything they put their minds to. Yet when it comes to losing weight, she is unable to follow her own advice. To help Cassandra with her diet and nutrition, trainer Chris Powell brings in celebrity chef Rocco DiSpirito to show her how to make quick and healthy meals. But during her journey, her unhealthy food habits start to creep back in. To help her, Chris breaks precedent and gives Cassandra weekly goals, as opposed to 90-day goals. He hopes to bring out the athlete she once was and, for one of her milestones, to reward her with a singles adventure, whitewater rafting trip to Costa Rica. However Cassandra is reluctant since she fears falling out of the boat and not being able to pull herself back in. As her confidence builds, Cassandra discovers she can push herself out of her comfort zone by trying new things.","torrent":{"xt":"urn:btih:45496092411e6610f8800b2234ea990786c78172","amp;dn":"Extreme.Weight.Loss.S03E12.Cassandra.HDTV.x264-NY2.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45496092411e6610f8800b2234ea990786c78172","infoHashBuffer":{"type":"Buffer","data":[69,73,96,146,65,30,102,16,248,128,11,34,52,234,153,7,134,199,129,114]},"announce":[],"urlList":[]}}