{"title":"Into the Quagmire: Lyndon Johnson and the Escalation of the Viet","uid":11739392,"size":17809142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4564d939357d5396b7aa8c3aeccd22312c573347&amp;dn=Into+the+Quagmire%3A+Lyndon+Johnson+and+the+Escalation+of+the+Viet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425711459,"description":"In November of 1964, as Lyndon Johnson celebrated his landslide victory over Barry Goldwater, the government of South Vietnam lay in a shambles. Ambassador Maxwell Taylor described it as a country beset by &quot;chronic factionalism, civilian-military suspicion and distrust, absence of national spirit and motivation, lack of cohesion in the social structure, lack of experience in the conduct of government.&quot; Virtually no one in the Johnson Administration believed that Saigon could defeat the communist insurgency--and yet by July of 1965, a mere nine months later, they would lock the United States on a path toward massive military intervention which would ultimately destroy Johnson's presidency and polarize the American people.\nInto the Quagmire presents a closely rendered, almost day-by-day account of America's deepening involvement in Vietnam during those crucial nine months. Mining a wealth of recently opened material at the Lyndon Baines Johnson Library and elsewhere, Brian VanDeMark vividly depicts the painful unfolding of a national tragedy. We meet an LBJ forever fearful of a conservative backlash, which he felt would doom his Great Society, an unsure and troubled leader grappling with the unwanted burden of Vietnam; George Ball, a maverick on Vietnam, whose carefully reasoned (and, in retrospect, strikingly prescient) stand against escalation was discounted by Rusk, McNamara, and Bundy; and Clark Clifford, whose last-minute effort at a pivotal meeting at Camp David failed to dissuade Johnson from doubling the number of ground troops in Vietnam. What comes across strongly throughout the book is the deep pessimism of all the major participants as things grew worse--neither LBJ, nor Bundy, nor McNamara, nor Rusk felt confident that things would improve in South Vietnam, that there was any reasonable chance for victory, or that the South had the will or the ability to prevail against the North. And yet deeper into the quagmire they went.\nWhether describing a tense confrontation between George Ball and Dean Acheson (&quot;You goddamned old bastards,&quot; Ball said to Acheson, &quot;you remind me of nothing so much as a bunch of buzzards sitting on a fence and letting the young men die&quot;) or corrupt politicians in Saigon, VanDeMark provides readers with the full flavor of national policy in the making. More important, he sheds greater light on why America became entangled in the morass of Vietnam","torrent":{"xt":"urn:btih:4564d939357d5396b7aa8c3aeccd22312c573347","amp;dn":"Into+the+Quagmire%3A+Lyndon+Johnson+and+the+Escalation+of+the+Viet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4564d939357d5396b7aa8c3aeccd22312c573347","infoHashBuffer":{"type":"Buffer","data":[69,100,217,57,53,125,83,150,183,170,140,58,236,205,34,49,44,87,51,71]},"announce":[],"urlList":[]}}