{"title":"CIVILIZATION.III.CONQUESTS-DEViANCE","uid":3223555,"size":720076185,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45787c097f17d60d1e24b4ef1083ef94c9f9fe7d&amp;dn=CIVILIZATION.III.CONQUESTS-DEViANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"solanum","files":51,"time":1089392482,"description":"Game Notes:\n    ~~~~~~~~~~~\n   \n    Civ fans will discover intriguing new civilizations, units, wonders, \n    technologies, and abilities to help them triumph in eight \n    professionally designed conquests throughout history. Compete as \n    one of the eight new Civilizations, each with its own powerful \n    leader, unique units and special abilities, and lead your nation \n    to its destiny. New victory conditions, Wonders of the World, \n    terrain elements, resources, city improvements, and governments \n    offer endless variation in your quest to rule the world. \n    Improved multiplayer and play-by-email support, intense diplomatic \n    situations, and a slew of editor enhancements, round out \n    what Time Magazine calls &amp;quot;the greatest computer strategy game of \n    all time.&amp;quot; \n\n    Do you have what it takes to lead a civilization to greatness? Or, \n    will your nation be conquered by some greater power? You decide. \n\n  \n    Game Features:\n    ~~~~~~~~~~~~~~\n\n    * More Civilizations: Seven new powerful civilizations from the \n      innovative Sumerians to the mystical Mayans. \n\n    * More Units: Use Trebuchets to batter down the enemy's walls \n      or Sumerian Enkidu Warriors to quickly gain military dominance. \n\n    * More Techs - Map the world using Satellites to explore \n      the entire map. \n\n    * More Disasters: Beware the volcanoes, or Pompeii could become \n      your reality. \n\n    * More Diplomacy Options: Locked alliances allow good vs. evil \n      conflicts you'll never forget. \n\n    * More Map Features: Bombard the enemy and leave behind craters. \n\n    * More Resources: Fight for control over Tobacco, Bananas, Oasis, \n      Salt, Sugar, Jade, and Exotic Birds. \n\n    * More Wonders: Build 5 all new wonders, including the statue of Zeus \n      and the even all new commerce bonuses \n\n    * More Government Types: - Fascism, Feudalism, Tribal Council, and \n      Imperialism are just a few of the new ways to rule your people. \n\n    * More Unit Abilities - Including Stealth Attack, Enslavement, and \n      other bonus attack modifiers such as damage multipliers can now be \n      applied to units \n\n    * More Attributes - Including two new Civ-Types: Agricultural and \n      Seafaring \n\n    * More City Specialists - Including Civil Engineers and Police Forces \n\n    * More Improvements - Including improvements to the AI, Combat \n      System, Interface, Rally Points, Governors, Leaders, Unit-Stacks, \n      and even Game Balance! \n\n    * More Game Options - Including the ability to choose Random World \n      Sizes and new levels of difficulty such as &amp;quot;Demigod&amp;quot; and &amp;quot;Sid&amp;quot; \n\n    * Extra Content - All Civs, leaders, special units, and features \n      included from the Civilization III: Play the Worldâ„¢ expansion. \n\n\n\n    Install Notes:\n    ~~~~~~~~~~~~~~\n    1) Unrar with WinRAR.\n    2) Burn the .cue and .bin with Nero Burning Rom software.\n    3) Install the game.\n    4) Copy over the cracked game .exe files from the CD.\n    5) And then play :)","torrent":{"xt":"urn:btih:45787c097f17d60d1e24b4ef1083ef94c9f9fe7d","amp;dn":"CIVILIZATION.III.CONQUESTS-DEViANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45787c097f17d60d1e24b4ef1083ef94c9f9fe7d","infoHashBuffer":{"type":"Buffer","data":[69,120,124,9,127,23,214,13,30,36,180,239,16,131,239,148,201,249,254,125]},"announce":[],"urlList":[]}}