{"title":"Mozart - The Magic Flute (Abbado - Mahler Chamber Orchestra)","uid":4922628,"size":586765541,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4583b9d8361e26b0165994e18a1dc3e061ca19bc&amp;dn=Mozart+-+The+Magic+Flute+%28Abbado+-+Mahler+Chamber+Orchestra%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":48,"time":1243725056,"description":"Music : Classical : Lossless\n\n \n\nDie ZauberflÃƒÂ¶te, K 620 by Wolfgang Amadeus Mozart\n\n09/2005, Teatro Comunale, Modena, Italy \n\nPerformers: Dorothea RÃƒÂ¶schmann (Soprano), Christoph Strehl (Tenor), Hanno MÃƒÂ¼ller-Brachmann (Baritone), George Zeppenfeld (Bass), Kurt Azesberger (Tenor), Caroline Stein (Soprano), Heidi Zehnder (Soprano), Alexander Lischke (Boy Soprano), Niklas Mallmann (Boy Alto), Frederic Jost (Boy Soprano), Danilo Formaggia (Tenor), Sascha Borris (Bass), Andreas Bauer (Bass), Julia Kleiter (Soprano), RenÃƒÂ© Pape (Bass), Erika Miklosa (Soprano), Tobias Beyer (Spoken Vocals), Matthias Bernhold (Spoken Vocals), Martin Olbertz (Spoken Vocals), Anne-Carolyn SchlÃƒÂ¼ter (Mezzo Soprano) \n\nConductor: Claudio Abbado \n\nOrchestra: Arnold Schoenberg Choir, Mahler Chamber Orchestra\n\n\n2 cd set\nFLAC ripped with EAC\nIncludes cue files and scans \n\nMore info: &lt;a href=&quot;\nhttp://www.arkivmusic.com/classical/album.jsp?album_id=135833&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.arkivmusic.com/classical/album.jsp?album_id=135833&lt;/a&gt;\n\n\n\nThe Magic Flute\n\nACT I \nPrince Tamino is rescued from a monster by the Three Ladies of the Queen of the Night, but the birdcatcher Papageno takes the credit. As a punishment for lying, the Ladies padlock his mouth. They then give Tamino a painting of the Queen's abducted daughter Pamina. Falling in love with her image, he sets out to rescue her. The Queen promises that if he succeeds she will agree to their marriage. \n\nTamino is given a magic flute, Papageno some magic bells, and together they journey to Sarastro's palace, where Pamina is being held. Papageno's blundering arrival inadvertently saves Pamina from being attacked by Monostatos, a moor in the service of Sarastro. Papageno and Pamina leave in search of Tamino, who has arrived at a temple whose priest informs him that it is the Queen and not Sarastro who is evil. Papageno and Pamina are confronted by Monostatos and his slaves, but, using the bells, they manage to escape. Pamina and Tamino finally meet, and immediately fall in love. \n\nACT II \nTamino and Papageno are told they have to undergo a series of trials if they are to be accepted into the brotherhood of the temple. The first being a period of silence. While Pamina is asleep, Monostatos again approaches, but is warded off by the Queen, who gives her daughter a dagger and tells her that she can only regain her power if Sarastro is killed. \n\nMonostatos is once more forcing himself on Pamina when Sarastro enters. He knows of the Queen's plans but reminds Monostatos that the brotherhood is bound by love. Papageno is given a fleeting glimpse of his ideal mate, Papagena, but is warned that he will be denied her if he fails in his trials. Pamina is taken to Tamino, and together they undergo trials by fire and water. Aided by the magic flute, they pass through safely. \n\nPapageno is united with Papagena, despite his failure to maintain silence. The Queen, the Three Ladies and Monostatos are engulfed by a clap of thunder and the remainder of the cast celebrate the victory of light over darkness.\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:4583b9d8361e26b0165994e18a1dc3e061ca19bc","amp;dn":"Mozart+-+The+Magic+Flute+%28Abbado+-+Mahler+Chamber+Orchestra%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4583b9d8361e26b0165994e18a1dc3e061ca19bc","infoHashBuffer":{"type":"Buffer","data":[69,131,185,216,54,30,38,176,22,89,148,225,138,29,195,224,97,202,25,188]},"announce":[],"urlList":[]}}