{"title":"Mr Green's I Grow Chronic (AVI)","uid":4521728,"size":720786732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:45f953391ff3f2d90f1aeda1ebcdce62956df13d&amp;dn=Mr+Green%5C%27s+I+Grow+Chronic+%28AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Horrorhouse","files":-1,"time":1227192270,"description":"The movie, shot on a handheld home video camera in &quot;Beautiful British Columbia,&quot; is hosted by Mr. Green, an unsurprisingly mellow man in green body paint, coveralls, a bucket hat, sunglasses, and most disturbingly, green nail polish. Mr. Green wants to teach us all, his willing students, how to grow &quot;dank, fat, sticky nugs.&quot; Which sounds a little like a description of fresh dog shit, to me. But I&amp;#039;m not here the judge. \n\nFor a guy who&amp;#039;s obviously smoking a truckload of pot, Mr. Green strikes me as unusually industrious. The movie&amp;#039;s shot over a two-month period, in which Green sets up an admirably advanced hydroponics garden in his basement with the aid of simple hardware and home gardening supplies... which prompts me to wonder if the employees at Home Depot and the local plant nurseries know The Pot Guys when they see &amp;#039;em by their purchasing patterns.... Like lots of orchid potting rocks, but no orchids. Ever.\n\nThe main thing I learned from this movie was that you don&amp;#039;t actually smoke the leaves, despite their symbolic, ubiquitous nature in modern pot culture; you smoke the flowers. Which in retrospect makes perfect sense, since it&amp;#039;s called &quot;bud.&quot; I guess I&amp;#039;m just that fucking stupid. Another thing: Male plants are bad. They can&amp;#039;t be smoked since they don&amp;#039;t have flowers, and the pollen they throw off prompts the female plants to stop producing THC (the entire point of smoking pot in the first place) and start producing seeds, which apparently suck. Naturally, Mr. Green raises only females... which leads to some weirdly provocative commentary and behavior on his part. The plants are his &quot;girls&quot; and &quot;ladies.&quot; He rubs his face on their leaves, crooning at them suggestively and stroking their stems.\n\nPot also apparently comes in a number of varieties, although the movie never explains the differences between them. Mr. Green, for his part, grows &quot;white widow&quot; and &quot;AK47.&quot; It reminds me of the names rose fanciers give their special strains, except without all the gentility. And sobriety. After all, pot strains are named by potheads. And I can&amp;#039;t imagine anyone would smoke a strain called &quot;Romantica.&quot;\n\nWell, maybe.\n\nAfter Mr. Green apologizes to the plants for cutting them down, trimming them, and drying their buds, he smokes some... which isn&amp;#039;t actually shown. The lighter inches towards the bong, and the camera cuts away... which seems a little bizarre, given that the man&amp;#039;s just grown a shitload of a controlled substance in his cellar, on tape, for everyone to see.\n\nThe movies closes out with a second reminder that it was shot in British Columbia. I guess Mr. Green&amp;#039;s memory ain&amp;#039;t what it used to be.\n\nOverall, an interesting documentary that hasn&amp;#039;t really changed my ideas about marijuana. Personally, I&amp;#039;m for legalization, and would go so far as to have it regulated like alcohol; a small amount of home production allowed for personal use, large-scale manufacture handled by private enterprises, and penalties for driving stoned. But despite its educational intentions, I can&amp;#039;t imagine I Grow Chronic would do anything other than thoroughly intimidate the red-eyed couch jockeys out there who haven&amp;#039;t got the motivation to so much as change the television channel, never mind find someone to sell them aquarium silicone.\n\nThanks Ironcircus for the review.\n\n\nThis Movie is brought to you by Horror i&amp;#039;m seeding till my connection dies so gather round!","torrent":{"xt":"urn:btih:45f953391ff3f2d90f1aeda1ebcdce62956df13d","amp;dn":"Mr+Green%5C%27s+I+Grow+Chronic+%28AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45f953391ff3f2d90f1aeda1ebcdce62956df13d","infoHashBuffer":{"type":"Buffer","data":[69,249,83,57,31,243,242,217,15,26,237,161,235,205,206,98,149,109,241,61]},"announce":[],"urlList":[]}}