{"title":"TTC Great World Religions- Islam - John L. Esposito","uid":3376125,"size":177223120,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4754f9acf4fe514f6f58ce13ff66203322bf4b55&amp;dn=TTC+Great+World+Religions-+Islam+-+John+L.+Esposito&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"neofop","files":72,"time":1125295689,"description":"Great World Religions: Islam - Professor John L. Esposito, Georgetown University\n\nLecture 1 Islam Yesterday, Today, and Tomorrow\nLecture 2 The Five Pillars of Islam\nLecture 3 Muhammad - Prophet and Statesman\nLecture 4 God's Word - The Quranic Worldview\nLecture 5 The Muslim Community - Faith and Politics\nLecture 6 Paths to God - Islamic Law and Mysticism\nLecture 7 Islamic Revivalism - Renewal and Reform\nLecture 8 The Contemporary Resurgence of Islam\nLecture 9 Islam at the Crossroads\nLecture 10 Women and Change in Islam\nLecture 11 Islam in the West\nLecture 12 The Future of Islam\n\n\n\nJohn L. Esposito is University Professor, as well as Professor of Religion and International Affairs and of Islamic Studies at Georgetown University, Washington D.C.\nProfessor Esposito earned his Ph.D. at Temple University, his M.A. at St. John's University, and his B.A. at St. Anthony College.  At the College of the Holy Cross, he was Loyola Professor of Middle East Studies, Chair of the Department of Religious Studies, and Director of the Center for International Studies.  Professor Esposito was also Founding Director of the Center for Muslim-Christian Understanding:  History and International Affairs in the Walsh School of Foreign Service, Georgetown University.  He has served as President of the Middle East Studies Association of North America and of the American Council for the Study of Islamic Societies, as well as a consultant to governments, multinational corporations, and the media worldwide.\nProfessor Esposito specializes in Islam, political Islam, and the impact of Islamic movements from North Africa to Southeast Asia.  Editor-in-chief of The Oxford Encyclopedia of the Modern Islamic World, The Oxford History of Islam, and The Oxford Dictionary of Islam, his more than 25 books include: Unholy War: Terror in the name of Islam, The Islamic Threat: Myth or Reality?, Islam: The Straight Path, Islam and Politics, Islam and Democracy and Makers of Contemporary Islam (with John Voll), Political Islam: Radicalism, Revolution or Reform?, Iran at the Crossroads (with R.K. Ramazani), Islam, Gender and Social Change (with Yvonne Haddad), and Women in Muslim Family Law.","torrent":{"xt":"urn:btih:4754f9acf4fe514f6f58ce13ff66203322bf4b55","amp;dn":"TTC+Great+World+Religions-+Islam+-+John+L.+Esposito","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4754f9acf4fe514f6f58ce13ff66203322bf4b55","infoHashBuffer":{"type":"Buffer","data":[71,84,249,172,244,254,81,79,111,88,206,19,255,102,32,51,34,191,75,85]},"announce":[],"urlList":[]}}