{"title":"Ali Farka Toure Red &amp; Green","uid":6440706,"size":492692949,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47cc9d50c03fbf4dd65adccf473b592980c75d3a&amp;dn=Ali+Farka+Toure+Red+%26+Green&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ocnrf","files":27,"time":1306973633,"description":"The title of this remastered double CD set refers to the sleeve colours of the original albums, the last two of seven untitled discs he released on the Paris-based Sonodisc label between 1975 and 1988. Selections from the first five were reissued on World Circuit as Radio Mali in 1996, so this completes the picture of his early career, before he started using electric guitar and having celebrity guests on his albums.\n\nIn 1986 one of his Radio Mali recorded albums, started to generate great interest amongst radio d.j.s in London including Andy Kershaw and Charlie Gillett. In fact Kershaw had happened along one of the untitled releases in the bargain bin of a Parisian record shop, picking it up on a whim. With no information on the record sleeve everyone puzzled over this African musician who played the blues in such an individual way. \n\nAnne Hunt from World Circuit, travelling to Bamako was asked, by Andy Kershaw, to seek out this mysterious man. With the help of Toumani Diabate a broadcast was made on Radio Mali asking Ali to present himself. Ali had moved back to NiafunkÃƒÆ’Ã‚Â© four years earlier but at the time of the broadcast was visiting the capital. An invitation was made for Ali to perform in the U.K. and in 1987 showing no signs of nerves or unfamiliarity with his surroundings, and with absolute and supreme confidence in his music, he played a masterful series of shows winning audiences everywhere. In the same year his first recording, his S/T album, outside of Africa was an instant success for the World Circuit label. \n\n\nOld fans will recognise several tunes and riffs which have been reworked or reinterpreted on his subsequent international releases. Apart from some ngoni (the four-stringed West African lute, considered to be a precursor of the banjo) on Green, Ali is usually accompanied by the click and boom of calabash,\n\n\n\nScans included","torrent":{"xt":"urn:btih:47cc9d50c03fbf4dd65adccf473b592980c75d3a","amp;dn":"Ali+Farka+Toure+Red+%26+Green","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47cc9d50c03fbf4dd65adccf473b592980c75d3a","infoHashBuffer":{"type":"Buffer","data":[71,204,157,80,192,63,191,77,214,90,220,207,71,59,89,41,128,199,93,58]},"announce":[],"urlList":[]}}