{"title":"Tariq Ramadan - The Quest for Meaning (ePub/mobi) [2010]","uid":7702021,"size":3845864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:493770617ac5f97c0ab3942ca964d9d606b8ff8c&amp;dn=Tariq+Ramadan+-+The+Quest+for+Meaning+%28ePub%2Fmobi%29+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xemius","files":4,"time":1349553173,"description":"Source: usenet\n\nSummary\nRelease Date: September 28, 2010\nIn &quot;The Quest for Meaning&quot;, Tariq Ramadan, philosopher and Islamic scholar, invites the reader to join him on a journey to the deep ocean of religious, secular, and indigenous spiritual traditions to explore the most pressing contemporary issues. Along the way, Ramadan interrogates the concepts that frame current debates including: faith and reason, emotions and spirituality, tradition and modernity, freedom, equality, universality, and civilization. He acknowledges the greatest flashpoints and attempts to bridge divergent paths to a common ground between these religious and intellectual traditions. He calls urgently for a deep and meaningful dialogue that leads us to go beyond tolerant co-existence to mutual respect and enrichment. Written in a both direct and meditative style this is an important, timely and intelligent book that aims to direct and shape debate around the most important questions of our time.\n\nFormats provided are:\n.ePub -\nCompatible with most eReaders including the Apple iPad. If you wish to read .ePub doucuments on a Mac/PC I would recommend downloading Adobe Digital Editions. (Just google it and follow the instructions on the Adobe website.)\n.mobi -\nFor the Amazon kindle. Kindle for PC may also be available depending on your region.\n\nIf you like the book, support the author and buy it!","torrent":{"xt":"urn:btih:493770617ac5f97c0ab3942ca964d9d606b8ff8c","amp;dn":"Tariq+Ramadan+-+The+Quest+for+Meaning+%28ePub%2Fmobi%29+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"493770617ac5f97c0ab3942ca964d9d606b8ff8c","infoHashBuffer":{"type":"Buffer","data":[73,55,112,97,122,197,249,124,10,179,148,44,169,100,217,214,6,184,255,140]},"announce":[],"urlList":[]}}