{"title":"A History of the English Speaking Peoples - Volume 4","uid":6495233,"size":274233999,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4945003e3faa05d989fa984649f1f54fab59c5fc&amp;dn=A+History+of+the+English+Speaking+Peoples+-+Volume+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":11,"time":1309040330,"description":"Winston Churchill - A History of the English-speaking Peoples Vol 4 The Great Democracies (Unabridged) - Read by Christian Rodska\n\nSource CD\nDuration approx 12:40 hours \nFhG MPEG 1 Layer III 48 Kbps CBR \n44100Hz, 16-bit, Mono\n\n\nThe book\n\nThe fourth and last volume in Churchill's famous account spans 1815 to 1901. It closes when the British Empire is at its peak, with a staggering one-fifth of the human race presided over by the longest reigning monarch in British history: Queen Victoria.\n\nIn America he assesses the position of the &quot;Great Republic&quot; from slavery and secession to its position as a world superpower. He charts the rise of Germany and the unification of Italy and examines the situation in the Balkans in 1878, all of which had a deep impact not only on the war he was soon to fight, but on the geography of the European continent today.\n\n\nThe author\n\nSir Winston Churchill (1874-1965) was prime minister of Great Britain during World War II. Throughout his long and distinguished political career his writing was prolific.\n\n\nThe reader\n\nChristian Rodska (born 5 September 1945 in Northumberland) is a versatile English actor who has appeared in many television and radio series and narrated a number of audiobooks. His role in Follyfoot as Ron Stryker is well-remembered. More recently known for his narration of Ice Road Truckers and &quot; on Discovery Channel, as well as MegaStructures for United Kingdom channel five.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4945003e3faa05d989fa984649f1f54fab59c5fc","amp;dn":"A+History+of+the+English+Speaking+Peoples+-+Volume+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4945003e3faa05d989fa984649f1f54fab59c5fc","infoHashBuffer":{"type":"Buffer","data":[73,69,0,62,63,170,5,217,137,250,152,70,73,241,245,79,171,89,197,252]},"announce":[],"urlList":[]}}