{"title":"Enigma - MCMXC A.D. - Full entire album-in-one [AIO]","uid":3627014,"size":38754455,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:49ac2a29f9be34f4710906565b68aec71f69f873&amp;dn=Enigma+-+MCMXC+A.D.+-+Full+entire+album-in-one+%5BAIO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"emblazoner","files":2,"time":1172483312,"description":"Enigma:MCMXC a.D.\n(Charisma/Virgin - 1990)\n\nNot quite ambient, not quite dance, not quite new age, but really quite wonderful. I understand this CD was on the &quot;charts&quot; for 2 or 3 years and justifiably so (and very surprising in the hot today-cold tomorrow world of the pop charts).\nI can quite frankly live without the opening sequence, The Voice of Enigma. It&amp;#039;s a bit too &quot;new age&quot; for me, in the worst sense of that much maligned term.\n\nBut the next 3 songs span 20 of the smoothest recorded minutes I&amp;#039;ve ever heard! It all just oozes with a sophisticated coolness... the luscious beats, the breathy French(?) vocals, the silky instrumentation, and lastly, but certainly not least, oh, those chants.\n\nThe Principles of Lust is a 3-part song, a true masterpiece, bringing all those elements into play. Callas Went Away loses the male choir, but gives us soft piano tones, quiet bird sounds, and a female opera voice (Maria Callas maybe?). The monks return though, in Mea Culpa which sports a more aggressive beat, a bit of lite-metal guitar and some wonderful woodwind-type synths.\n\nThe Voice and The Snake leaves me with the same feeling as the opening track, although it utilizes a pseudo-mass of some sort. I just don&amp;#039;t get into it, but it&amp;#039;s short.\n\nWe get back to Enigma&amp;#039;s basics (electronic rythyms, beautifully new-agey synths, the vocals and choir) with Knocking on Forbidden Doors. It&amp;#039;s unfair to personally pigeonhole the wonderful artists involved, but in my mind, this is what they do best.\n\nThe formula works again in the final 3-part track, Back to the Rivers of Belief, up the point Curly M.C. (or whoever?) decides to sing. The track begins with some beautiful ambience, takes on a smooth beat, mixes in some low-key shards of speech and arabic-sounding chant, and then his vocal refrain comes in in an overly earnest pop-rock way. It doesn&amp;#039;t ruin the song, but weakens in it my opinion.\nI have to point one up on this. Despite a couple of weak links, the total package is one of true artistry. I&amp;#039;ve heard debates over where the whole chants and dance thing began, but there&amp;#039;s no doubt that this CD is what catapulted that particular sound combination into a limelight of its own. If you want to know more, there are plenty of good Enigma resources on the web.","torrent":{"xt":"urn:btih:49ac2a29f9be34f4710906565b68aec71f69f873","amp;dn":"Enigma+-+MCMXC+A.D.+-+Full+entire+album-in-one+%5BAIO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49ac2a29f9be34f4710906565b68aec71f69f873","infoHashBuffer":{"type":"Buffer","data":[73,172,42,41,249,190,52,244,113,9,6,86,91,104,174,199,31,105,248,115]},"announce":[],"urlList":[]}}