{"title":"NORTON.SYSTEMWORKS.2008.PREMIER.EDITION-EDGEISO","uid":4456707,"size":610043022,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4a0afcf8558f9fb0a21e5bdf5359dfd020dfa6ce&amp;dn=NORTON.SYSTEMWORKS.2008.PREMIER.EDITION-EDGEISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1224517086,"description":"_ _____  ______    _____     _ _____\n        ._/ \\___/._       _/  __/__._/ \\___/\n        |    __/__|  __       \\        __/___.     Living on the EDGE\n        |  _/     :    /    /   _/    /  _/      |\n\n\n        RELEASE NAME ..... Norton SystemWorks 2008 Premier Edition\n        SUPPLIER ......... Team EDGE\n        CRACKER .......... Team EDGE\n        PROTECTION ....... Some very xtream shit for sure :-)\n        RELEASE DATE ..... 19/08/2008\n        SIZE ............. 2 CDs\n        URL .............. http://www.symantec.com/norton/systemworks-premier\n\n\n\n  PRODUCT DESCRIPTION\n\n                     Norton SystemWorks 2008 Premier Edition\n\n   Norton SystemWorks Premier Edition defends your computer against spyware\n   and viruses, diagnoses and fixes hard drive problems, optimizes computer\n   performance, and protect your valuable files.\n\n   Defend against spyware and viruses, enhance your computer's performance,\n   and protect your valuable files with the powerful solutions in Norton\n   SystemWorks Premier Edition.\n\nWhat ever you think about Norton they still have some good stuff \nEnjoy\n\n   Norton SystemWorks includes Symantec's award-winning Norton AntiVirus\n   software to automatically block spyware, viruses, and other harmful\n   programs before they can penetrate your system.\n\n   Norton AntiVirus scans and cleans email and instant messaging attachments\n   and Internet downloads. Automatic updates keep your PC protected against\n   newly discovered threats throughout your service subscription.\n\n   &quot;Set-and-forget&quot; functionality delivers optimum protection right out of\n   the box, and Norton AntiVirus works quietly in the background, so you\n   can continue using your computer without disruption.\n\n   The powerful Norton SystemWorks suite also keeps your computer healthy\n   and running at peak performance. It diagnoses and fixes hard drive\n   errors, and removes unwanted Internet clutter such as cookies and web\n   files.\n\n   One-Button Checkup makes sure your PC is clean, repaired, and running at\n   top speed with the click of a button. And to improve your computer\n   experience, System Optimizer allows you to adjust Windows settings\n   from a single screen.\n\n   With digital photographs, tax records, and important documents stored on\n   your hard drive, it's essential to back up your data regularly.\n\n   The included Norton Save &amp; Restore software safeguards your computer and\n   valuable data with automatic backup and recovery. If disaster strikes,\n   you can quickly restore from system failures or recover lost or damaged\n   files.\n\n   System Requirements:\n\n     Windows XP SP2 Home / Professional\n     400MHz processor or higher\n     512MB RAM\n     750MB free hard disk space\n     Windows Vista Home Starter / Home Premium / Business / Ultimate\n\n  CD1: Norton SystemWorks 2008 Premier\n  CD2: Norton Recovery Disc (bootable disc)\n\n\n\n  INSTALLATION INSTRUCTIONS\n\n    1. Unrar, Burn or mount with Daemon Tools.\n\n    2. DISCONNECT FROM THE INTERNET! THIS IS IMPORTANT!\n\n    3. Run the installer, and run the keygen located in the EDGE dir.\n\n    4. Select your product then generate and copy the Product Key from\n       the keygen to the Norton Setup then press the I Agree button..\n\n    5. Complete installation and finally you will get to the activation,\n       it's important that you are NOT connected to the Internet!\n       Press the Next button.\n\n    6. A message box will come up telling you that you need Internet\n       connectivity to continue, just press the OK Button, and then press\n       the Next Button two times until Internet Explorer opens and tells\n       you &quot;Internet Explorer cannot display the webpage&quot;\n\n    7. Now copy the entire long URL from Internet Explorer into the keygen\n       in the Request URL field, select how many years you would like to\n       activate for and press the bottom most generate button.\n\n    8. Wait a few secs, magic is happening, then you will again be told\n       that you need Internet connectivity to create your Norton Account,\n       just press the Skip button.\n\n    9. Make a big smile as you see your subscription status :)\n\n   10. Enjoy a fully unlocked copy, and naturally DO NOT register this\n       software with Symantec, you can now reconnect to the Internet.\n\n\n\n       Schmoko, Schmaka, Schmoko! There is too much flerp going around!\n\n","torrent":{"xt":"urn:btih:4a0afcf8558f9fb0a21e5bdf5359dfd020dfa6ce","amp;dn":"NORTON.SYSTEMWORKS.2008.PREMIER.EDITION-EDGEISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a0afcf8558f9fb0a21e5bdf5359dfd020dfa6ce","infoHashBuffer":{"type":"Buffer","data":[74,10,252,248,85,143,159,176,162,30,91,223,83,89,223,208,32,223,166,206]},"announce":[],"urlList":[]}}