{"title":"Kasse Mady Diabate - Kassi Kasse [FLAC] TQMP","uid":5761283,"size":375032863,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4bb7e4b82b30f6af7cd46749da45c9e83ed71b78&amp;dn=Kasse+Mady+Diabate+-+Kassi+Kasse+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":21,"time":1281741602,"description":"Kasse Mady Diabate - Kassi Kasse\n2002\n\nThe Cuban-African connection heading for a full circle.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nDuring the 60s the Cuban government started to grant scholarships to African students. In 1964 a group of students from Mali went to Cuba to study at a music conservatory. The following year they had formed their own band, Maravillas de Mali (Mali's marvels). The played on Cuban TV and eventually recorded an LP. By the time they returned home they were asked to get rid of the Cuban sound and adopt a Malian repertoire. Around 1973 Kasse Mady joined the band, which later became National Badema du Mali. The band had more than a decade of success until the mid 80s when they broke and Kasse Mady Diabate left for Paris.\n\nParis was not good to him but he recorded a couple of albums. Back in Mali he got an invitation from Toumani Diabate to take part on Songhai 2 with Spanish band Ketama. Toumani invited him again for his project with Taj Mahal - Kulanjan. And later Kasse Mady became the lead singer on Toumani's Symmetry Orchestra. Eventually he had the opportunity to make this record. It's no surprise Toumani makes a guess appearance here. And so is Buena Vista Social Club's Cachaito Lopez.\n\nIf you've seen Win Wender's Buena Vista Social Club, you probably remember a moment where Ry Cooder explains the original project was meant to be an album with Cuban and African musicians. Although no names are given one has to wonder if the African musicians were in fact Toumani Diabate and Kasse Mady Diabate, among others. That could have been such fantastic record!\n\nFast forward to 2010.\n\nToumani Diabate, Buena Vista's Eliades Ochoa, Kasse Mady Diabate, Bassekou Kouyate, Djelimady Tounkara and others are up to something. It's called Afro-Cubism. Sadly some Cuban musicians, that could have been here, have passed away. Still, this is the original dream. And it looks like it's coming true.\n\nIn the meantime, enjoy this great album by one of the most treasured singers from Mali.\n\n\nReview --\nRelaxed, lovely set of Mali music recorded on location in a hut in Kela.\n\nTraditional Malian, or Mande music, has captured the imagination of Western music lovers like almost no other African music. It possesses a translucent purity both in sound and delivery, such that an understanding of the songs meanings become almost secondary to the atmosphere they generate.\n\nKasse Mady Foday Diabate is as well-qualified as any Malian musician to take us on this wonderful reconnaissance tour of Mande music's many facets.\n\nThe instrumentation throughout is traditional but robust. One composition may highlight the possibilities of the balafon (xylophone) whilst another concentrates on the ngoni (lute) or Kora(21-string harp).\n\nThere are also two Cuban style charanga pieces, led by the flute of Dramane Coulibaly who formed part of the famous 70s Malian charanga band Las Maravillas De Mali. These are underpinned by the surprising but welcome guest appearance of renowned Cuban bassist Orlando Cachaito Lopez.\n\nProducer Lucy Duran arranged for these recordings to be made largely on site, in a hastily converted hut in Kela, the village home of many of Mali's finest jelis, or praise singers. The sense of midday heat and rural tranquillity are almost palpable as the musicians work their way unhurriedly through tracks like 'Eh Ya Ye', a cautionary tale about not exaggerating one's abilities.\n\nThere's a traditional reworking of Kasse Mady's 80s Paris dancefloor hit 'Kaba Mansa' and the beautiful Jembe dance song 'Danya'. The lovely Cuban-style dance tune, 'Balomina Mwanga', is sung in Spanish but the main languages used here are Maninka and Bamana.\n\nDuran's fascinating liner notes do justice to her profound knowledge of, and love for Malian culture. The painstaking preparation that clearly went into the making of this record is an object lesson for those sceptics who claim that music sounds the same wherever it's recorded.\n\nIt doesn't, and here's the living proof.\n-- BBC. &lt;a href=&quot;\nhttp://www.bbc.co.uk/music/reviews/vrbd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/music/reviews/vrbd&lt;/a&gt;\n\nTrack List\n01- Eh Ya Ye\n02- Kaba Mansa\n03- Maimouna\n04- Nyamalo\n05- Jon Kunandi\n06- N'i Ma Sori\n07- Namanike\n08- Fununke Saya\n09- Naaren\n10- Balomina Mwanga\n11- Balakono\n12- Lafia Jeli\n13- Madu Jeli\n14- Danya\n\nEAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:4bb7e4b82b30f6af7cd46749da45c9e83ed71b78","amp;dn":"Kasse+Mady+Diabate+-+Kassi+Kasse+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bb7e4b82b30f6af7cd46749da45c9e83ed71b78","infoHashBuffer":{"type":"Buffer","data":[75,183,228,184,43,48,246,175,124,212,103,73,218,69,201,232,62,215,27,120]},"announce":[],"urlList":[]}}