{"title":"Melissa Auf der Maur - Out of Our Minds 2010 (flac)","uid":6440452,"size":373374321,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4cd7ebc3f6fad797def9680e78ec3e749a727438&amp;dn=Melissa+Auf+der+Maur+-+Out+of+Our+Minds+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1306963553,"description":"Melissa Auf der Maur (born March 17, 1972) is a Canadian rock musician from Montreal, Quebec, Canada. Her career has included 5 years as bassist with the band Hole and she later toured with The Smashing Pumpkins for their 2000 tour. She is also a published photographer. \nHer second solo album, Out of Our Minds, was released on March 30, 2010. Released six years after her self-titled debut, the album was also accompanied by a feature film and comic of the same name. According to reports, the album has been completed since 2007. In three years it took her to record the album, Auf der Maur stated that there were many stops and starts while she was exploring alternative creative outlets.  (wikipedia)\n\nWith Courtney Love hogging the spotlight with her antics, it's easy to forget that there were actually some very solid musicians in Hole.  One of those, Montreal's own Melissa Auf der Maur, has returned with an ambitious multimedia project which includes the new album Out of Our Minds.\nOpening with The Hunt, a track that makes you feel like prey being chased through the foggy woods, one is quickly immersed in the dark mystical world that Auf der Maur has constructed.  The intense sound of Isis Speaks or the incendiary title track are far from the poppy grunge of Love's band.\nJust in case you weren't sure the mood was dark and brooding enough, Auf der Maur even performs a duet with the most evil man in rock himself, Glenn Danzig.\nAuf der Maur proves she's not afraid of the occasional hook either.  Tracks like Follow the Map and Meet Me (On the Dark Side) may not be singalongs, but they are definitely catchy enough to make you come back again and again.\nOut of Our Minds is definitely not for everyone.  It's got a vibe that will turn off those who like pop sensibilities, and it's far from a singles record.  But as an aural experience it's quite unique.   (snobsmusic.net)\n\n\n    1. The Hunt\n    2. Out of Our Minds\n    3. Isis Speaks\n    4. Lead Horse\n    5. Follow the Map\n    6. 22 Below\n    7. Meet Me (On the Dark Side)\n    8. This Would Be Paradise\n    9. Father's Grave\n   10. The Key \n   11. The One\n   12. 1,000 Years\n","torrent":{"xt":"urn:btih:4cd7ebc3f6fad797def9680e78ec3e749a727438","amp;dn":"Melissa+Auf+der+Maur+-+Out+of+Our+Minds+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cd7ebc3f6fad797def9680e78ec3e749a727438","infoHashBuffer":{"type":"Buffer","data":[76,215,235,195,246,250,215,151,222,249,104,14,120,236,62,116,154,114,116,56]},"announce":[],"urlList":[]}}