{"title":"Sam The Sham &amp; The Pharaohs - The Best Of [Polydor] (1966) [","uid":8691970,"size":173362664,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ced432fec23d52c19856eb98c9ff31154e9525b&amp;dn=Sam+The+Sham+%26amp%3B+The+Pharaohs+-+The+Best+Of+%5BPolydor%5D+%281966%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WasAtWoodstock","files":20,"time":1373900123,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nSam The Sham &amp; The Pharaohs - The Best Of Sam The Sham &amp; The Pharaohs [Polydor] (1966) [1986]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41fOq%2B5-00L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41fOq%2B5-00L._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Steve Huey):\n\nBest known for their 1965 smash &quot;Wooly Bully,&quot; which helped introduce Tex-Mex rhythms to mainstream rock &amp; roll, Sam the Sham &amp; the Pharaohs were formed in Dallas by lead singer Domingo Samudio, who took the name Sam the Sham from a joke about his inability as a vocalist. The Pharaohs consisted of guitarist Ray Stinnet, bassist David Martin, saxophonist Butch Gibson, and drummer Jerry Patterson. Before hitting it big with &quot;Wooly Bully,&quot; a song about Samudio's cat, they recorded the independent single &quot;Haunted House,&quot; which helped the band get a deal with MGM. Following &quot;Wooly Bully,&quot; the group recorded a series of largely novelty singles, but only &quot;Li'l Red Riding Hood&quot; approached the success of its predecessor. Frustrated at being perceived as a talentless novelty act, Samudio broke up the Pharaohs in 1967 and recorded as the Sam the Sham Revue, and adopted the name Sam Domingo in 1970. His lone solo LP, Sam, Hard &amp; Heavy, featured slide guitarist Duane Allman, but failed to establish him as a major talent. Samudio contributed two songs to the 1982 film The Border and later moved to Memphis and became a street preacher. &quot;Wooly Bully,&quot; of course, remains a bar band staple.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/sam-the-sham-the-pharaohs-p5345/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/sam-the-sham-the-pharaohs-p5345/biography&lt;/a&gt;\n\nAll Music Album Review (by Eugene Chadbourne):\n\nLike the Rolling Stones' greatest-hits collection Big Hits: High Tides and Green Grass, this album is an ideal souvenir of a well-loved '60s group that appeals from both the visual and musical standpoint. In the days before music videos, these album covers with their collections of photos were sometimes the only visual information fans would have about the bands they were listening to. This album comes in a gatefold cover, sturdy as all get out, with a stunningly warm job of color printing. The various shots of Sam the Sham and his Pharoahs are appealing for a variety of reasons (the guy with the bugged-out eyes who looks like Peter Lorre, for instance). Domingo Samudio (that's Sam) comes across as an amusing bloke, and even if one didn't find these fellows fun to look at pictures of, then there's the subject of the clothes they are wearing. Some fashion mavens have expressed great delight at both the paisley shirts worn on this cover and the Beatles boots the fellows use to stomp a circle around a tree on the back cover. Now moving on to something much more important, there is the music. ...\n\nRead all of the review at: &lt;a href=&quot; http://www.allmusic.com/album/the-best-of-sam-the-sham-the-pharaohs-polygram-r17317/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-best-of-sam-the-sham-the-pharaohs-polygram-r17317/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B001E6DT8Y&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B001E6DT8Y&lt;/a&gt;\n\nTrack List:\n\n01. Wooly Bully\n02. Red Hot\n03. Standing Ovation\n04. Mystery Train\n05. Ju Ju Hand\n06. Ready Or Not\n07. The Hair On My Chinny Chin Chin\n08. El Toro De Goro (The Peace Loving Bull)\n09. (I'm In With) The Out Crowd\n10. I Wish It Were Me\n11. Ring Dang Doo\n12. Li'l Red Riding Hood\n","torrent":{"xt":"urn:btih:4ced432fec23d52c19856eb98c9ff31154e9525b","amp;dn":"Sam+The+Sham+%26amp%3B+The+Pharaohs+-+The+Best+Of+%5BPolydor%5D+%281966%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ced432fec23d52c19856eb98c9ff31154e9525b","infoHashBuffer":{"type":"Buffer","data":[76,237,67,47,236,35,213,44,25,133,110,185,140,159,243,17,84,233,82,91]},"announce":[],"urlList":[]}}