{"title":"Comets on Fire - Bong Voyage(vinyl rip)","uid":4119046,"size":55982374,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4cf33f532b6ce5f41b2af0b2b9da55bdcb488af8&amp;dn=Comets+on+Fire+-+Bong+Voyage%28vinyl+rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheSunAlsoRises","files":7,"time":1207450689,"description":"REVIEW:\n\n&quot;The dark sibling, the chained-up-twin-in-the-closet of Blue Cathedral, is a mysterious release entitled Bong Voyage (a great and witty title, really). From what I&amp;#039;ve gleaned off the internet in relation to the origin of this sucker, I gather that, while the band itself did not release this &quot;bootleg,&quot; they knew or were in contact with those who did. This could correspond with the fact that it seems to be more a parody or celebration of a bootleg than an actual one. The cover art is great drug-metal art, complete with one or more hidden messages (&quot;dave sweetapple&quot;?) and satanic leanings. The title Bong Voyage can&amp;#039;t be found anywhere on the sleeve, nor a tracklisting, line-up, label name, dates...blank black labels...no info included, actually more boot than most boots. Ultra-bootleg. And then there&amp;#039;s the actual sound of the recording, like a badly made mix-tape someone whipped up in a mad rush. The first song is lowest-fi noise; next song cuts in already in progress; next we get a section of random crowd noise; next up is the very end note of another live song, followed by the crowd all goin&amp;#039; &quot;WOOOO!&quot; for twenty seconds, followed finally by the next song. It&amp;#039;s quite insane that anyone would actually commit this to vinyl, it all just sounds like a poorly edited tape release. The twist is that it&amp;#039;s in fact all completely awesome live recordings and beautiful weird demo-type stuff (there is even a song very similar to Chasny&amp;#039;s opus on Field Recordings, starts with his acoustic improv and then is swallowed by a super-distort wailing solo...is that a moog er what the f**k is it?). This is what you miss out on with Blue Cathedral, and is actually the perfect sister album. The main issue for one to consider is whether or not one enjoys crazy f**ked-up live recordings or not. Personally, I enjoy the entire spectrum, from polished studio masterpiece to raw noise jam taped on a handheld from across the room. This is definitely the latter, but maybe if you&amp;#039;ve seen Comets on Fire live you will be leaning towards this exploding mystery bag album, more of a document of what these serious rockers actually do dish up when you step out to see em. &quot;","torrent":{"xt":"urn:btih:4cf33f532b6ce5f41b2af0b2b9da55bdcb488af8","amp;dn":"Comets+on+Fire+-+Bong+Voyage%28vinyl+rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cf33f532b6ce5f41b2af0b2b9da55bdcb488af8","infoHashBuffer":{"type":"Buffer","data":[76,243,63,83,43,108,229,244,27,42,240,178,185,218,85,189,203,72,138,248]},"announce":[],"urlList":[]}}