{"title":"[Wii] Metroid Prime Trilogy [PAL] [WiiTorrentz]","uid":5256453,"size":8432230022,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:4dc90ed44c32580858d949f44faad04cfcebb757&amp;dn=%5BWii%5D+Metroid+Prime+Trilogy+%5BPAL%5D+%5BWiiTorrentz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ecabuk","files":-1,"time":1262564840,"description":"\n\nAll three games in the trilogy have been crafted into one unbelievable package, with a newly implemented exclusive title menu with direct access to any of the three titles. Not only that, but players can also earn awards by collecting tokens through their progress across the trilogy, making for an ideal award system. Both Metroid Prime and Metroid Prime 2: Echoes games have been updated with the refined control system of Metroid Prime 3: Corruption. Moving is done with the Control Stick and the Nunchuck controller, while the Wii Remote controller controls the Arm Cannon's crosshairs, allowing the player to smoothly and more accurately aim by pointing at the screen. The camera will move where the player points, making for more intuitive control, and allowing players to look around and attack while moving. Three different sensitivity settings allow everyone from beginners to FPS veterans to find a response speed to their liking. In addition to the new control, the Nintendo GameCube games have new features and improvements such as 16x9 wide-screen presentation, and improved HUD system to accommodate the new pointer control, some graphic improvements, and newly added new difficulty levels.","torrent":{"xt":"urn:btih:4dc90ed44c32580858d949f44faad04cfcebb757","amp;dn":"%5BWii%5D+Metroid+Prime+Trilogy+%5BPAL%5D+%5BWiiTorrentz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dc90ed44c32580858d949f44faad04cfcebb757","infoHashBuffer":{"type":"Buffer","data":[77,201,14,212,76,50,88,8,88,217,73,244,79,170,208,76,252,235,183,87]},"announce":[],"urlList":[]}}