{"title":"Librivox M4B - Antichrist by Friedrich Nietzsche","uid":5523201,"size":59265737,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4e26e99d03547a7fdf9c00821cd6fceaf5b37d23&amp;dn=Librivox+M4B+-+Antichrist+by+Friedrich+Nietzsche&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VoxRatio","files":-1,"time":1272695660,"description":"An M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n\n\n\nSave for his raucous, rhapsodical autobiography, Ecce Homo, The Antichrist is the last thing that Nietzsche ever wrote, and so it may be accepted as a statement of some of his most salient ideas in their final form. Of all Nietzsche's books, The Antichrist comes nearest to conventionality in form. It presents a connected argument with very few interludes, and has a beginning, a middle and an end.\n\n(Summary from the translator's Introduction).\n","torrent":{"xt":"urn:btih:4e26e99d03547a7fdf9c00821cd6fceaf5b37d23","amp;dn":"Librivox+M4B+-+Antichrist+by+Friedrich+Nietzsche","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e26e99d03547a7fdf9c00821cd6fceaf5b37d23","infoHashBuffer":{"type":"Buffer","data":[78,38,233,157,3,84,122,127,223,156,0,130,28,214,252,234,245,179,125,35]},"announce":[],"urlList":[]}}