{"title":"King Curtis - Everybody's Talkin' (1970) MP3@256kbps","uid":9623299,"size":84191600,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f3940bff8f50ffcd0ca8053d0b48706e6821e96&amp;dn=King+Curtis+-+Everybody%27s+Talkin%27+%281970%29+MP3%40256kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":12,"time":1392550585,"description":"King Curtis employed a powerhouse lineup on Everybody's Talkin', including soul-jazz luminaries Bernard Purdie, Cornell Dupree, Billy Butler, Billy Preston, and the Memphis Horns. As can be expected, the tunes here are relatively indicative of the times and range from greasy Southern ballads to more funky material. Among the highlights are the slow, loping funk of &quot;If I Were a Carpenter&quot; (which sounds like any number of Pete Rock's mid-song interludes), the title track, and the near identical cover of King Floyd's &quot;Groove Me.&quot; Best of all, though, is &quot;Ridin' Thumb&quot; which appears both in vocal and instrumental form. The vocal version begins the second side of the LP and is clearly the most worthy single on the album. The instrumental, on the other hand, bookends the set (as well as the side) and is very clearly the rest of the vocal take after Curtis switched from vocals to tenor sax. Seeing as the musicians were already well into the groove by the time the instrumental half of the tune kicks in, the argument can be made that &quot;Ridin' Thumb-Jam&quot; is the is the funkier of the two and a fine example of soul-jazz at its best. Recommended for fans of the genre.\n\nby Brandon Burke/All Music Guide","torrent":{"xt":"urn:btih:4f3940bff8f50ffcd0ca8053d0b48706e6821e96","amp;dn":"King+Curtis+-+Everybody%27s+Talkin%27+%281970%29+MP3%40256kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f3940bff8f50ffcd0ca8053d0b48706e6821e96","infoHashBuffer":{"type":"Buffer","data":[79,57,64,191,248,245,15,252,208,202,128,83,208,180,135,6,230,130,30,150]},"announce":[],"urlList":[]}}