{"title":"Fiber Optic Data Communication {BBS}","uid":6636541,"size":14005731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f6f66593e28aab0e5dba5cb6d44fcf8a8100bf9&amp;dn=Fiber+Optic+Data+Communication+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314581188,"description":"This book is an authoritative review of current and future trends in the field of telecommunications. Written by industry experts who are developing leading-edge data communication networks, Fiber Optic Data Communication provides professionals and students alike with a look at emerging technologies and their applications. Four of the chapters have been revised from DeCusatis's best-selling book, Handbook of Fiber Optic Data Communications; the remaining eight chapters are all new. Seven helpful appendices, a glossary, and a list of technical acronyms are included. This book can stand alone or as a companion volume to DeCusatis: Handbook of Fiber Optic Data Communication, Second Edition (February 2002, ISBN: 0-12-207891-8).\n\n* Includes emerging technologies such as Infiniband, 10 Gigabit Ethernet, and MPLS Optical Switching\n* Describes leading edge commercial products, including LEAF and MetroCore fibers, dense wavelength multiplexing, and Small Form Factor transceiver packages\n* Covers all major industry standards, often written by the same people who designed the standards themselves\n* Includes an expanded listing of references on the World Wide Web, plus hard-to-find references for international, homologation, and type approval requirements\n* Convenient tables of key optical datacom parameters and glossary with hundreds of definitions and acronyms\n* Industry buzzwords explained, including SAN, NAS, and MAN networking\n* Datacom market analysis and future projections from industry leading forecasters\nFrom the Back Cover\nIn correspondence with the widely popular and original Handbook of Fiber Optic Data Communication First Edition, and now updated Second Edition (2001), experts in both industry and academia have compiled an excellent addition to the field of Fiber Optics. This work revisits and expounds on the future technology section of the first Handbook, while also including 8 new chapters, plus a glossary and list of technical acronyms. New standards such as Infiniband, and new technologies such as small form factor optical devices, wavelength multiplexing, and optical backplanes are included. Information is also provided for end users of optical datacom, such as description and comparisons of clustered parallel computing architectures and forecasts of what the next 25 years will bring in this field from industry experts. Specialists, engineers, and scientists within this field will benefit from this up to date collection of pertinent information as will those end users looking for answers to their everyday datacom questions.\n\nÃ‚Â· Emerging technologies and applications and the latest revisions to other industry standards, complied by the same technical professionals who designed the standards\nÃ‚Â· Expanded listing of references on the World Wide Web, plus hard-to-find references for international, homologation, and type approval requirements\nÃ‚Â· Convenient tables of distances, data rates, interfaces, and other key parameters for all major datacom protocols\nÃ‚Â· New glossary with hundreds of definitions and acronyms, explaining industry buzzwords and jargon in easy to understand terms\nÃ‚Â· Updated material on designing, testing, and servicing fiber optic networks\n\nProduct Details\n\n    * Hardcover: 568 pages\n    * Publisher: Academic Press; 1 edition (March 22, 2002)\n    * Language: English\n    * ISBN-10: 0122078926\n    * ISBN-13: 978-0122078927","torrent":{"xt":"urn:btih:4f6f66593e28aab0e5dba5cb6d44fcf8a8100bf9","amp;dn":"Fiber+Optic+Data+Communication+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f6f66593e28aab0e5dba5cb6d44fcf8a8100bf9","infoHashBuffer":{"type":"Buffer","data":[79,111,102,89,62,40,170,176,229,219,165,203,109,68,252,248,168,16,11,249]},"announce":[],"urlList":[]}}