{"title":"Au-delà de la médecine, notre esprit","uid":13449216,"size":3683047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:506d8fbce377c6d8cbcfb116bc13e2467093252e&amp;dn=Au-del%26agrave%3B+de+la+m%26eacute%3Bdecine%2C+notre+esprit&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":3,"time":1454781882,"description":"Lissa Rankin - Au-delà de la médecine, notre esprit\r\nAdA | ISBN : 9782897336981 | 2014-03 | EPUB | 268 pages | 3 MB\r\n\r\nNous avons été programmés pour croire que, lorsque nous tombons malades, nos gènes sont à blâmer - à moins que ce soit notre malchance - et que seuls les médecins peuvent nous mettre sur la voie de la bonne santé. Pendant des années, c'est ce qu'a cru Dre Lissa Rankin. Mais lorsque sa propre santé s'est mise à défaillir, elle a pris conscience que les traitements médicaux proposés par notre société occidentale étaient non seulement inefficaces, mais qu'ils empiraient son état de santé. Elle a donc décidé de prendre les choses en main.\r\n\r\nGrâce à ses recherches, la Dre Rankin a découvert qu'un élément crucial faisait défaut à la médecine qu'elle était habituée à pratiquer : une reconnaissance de la capacité innée de notre corps à s'autoréparer et de notre faculté à influencer ses mécanismes d'autoréparation par le pouvoir de notre esprit. Afin de mieux comprendre ce phénomène, elle s'est plongée dans la lecture d'articles médicaux révisés par des pairs et a trouvé la preuve que la capacité du corps à se guérir était démontrée depuis plus de 50 ans.\r\n\r\nEn se basant sur des cas extraordinaires de rémission spontanée, Dre Rankin nous montre de quelle façon nos pensées, nos sentiments et nos croyances influencent la physiologie de notre corps. Elle nous présente les données scientifiques prouvant que la solitude, le pessimisme, la dépression, la peur et l'anxiété portent atteinte à notre santé, tandis que les relations humaines, la gratitude, la méditation, le sexe et l'expression de soi déclenchent les processus d'autoguérison. \r\n\r\nDans la dernière partie de ce livre, vous découvrerez un programme unique en six étapes qui vous aidera à découvrir les dysfonctionnements de votre propre existence - spirituels, créatifs, environnementaux, alimentaires, professionnels et personnels - pour vous permettre d'élaborer ensuite un plan de traitement personnalisé visant à solliciter les éléments de vie favorables à la santé. Vous apprendrez à écouter les chuchotements de votre corps avant qu'ils ne se transforment en cris menaçants et à suivre votre guide intérieur lors de prises de décisions concernant votre santé et votre vie.\r\n\r\nLorsque vous terminerez la lecture de ce livre, vous aurez posé votre propre diagnostic personnel, rédigé votre prescription et créé un plan d'action clair pour préparer votre corps à vivre des miracles","torrent":{"xt":"urn:btih:506d8fbce377c6d8cbcfb116bc13e2467093252e","amp;dn":"Au-del%26agrave%3B+de+la+m%26eacute%3Bdecine%2C+notre+esprit","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"506d8fbce377c6d8cbcfb116bc13e2467093252e","infoHashBuffer":{"type":"Buffer","data":[80,109,143,188,227,119,198,216,203,207,177,22,188,19,226,70,112,147,37,46]},"announce":[],"urlList":[]}}