{"title":"FITZCARRALDO - POPOL VUH[TNTVILLAGE]","uid":5274625,"size":68753900,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50ee91c5ccff63c0a52b4f9da356af8b30ea63b6&amp;dn=FITZCARRALDO+-+POPOL+VUH%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":15,"time":1263333435,"description":"[b][color=blue] POPOL VUH [/COLOR]\n\n[color=red]FITZCARRALDO[/color][/b]\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n[IMG]http://img525.imageshack.us/img525/1593/fitzcarraldocoveryo0.jpg[/IMG]\n\n[b][color=green]::-&gt;CHI SONO I POPOL VUH&lt;-::[/color][/b]\n\nI Popol Vuh furono un gruppo tedesco che univa Kosmische Musik, proto-New Age, e Krautrock, fondato da Florian Fricke nel 1970 insieme con Holger Trulzsch \n\n(percussioni) e Frank Fiedler (strumenti elettronici). Altri importanti componenti delle due decadi successive furono Daniel Fichelscher e Bob Eliscu.\n\nLa band comiciÃƒÂ² suonando uno stile di musica elettronica che anticipava l'Ambient di Brian Eno e Robert Fripp, come risulta chiaro dal primo disco, \n\nAffenstunde, ispirato dall'invenzione dei sintetizzatori Moog. Questo stile continuÃƒÂ² solo per un altro disco, In Den Garten Pharaos. Dopo queste due uscite, \n\nFricke abbandonÃƒÂ² quasi completamente l'utilizzo di strumenti elettronici, in favore di composizioni dominate dal pianoforte. Il terzo disco, Hosianna Mantra \n\n(da molti considerato il loro massimo capolavoro) cominciÃƒÂ² l'esplorazione di temi religiosi o, comunque, marcatamente spirituali. Il gruppo si evolse \n\nulteriormente includendo tutte le tipologie di strumenti: aerofoni, percussioni e cordofoni, sia elettrici sia acustici, vennero combinati per creare un'aura \n\nmistica che rendesse la loro musica spirituale ed introspettiva.\n\nI Popul Vuh influenzarono molte altre band Europee grazie alla loro unica strumentazione, simultaneamente soft ed elaborata, che si ispirava a sua volta alla \n\nmusica tibetana, Africana e alle CiviltÃƒÂ  precolombiane. In questo modo crearono una sorta di &quot;musica per sognare&quot;, salendo di un gradino al di sopra del Rock \n\npsichedelico. I Popol Vuh sono infatti considerati da molti come i precursori della World Music e della musica New Age.\n\nTra le altre cose, il gruppo contribuÃƒÂ¬ ad alcune colonne sonore dei film di Werner Herzog, inclusi &quot;Nosferatu, principe della notte&quot;, &quot;Aguirre, furore di \n\nDio&quot;, &quot;Fitzcarraldo&quot; e &quot;L'enigma di Kaspar Hauser&quot; (in cui, tra l'altro, compariva anche Fricke).\n\nFlorian Fricke morÃƒÂ¬ a Monaco di Baviera il 29 dicembre 2001. In seguito a questo tragico evento il gruppo si sciolse.\n\n\n[b][color=green]::-&gt;DATI ALBUM&lt;-::[/color][/b]\n\n[b]Titolo:[/b] Fitzcarraldo\n[b]Data Uscita:[/b] 2005\n[b]Genere:[/b] Colonna Sonora\n[b]Etichetta:[/b] SPV Recordings\n[b]Durata:[/b] 43'47\n\n[b][color=green]::-&gt;TRACKLIST&lt;-::[/color][/b]\n\n1. Wehe Khorazin \t\n2. Scene from Ernani \t\n3. Engel Der Luft \t\n4. Ridi Pagliacci  Caruso/Leoncavallo \t\n5. O Paradiso  Caruso/Meyerbeer \t\n6. Kind Mit Geige (Traditional) \t\n7. Im Garten Der Gemeinschaft \t\n8. Blasmusik (Traditional) \t\n9. Tod Und VerklÃƒÂ¤rung (Excerpt) R. Strauss \tListen\n10. Musik Aus Burundi (Traditional) \t\n11. Il Sogno  Manon/Verdi \t\n12. Quartett  Rigoletto/Verdi \t\n13. Oh Mimi, Tu Piu Non Torni  Caruso/Puccini \t\n14. Als Lebten Die Engel Auf Erden \t\n15. A Te O Cara, Amor Talora - I Puritani/Bellini \n\n[b][color=green]::-&gt;NOTE ED ANALISI MUSICALE: &lt;-::[/color][/b]\n\n CREDITS:\nRegia di Werner Herzog\nSoggetto e Sceneggiatura di Werner Herzog\nProduzione: W.Herzog Filmproduktion, Lucki Stipetic, Pro-Jet Filmproduction, ZDF\nMusica: Popol Vuh, Verdi, Leoncavallo, Mayerbeer, Massenet, Puccini, Bellini, Strauss\nInterpreti principali: Klaus Kinski, Claudia Cardinale, JosÃƒÂ© Lewgoy, Miguel Angel Fuentes, Paul Hittscher, Peter Berling, Huerequeque Enrique Bohorquez, \n\nGrande Othelo.\n\nNOTE MUSICALI:\nLa musica del film ÃƒÂ¨ per la maggiore tratta da opere liriche di Leocavallo, Meyerbeer, Puccini, prelevate da vecchie registrazioni cantate da Enrico Caruso. \n\nCi sono un paio d'estratti dalle opere di Giuseppe Verdi, c'ÃƒÂ© anche un pezzo di Strauss ed altri di Bellini e Massenet piÃƒÂ¹ qualche etnico registrato in presa \n\ndiretta durante le riprese. Per quanto concerne la musica dei Popol Vuh, questa non ÃƒÂ¨ inedita, si tratta di quattro brani prelevati dagli album &quot;Sei Still, \n\nWisse Ich Bin&quot; e &quot;Die Nacht der Seele&quot;.\n\n\n[b][color=green]::-&gt;DATI TECNICI&lt;-::[/color][/b]\n\n[color=red][b]\nMp3 a 192 kbps\nAllegata locandina\n\n[/b][/color]\n[color=RED][B]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:50ee91c5ccff63c0a52b4f9da356af8b30ea63b6","amp;dn":"FITZCARRALDO+-+POPOL+VUH%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50ee91c5ccff63c0a52b4f9da356af8b30ea63b6","infoHashBuffer":{"type":"Buffer","data":[80,238,145,197,204,255,99,192,165,43,79,157,163,86,175,139,48,234,99,182]},"announce":[],"urlList":[]}}