{"title":"Yum Yum - Yum Yum Album","uid":7659012,"size":102701163,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:51049d2e6ee0d148c7497c6b7c98f874108a0974&amp;dn=Yum+Yum+-+Yum+Yum+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":13,"time":1348253410,"description":"Raised in suburban Canada, Yum Yum developed an acute acumen\nin the area of music production at a very early age. Heralded as a\npop prodigy before he was a teen, his talents were quickly\nleveraged by many of the most popular artists and critically\nacclaimed producers working in music today. While monetarily\ncompensated generously, the nature of the industry dictated that\nYum Yum could receive no credit for his work. As an internationally\nin-demand ghostwriter and phantom producer working out of\nPortland, Oregon, Yum Yum has accrued a significant amount of\nfunds which he has invested entirely in furthering his research into\nthe power of music.\n\nBased on a hypothesis that specific sonics can nurture and heal\nhumans on a physiological level, Yum Yum utilizes ancient,\ncutting-edge methods of sound generation to isolate temporal\nwavelets that stimulate and control a multitude of bodily functions.\nExamples of successes in his experimentation include: Synthesizing\nrhythms that reverse the progressively decreasing heart rate\nmammals exhibit as they age, identifying audio harmonic\nfrequencies that trigger an expansion in a subjectÊ¼s psychological\ncapability for empathy, and recognizing specific arrangements of\nspeech that elicit the production of endorphins in listeners.\nCombining his savvy in pop arrangement with his innovative\nscientific findings, Yum Yum shares the conclusive results on his\nself-titled debut, releasing July 25th, 2012 on Futro Records","torrent":{"xt":"urn:btih:51049d2e6ee0d148c7497c6b7c98f874108a0974","amp;dn":"Yum+Yum+-+Yum+Yum+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51049d2e6ee0d148c7497c6b7c98f874108a0974","infoHashBuffer":{"type":"Buffer","data":[81,4,157,46,110,224,209,72,199,73,124,107,124,152,248,116,16,138,9,116]},"announce":[],"urlList":[]}}