{"title":"Papers2 v 2.6.2 [k'd] By LfsCrew.zip","uid":8519430,"size":56031320,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:52a211205da311226b915cd4acdc14d00aaefc9d&amp;dn=Papers2+v+2.6.2+%5Bk%27d%5D+By+LfsCrew.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skizzolfs","files":1,"time":1369868775,"description":"Name: PapersV2\nVersion:  - 2.6.2\n\nMac Platform: Intel\nIncludes: K\n\nOS version: OS X 10.6 or later\n\nLink for more information: http://www.mekentosj.com/papers/\n\nPapers is your personal library of Science.\n\nRead, Write, Cite. Your research will never be the same with Papers2 and Magic Manuscripts.\n\nPapers revolutionizes the way you deal with your research documents. It allows you to search for them, download and organize them together with supplementary material, allows you to read them full screen, highlight and keep notes, sync them to your iPad or iPhone, cite them in your favorite word processor, share them with your colleagues, and much much more. Welcome to your personal library of Research!\n\nWHAT'S NEW\nNew Features:\nAutomatic updating of CSL styles (can be turned off in preferences).\nUpdated CSL styles to include 2000+ more styles from Elsevier and T&amp;F journals\nOther bug fixes and improvements:\nFixed an issue with PDF downloading from ScienceDirect\nFixed an issue with greek character encoding in BibTeX files\nFixed an issue with exporting file URLs in BibTeX files\nFixed an issue with ISBN importing in RIS and Pubmed files\nFixed an issue with accessing the Papers support site from within Papers\nFixed an issue with querying Crossref with DOIs containing unicode characters\nFixed an issue with recent author searches and the ADS search engine\nFixed an issue where new from clipboard would loose author information\nFixed an issue with null authors showing in references\nFixed an issue where using capitalization functions during multi editing would set incorrect titles\nFixed an issue where inspector menus would appear at the wrong location on retina screens\nFixed an issue where the tweet sheet would appear at the wrong location\nFixed an issue where notes created on iOS could not be properly dragged\nFixed an issue where selected underlines and strikethroughs would appear washed out\nFixed a number of crashes while author editing\nFixed an issue where upon quit Papers would crash\nFixed an issue where libraries created on Windows would crash when opening the preferences\nFixed an issue where Papers would crash if clicked on the help button in a number of sheets\nFixed an issue where notes would be saved to the wrong paper in fullscreen mode\nImproved behavior when switching between fullscreen mode and different papers\nImproved import speed by preventing duplicate crossref requests\nImproved duplicate detection of books\nScrollbar hiding now adheres to the system wide preference to always show scrollers if chosen\nWindows compatible filenames now limits to the ASCII character set\nAdded additional logging to help users that have difficulties connecting to Web of Science\nAdded a warning when exporting the whole library as an archive\nChanged references to mekentosj.com to the new papersapp.com website\n\n\n\n\n[k'd] By LfsCrew ","torrent":{"xt":"urn:btih:52a211205da311226b915cd4acdc14d00aaefc9d","amp;dn":"Papers2+v+2.6.2+%5Bk%27d%5D+By+LfsCrew.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52a211205da311226b915cd4acdc14d00aaefc9d","infoHashBuffer":{"type":"Buffer","data":[82,162,17,32,93,163,17,34,107,145,92,212,172,220,20,208,10,174,252,157]},"announce":[],"urlList":[]}}