{"title":"All That Remians [of 1948 Palestine] pdf R. Khalidi","uid":11137795,"size":30394193,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5416563ea0968ae82a34b4e163bdb2fbd849912f&amp;dn=All+That+Remians+%5Bof+1948+Palestine%5D+pdf+R.+Khalidi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1412126814,"description":"Review\n\n&quot;A fundamental research tool for all historians interested in the history of Palestine. A monumental effort ... a major achievement.&quot; --Roger Owen, The Middle East Centre, St. Antony's College, Oxford University, 1992\n\n&quot;This scholarly and dispassionate documentaton of a tragedy ... is must reading....&quot; --Ambassador Richard Parker, Middle East Institute, 1992\n\n&quot;This massive, meticulous, rigorous compendium is a milestone in the Palestinians' effort to recover their history.&quot; --Michael C. Hudson, Seif Ghobash Professor of Arab Studies, Georgetown University, 1992\n\nFrom the Publisher\n\nWalid Khalidi was born in Jerusalem and is a graduate of the Universities of London and Oxford. He is a distinguished historian and widely recognized authority on Palestine. Professor Khalidi is a Senior Research Fellow at Harvard's Center for Middles Eastern Studies, and the author of numerous books and articles in Arabic and English. --This text refers to an out of print or unavailable edition of this title.\n\n\nThis authoritative reference work describes in detail the more than 400 Palestinian villages that were destroyed or depopulated by Israel in 1948. Little of these once-thriving communities remains: not only have they been erased from the Palestinian landscape, their very names have been removed from contemporary Israeli maps. But to hundreds of thousands of Palestinians living in their diaspora, these villages were home, and continue to be poignantly powerful symbols of their personal and national identity.\n\n","torrent":{"xt":"urn:btih:5416563ea0968ae82a34b4e163bdb2fbd849912f","amp;dn":"All+That+Remians+%5Bof+1948+Palestine%5D+pdf+R.+Khalidi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5416563ea0968ae82a34b4e163bdb2fbd849912f","infoHashBuffer":{"type":"Buffer","data":[84,22,86,62,160,150,138,232,42,52,180,225,99,189,178,251,216,73,145,47]},"announce":[],"urlList":[]}}