{"title":"Awareness Systems: Advances in Theory, Methodology and Design","uid":4976640,"size":7693107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:543b1b20cc34017922ee694bc2b34c6288d10f7d&amp;dn=Awareness+Systems%3A+Advances+in+Theory%2C+Methodology+and+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1246032370,"description":"People go about their daily tasks with an in-built awareness of their social and physical environments. This awareness helps them to work cooperatively in groups, coordinate actions, and to maintain and enhance social communication with others. Networked technology has extended the reach of people's awareness to remote and distributed groups and provided access to a much larger social network than was previously feasible.\n\nAwareness systems that are designed to support people to build up, maintain and make use of these extended networks are attracting the interest of industry, and include buddy lists in instant messaging, sustained audio-video links, active contact lists on mobile phones and so forth.\n\nThis book contains contributions from leading researchers in the field and looks at the design of awareness systems from theoretical foundations through to empirical studies and design concepts and will be of interest to practitioners and researchers in the field of HCI.","torrent":{"xt":"urn:btih:543b1b20cc34017922ee694bc2b34c6288d10f7d","amp;dn":"Awareness+Systems%3A+Advances+in+Theory%2C+Methodology+and+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"543b1b20cc34017922ee694bc2b34c6288d10f7d","infoHashBuffer":{"type":"Buffer","data":[84,59,27,32,204,52,1,121,34,238,105,75,194,179,76,98,136,209,15,125]},"announce":[],"urlList":[]}}