{"title":"Expendable Warriors: The Battle of Khe Sanh and the Vietnam War","uid":11739390,"size":2491356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:552c0e7e3c0cafd0122ac3b107c7e77c06a29416&amp;dn=Expendable+Warriors%3A+The+Battle+of+Khe+Sanh+and+the+Vietnam+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425711263,"description":"The battle of Khe Sanh was won and the Vietnam war was lost at the same time. &quot;Expendable Warriors&quot; describes at multiple levels the soldiers and marines who were expendable in the American political chaos of Vietnam, 1968. On January 21, 1968, nine days before the Tet offensive, tens of thousands of North Vietnamese regulars began the attacks on the Khe Sanh plateau, which led to the siege of the Khe Sanh Combat Base. For those with a vivid memory of the Vietnam war, there is consolation in knowing that the impact of that war altered and shaped politics and warfare for the next generations. But in that altering we must take the lessons and apply them to new situations, new challenges and new policy dilemmas. To fail to do so would mean that the warriors at Khe Sanh and all of Vietnam were truly expendable, The battle of Khe Sanh was won and the Vietnam war was lost at the same time. &quot;Expendable Warriors&quot; describes at multiple levels the soldiers and marines who were expendable in the American political chaos of Vietnam, 1968. On January 21, 1968, nine days before the Tet offensive, tens of thousands of North Vietnamese regulars began the attacks on the Khe Sanh plateau, which led to the siege of the Khe Sanh Combat Base","torrent":{"xt":"urn:btih:552c0e7e3c0cafd0122ac3b107c7e77c06a29416","amp;dn":"Expendable+Warriors%3A+The+Battle+of+Khe+Sanh+and+the+Vietnam+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552c0e7e3c0cafd0122ac3b107c7e77c06a29416","infoHashBuffer":{"type":"Buffer","data":[85,44,14,126,60,12,175,208,18,42,195,177,7,199,231,124,6,162,148,22]},"announce":[],"urlList":[]}}