{"title":"Cat  Stevens  - Another Saturday Night (Live) (Xvid-2nafish)","uid":6042112,"size":38629894,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:55558b8b1553700869ea85c047130dc70676e8ce&amp;dn=Cat++Stevens++-+Another+Saturday+Night+%28Live%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292372206,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:02:34\n\n[Video]\nResolution : 540x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1877 Kbps\nQuality Factor : 0.33 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Another Saturday Night&quot; is the title of a 1963 hit single by Sam Cooke from the album Ain't That Good News. It reached number ten on the Billboard Hot 100 and was number one on the R&amp;B chart for a single week. In the UK, the song peaked at number 23 on the UK Singles Chart.\n\nIn 1974, the Cat Stevens version of the song reached number one in Canada on the RPM national singles chart twice, on September 28 and October 19, separated by two other number ones.\n\nIn 1974, Cat Stevens recorded a version of the song which peaked at number six on the Hot 100.\n\nYusuf Islam (born Steven Demetre Georgiou; 21 July 1948 in Marylebone, London, England), originally and commonly known by his former stage name Cat Stevens, is an English musician. He is a singer-songwriter, multi-instrumentalist, educator, philanthropist, and prominent convert to Islam.\n\nHis early 1970s record albums Tea for the Tillerman and Teaser and the Firecat were both certified as Triple Platinum by the RIAA in the United States; his 1972 album Catch Bull at Four sold half a million copies in the first two weeks of release alone and was Billboard's number-one LP for three consecutive weeks. He has also earned two ASCAP songwriting awards in consecutive years for &quot;The First Cut Is the Deepest&quot;, which has been a hit single for four different artists.\n\nStevens converted to Islam at the height of his fame, in December 1977, and adopted his Muslim name, Yusuf Islam, the following year. In 1979, he auctioned all his guitars away for charity and left his music career to devote himself to educational and philanthropic causes in the Muslim community. He has been given several awards for his work in promoting peace in the world, including 2003's World Award, the 2004 Man for Peace Award, and the 2007 Mediterranean Prize for Peace. In 2006, he returned to pop music with his first album of new pop songs in 28 years, entitled An Other Cup. He now goes professionally by the single name Yusuf. His newest album, Roadsinger, was released on 5 May 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:55558b8b1553700869ea85c047130dc70676e8ce","amp;dn":"Cat++Stevens++-+Another+Saturday+Night+%28Live%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55558b8b1553700869ea85c047130dc70676e8ce","infoHashBuffer":{"type":"Buffer","data":[85,85,139,139,21,83,112,8,105,234,133,192,71,19,13,199,6,118,232,206]},"announce":[],"urlList":[]}}