{"title":"Goodfellas (1990) 720p DivX HD multisubs (moviesbyrizzo)","uid":6543366,"size":2803420780,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:56954194c4165726ebeae7cc05bac54ec7ac9f4e&amp;dn=Goodfellas+%281990%29+720p+DivX+HD+multisubs+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1310770288,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0099685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0099685/&lt;/a&gt;\n\n1280 X 720p video resolution at 2280k bitrate, 256k audio DivX HD\n\n\n18 Subtitles included for the following (UTF-8 text subtitles SRT files)\nBulgarian, Czech, Danish, Dutch, English, French, Greek, Hungarian, Italian,\nNorwegian. Polis, Portuguese, Romanian, Russian, Slovenian, Spanish, Swedish\n\npending : German and Finnish (not available when movie posted - sorry!) \n\n\nGoodfellas is a movie about the real thing: The best of men are Italia!\n(and German of similar strain) - anyways thats my own view included as\na movie reviewer of note, and Social advocate and Philosphy publisher.\n\nThe problem is that sometmes a script doesnt do enopugh justice to a greatest\npeoples due to political considerations by those that have something to gain\nin keeping genuinely formidable idealistic based competition - down.\n\nThe best of men will always have strenght as a core feature of manhood - only\nit must engage only with a sense of decency, justice and true right of family\nprotection  - only then is it greatness, worthy and in fact masculine. Otherwise\nits just a jerk putting on a face - and we never taught thay particular way of\nexisting in Italian culture Im proudest to declare!\n\nGod bless the people of Italy and all their closest tied family in all of \nEurope - equally!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\nNote: When we picked up a Sony Bluray player in town, it offered DivX HD \nsupport too - but no mention of mkv. Of the many models on the shelves, only one\nmentioned &quot;mkv player&quot; functionality and it was more than double the price\nwith no real brand name quality on the particular model.\n\n\nI dont know what players you are all buying out there today, however I \ndo hope to always see DivX HD support as almost all blu-ray players did offer\nthis a while back when we picked up ours - no sign of any German models\nin this town Im sad to say - and the (only Euro model on the shelves) Dutch\nmodel was only a budget priced Bluray-DivX HD unit Im sorry to say.\nHolland could own this market too with high end models offerings too!\n\n","torrent":{"xt":"urn:btih:56954194c4165726ebeae7cc05bac54ec7ac9f4e","amp;dn":"Goodfellas+%281990%29+720p+DivX+HD+multisubs+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56954194c4165726ebeae7cc05bac54ec7ac9f4e","infoHashBuffer":{"type":"Buffer","data":[86,149,65,148,196,22,87,38,235,234,231,204,5,186,197,78,199,172,159,78]},"announce":[],"urlList":[]}}