{"title":"David Fathead Newman - Lone Star Legend","uid":7911686,"size":71018232,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:570e7b339a18524d714d03e2c27f09a3a7bcb42e&amp;dn=David+Fathead+Newman+-+Lone+Star+Legend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jazznbluz","files":-1,"time":1355235789,"description":"David &quot;Fathead&quot; Newman has such a strong reputation as a soulful saxophonist that sometimes people forget how creative a straight-ahead improviser he can be. His two Muse LPs, Resurgence and Still Hard Times, have been reissued in full on this deluxe single CD. Whether playing tenor, flute, soprano or alto, Newman's solos are full of personality and logical ideas. On one of the sets he is teamed with trumpeter Marcus Belgrave in a sextet (along with guitarist Ted Dunbar, pianist Cedar Walton, bassist Buster Williams and drummer Louis Hayes). The other date has Newman as part of an octet also including his old bandmate from his Ray Charles days, altoist Hank Crawford; baritonist Howard Johnson; trumpeter Charlie Miller; pianist Larry Willis; bassist Walter Booker; drummer Jimmy Cobb; and vibraphonist Steve Nelson, who has two features of his own. On both sets, Newman is heard in top form and he gets to show off his talents on all of his four axes. The highlights include &quot;Everything Must Change,&quot; Walton's &quot;To the Holy Land,&quot; &quot;One for My Baby&quot; and &quot;Please Send Me Someone to Love&quot; but all dozen performances are colorful and well-played. Prime Fathead. \n","torrent":{"xt":"urn:btih:570e7b339a18524d714d03e2c27f09a3a7bcb42e","amp;dn":"David+Fathead+Newman+-+Lone+Star+Legend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570e7b339a18524d714d03e2c27f09a3a7bcb42e","infoHashBuffer":{"type":"Buffer","data":[87,14,123,51,154,24,82,77,113,77,3,226,194,127,9,163,167,188,180,46]},"announce":[],"urlList":[]}}