{"title":"Hose Monster 4 (David Perry, Evil Angel / 2012)","uid":9510661,"size":1465970688,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:57436221aefeaf64b56e56aa0a3b7b7809c2e6af&amp;dn=Hose+Monster+4+%28David+Perry%2C+Evil+Angel+%2F+2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"FluxXxu","files":2,"time":1390406223,"description":"Hose Monster 4 (David Perry, Evil Angel / 2012)\n\nFamed French stud and veteran director David Perry continues his exploration of those special ladies who require multiple cocks at once to be fully satisfied. Hose Monster 4 features three of Europes most shameless sluts, each taking on four big-dicked brutes in the kind of sprawling, outrageous gang bangs that would make less adventurous girls head spin! Romanian binge slut Sandra Romains car mechanic presents her with a big bill to pay. The tanned, sultry bitch attempts to settle the charges by sucking manager Ian Scotts large cock ... soon shes surrounded by three more dudes who all want their piece of the action, and ass! The boys stuff Sandra with man-meat, drilling her in every orifice and even thrusting two huge dicks in her pussy at the same time! Sandra finishes with several messy loads in her face. Next, Sandras little sister, Alice Romain, interrupts a game of poker and becomes the jackpot in a rough game of stud. Her boyfriend Mike Angelo offers the blonde babes tight, young body to his buddies, who stretch Alices sweet butthole to its limit before ejaculating in her mouth. Then theres Destiny, a tattooed minx with great natural boobs and shapely legs who teases the director in a private masturbation show. David butt-fucks Destiny and cums in her mouth, then shares the toned cutie with his horny pals. She sucks all their cocks ass-to-mouth and takes an airtight pounding until shes creamed with jizz. Hose Monster 4 is a beastly good time!\n\nSandra Romain, Alice Romain, Destiny, Ian Scott, Mike Angelo, Kid Jamaica, Roly Reeves, Leslie Taylor, David Perry, Choky Ice, Renato\n\nGonzo, Anal, DP\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=oc1klg2lc6u2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=oc1klg2lc6u2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=6wjnyfjdw1li.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=6wjnyfjdw1li.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:57436221aefeaf64b56e56aa0a3b7b7809c2e6af","amp;dn":"Hose+Monster+4+%28David+Perry%2C+Evil+Angel+%2F+2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57436221aefeaf64b56e56aa0a3b7b7809c2e6af","infoHashBuffer":{"type":"Buffer","data":[87,67,98,33,174,254,175,100,181,110,86,170,10,59,123,120,9,194,230,175]},"announce":[],"urlList":[]}}