{"title":"Sibelius 5.2 Update for Windows - from Sibelius 5.1","uid":4168961,"size":182437747,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:574973003b269f6b5f282de5834f26290ee35d0d&amp;dn=Sibelius+5.2+Update+for+Windows+-+from+Sibelius+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":2,"time":1209756537,"description":"Sibelius 5.2 Update for Windows - from Sibelius 5.1\n\nNOTE: Will not work on Sibelius 5.0. \nSibelius 5.1 needs to be installed. With Sibelius 5.1 installed and closed down, just launch this update. Tested and working fine on Windows XP. Have not tried it on Windows Vista.\n\n\nChangelog:\n\nNew features in Sibelius 5.2\n* Sibelius now warns you before playback if your score requires more simultaneous sounds than can be played by your current playback configuration, and offers to add more instances of Kontakt Player 2 to improve playback.\n* Define the long and short forms of instrument names that should appear at the point of an instrument change and at the warning at the last note played by the previous instrument, using new options in House Style &gt; Edit Instruments\n* Define the instruction that should precede the name of the instrument at the instrument change warning ('To' by default) in Create &gt; Other &gt; Instrument Change\n* Open and close the expanded state of all strips on the Mixer by Ctrl+clicking or Command-clicking on the small disclosure triangle; Shift-click opens and closes all strips of the same type\n* New File &gt; Export &gt; Sibelius Student menu item, for exporting files for opening in Sibelius 3 Student or Sibelius 5 Student\n* Score windows can now restore the last size and position at which they were shown, using new options on the Files page of Preferences\n* Improvements to several plug-ins\n\nWindows compatibility\nSibelius no longer fails to initialize on some Windows XP machines with the error code 0xc00000005.\n\nInstallation\nSibelius no longer fails to install on some Windows Vista computers in circumstances where the system VBscript DLL is not correctly registered.\n\nRegistering\nA number of important fixes to running with the Licence Server, including correctly saving changes to the licence server?s hostname/IP address and/or port number, running from a limited privileges (non-admin) account, and crashing when displaying the license agreement.\n\nPerformance\nA number of important improvements to the overall performance of the program, including not reporting 'out of memory' errors when opening many scores (Windows only), improvements to note input speed, speed of dragging text and staves, and so on.\n\nPlayback\nA number of important improvements to playback, including concerning Rubato (no longer causes notes to stick), retaining user-overridden sounds for existing scores, and a number of other bugs relating to the playback of specific notations.\n\nPrinting\nA number of important improvements to printing, e.g. printing parts on a printer with a duplexer, resolving issues with the Collate feature for buggy drivers, booklet printing for scores with page number changes, etc.\n\nPaste as cue\nA number of important improvements to this feature, including resolving rhythmic corruption when pasting cues with tuplets, copying from pitched to unpitched percussion staves and vice versa, and fixing a crash that can occur when you undo pasting a cue.\n\nScanning\nA number of important fixes to Sibelius?s ability to import files from PhotoScore, including correct import of hidden staves, repeated triplet patterns, syncopated rhythms and start repeat barlines.\n\nBeams\nBeams over page breaks no longer sometimes draw incorrectly when the page on which they start is not in view.\n\nSpecial page breaks\nDoing Layout &gt; Format &gt; Make Into System on a selection of bars including the bar following a special page break no longer removes the special page break.\n\nExporting graphics\nWhen exporting pages of a score as graphics files, Sibelius should use the page number printed in the score rather than the physical number of the page.\n\nPlus many more bugs fixed.\n\nFor full details of the fixes in Sibelius 5.2, see http://www.sibelius.com/helpcenter/en/a562 \n\nSibelius 5.2 also includes all the fixes and improvements of Sibelius 5.1. For a full list of these, see http://www.sibelius.com/helpcenter/en/a540 \n\n---------------------------------","torrent":{"xt":"urn:btih:574973003b269f6b5f282de5834f26290ee35d0d","amp;dn":"Sibelius+5.2+Update+for+Windows+-+from+Sibelius+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"574973003b269f6b5f282de5834f26290ee35d0d","infoHashBuffer":{"type":"Buffer","data":[87,73,115,0,59,38,159,107,95,40,45,229,131,79,38,41,14,227,93,13]},"announce":[],"urlList":[]}}