{"title":"Wild Johnson's Revenge v1.1 [Android] [.apk]","uid":9255680,"size":29023434,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:58277b52e98caaa006077cd690900c9f53ea7a86&amp;dn=Wild+Johnson%27s+Revenge+v1.1+%5BAndroid%5D+%5B.apk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DANGER1986","files":-1,"time":1385543717,"description":"If you ever wanted to be a sheriff here is your chance!\n\nWild Johnsons's Revenge offers 45 unique levels of great action and fun.\n\nFight as a sheriff and beat Evil Chief and his gang.\n\nFeatures:\n\n- western game style - wild west\n- 45 great levels\n- real weapons replicas \n- 12 unique characters\n- guns,armors and more\n- duckrange game mode\n- normal and hard difficulty levels\n- cartoon graphics\n- bluegrass music\n- eliminate the enemies by tapping the screen\n\nSo if you think that you are real gunman, take your gun and come back in glory.\n\n\n\nSupported devices resolution: 800x480 and above.\n\n--------------------------------\nThe story is simple: we need to recapture the city, which was captured by the Evil Chief and his gang. The game consists of 5 locations - a total of 45 levels (10 for the first 4 locations and the last 5 levels.\nIngame gear system allows you to adjust and improve the character. There are three equipment classes - weapons, shield and a hat.\n\nPlayer can use 5 types of weapons from the period of the Wild West (colt, revolver, shotgun, rifle, heavy repeatable rifle). Each weapon has its own parameters such as number of bullets, the strength of the shot and the time it takes to reload. Armors reduce the amount of taken damage and hats reduce the chance of getting hit (distracting the opponent). In addition, players can use the lever to perform evasive action.\n\nDuring the game player has a basic weapon (the one you just carry) and three special items - dynamite, net to catch enemies and renewing health injection. Additional items are available in the shop where you can buy them for cash collected during the game.\n\nIn the game there are 12 characters that we meet along the way. Three basic types of enemies (easy, medium and hard), 5 bosses and 4 figures disturbing us in the game . Some of them need to be disabled in order to survive, and some need to be avoided. Each character can drop loot which we can collect after winning a level (loot is destroyed if you try to pick it up during the shoot). \nThe game includes an additional game mode - duckrange where you can gain cash for bonus shop. We can unlock there the &quot;powerful&quot; items such as dynamite, health injection, the best weapon and shield.\n\n# Please check HOW TO PLAY to get information on how to play. Go to NEW GAME and tap HOW TO PLAY icon on down left corner of the screen.\n# To be able to buy something in bonus shop you need to unlock the DUCK RANGE game mode.","torrent":{"xt":"urn:btih:58277b52e98caaa006077cd690900c9f53ea7a86","amp;dn":"Wild+Johnson%27s+Revenge+v1.1+%5BAndroid%5D+%5B.apk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58277b52e98caaa006077cd690900c9f53ea7a86","infoHashBuffer":{"type":"Buffer","data":[88,39,123,82,233,140,170,160,6,7,124,214,144,144,12,159,83,234,122,134]},"announce":[],"urlList":[]}}