{"title":"Master Rallye[multilenguaje]","uid":3282181,"size":703213056,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:58f22e97c0ad8842645792815062113172681812&amp;dn=Master+Rallye%5Bmultilenguaje%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pctorrent","files":4,"time":1106837444,"description":"Formerly one of PC racing's quietest subgenres, rallying has experienced tremendous growth since the turn of the millennium. With star performers such as EA Sports' Mobil 1 Rally Championship, Codemasters' Colin McRae Rally 2.0, and Infogrames' Rally Masters continually ranking at or near the top of the racing charts and grand newcomers such as Rally Trophy leading the way into the future, rallying has quickly become one of the most intriguing vehicular disciplines on the PC. Into these suddenly competitive surroundings wades the latest racing game from Microids, Master Rallye. Differentiating itself from much of the rally crowd by virtue of its nonrestrictive routes, wide-open environments, and head-to-head racing, Master Rallye is an entertaining trucking thrill ride that walks a fine line between a realistic rally title and a wild 4x4 off-road racer such as Codemasters' 1nsane. It exhibits many of the traits of a budget game, which it is at just $19.99, yet it should appeal to anyone who believes rallying is more fun when conducted with other cars and oodles of directional options.\nMaster Rallyescreenshot\nMaster Rallye doesn't confine you to desolate off-road areas.\n\nBased on its real-life namesake, Master Rallye takes its drivers on a journey through 42 locations and a total of eight European and Asian countries. The game's competitions are conducted in a variety of modes, including single-leg practice sessions, three-event quick races, three-event Rallye cups, one-on-one challenges, and the full Master Rallye. In a quick race, you may vary the difficulty level, select up to three opponents, or opt for a solo checkpoint race in which you must pass through a series of gates on your way to the finish line. In all other modes, the number of competitors is preset at three and racers may follow any path to the finish line. It is this last wrinkle that makes the game as unique as it is.\n\nLike Microsoft's Motocross Madness, Master Rallye unfolds in a series of sprawling and fully drivable environments that are completely open to your interpretation. In other words, it doesn't matter what route you take to the checkered flag, as long as you get there before the other guys. Indeed, if the beaten path looks too tricky or too confining, it is perfectly legal to detour over the untamed wilderness, up a nearby hill, or through the middle of that upcoming pond. But while certain alternate off-road routes will cut precious seconds from your final time, others can spell disaster. In fact, miscalculating the landscape may send you off the edge of a steep cliff or head-on into a vertical rock face. Furthermore, the courses are generally designed to reward those who adhere to the designated roadway and break from it only in certain situations. In this way, developer Steel Monkeys has ensured that drivers will usually feel like part of a close-knit pack rather than a lonely trailblazer.\nMaster Rallyescreenshot\nTake detours over hills, or past ponds and lakes.\n\nFortunately, Master Rallye's artificially intelligent opposition is more geared toward avoiding you than bouncing off your rear bumper. Though some collisions are unavoidable, the AI drivers will generally recognize your presence, steer clear when the opportunity presents itself, and respond to your actions. They also seem to be working under the same physics limitations that govern your own ride, and they therefore rarely behave in superhuman or super-foolish fashion. As for your own capabilities, Steel Monkeys' physics model is an appealing combination of simulation authenticity and arcade fun that forces you to adopt the smoothness and skid control of a real rally racer without taking on the taxing rigidity of the aforementioned Mobil 1. Part of this relative driving ease can certainly be attributed to the game's vast, wide-open spaces, yet Master Rallye's forgiving automobiles are also capable of ascending grades that would stop a real-life 4x4, maintaining grip when all known laws of physics dictate otherwise, and surviving cataclysmic events that would destroy any real-life vehicle.\n\n\n\nVisit www.pctorrent.com","torrent":{"xt":"urn:btih:58f22e97c0ad8842645792815062113172681812","amp;dn":"Master+Rallye%5Bmultilenguaje%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58f22e97c0ad8842645792815062113172681812","infoHashBuffer":{"type":"Buffer","data":[88,242,46,151,192,173,136,66,100,87,146,129,80,98,17,49,114,104,24,18]},"announce":[],"urlList":[]}}