{"title":"Caribou - Andorra [24 bit FLAC] vinyl","uid":8254471,"size":913622762,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5934fd4db3031ed025dfcbd3e9ac5b999456981a&amp;dn=Caribou+-+Andorra+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1363229921,"description":"  Caribou - Andorra (2007) [24 bit FLAC] vinyl\n\n  Released: 2007\n  Source: MRG308 / US\n  Genre: Electronic, Pop/Rock\n  Style: Space Rock, Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Melody Day\n  A2. Sandy\n  A3. After Hours\n  A4. She's The One\n  A5. Desiree\n  B1. Eli\n  B2. Sundialing\n  B3. Irene\n  B4. Niobe\n\n  As Dan Snaith became an accomplished producer with his Manitoba and Caribou albums of the 2000s, the breathtaking vitality of his early work gave way to music that may have been more accomplished, but was never as interesting or as fun to listen to. Andorra is just the kind of break with the past that he needed after 2005's relatively lackluster The Milk of Human Kindness. His first album on Merge, it's less a collection of innovative sounds and productions (like The Milk of Human Kindness) and more an album of songs, united by his motivations and desires. These tracks are first and foremost songs -- and not just because Snaith is singing a bit more. There's less of a &quot;programmed&quot; sound, although the productions are dense with tape cut-ups, layered harmonies, and various percussion lines threaded through the mix. And the sheer strength of the material is immediately apparent when the opener, &quot;Melody Day,&quot; reveals itself as the best moment in Snaith's career. First of all, it sounds like it was recorded in 1966 by a British band that just missed the cut for the Nuggets, Vol. 2 box set, recalling '60s touchstones like the Move or Soft Machine. Not strictly a throwback, though, its ineffably crisp and kaleidoscopic production style ranks with the best of Dungen or Fiery Furnaces or Animal Collective (which is high praise indeed). Andorra may be a bedroom record, but it certainly doesn't sound like a bedroom record; it has the energy and intensity of group participation, and that makes it Snaith's best yet.","torrent":{"xt":"urn:btih:5934fd4db3031ed025dfcbd3e9ac5b999456981a","amp;dn":"Caribou+-+Andorra+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5934fd4db3031ed025dfcbd3e9ac5b999456981a","infoHashBuffer":{"type":"Buffer","data":[89,52,253,77,179,3,30,208,37,223,203,211,233,172,91,153,148,86,152,26]},"announce":[],"urlList":[]}}