{"title":"The Lighthouse (Maxwell Davies) Psappha Opera video","uid":8978696,"size":486355484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:59499a864df669a95467ec6375c68e2522e86745&amp;dn=The+Lighthouse+%28Maxwell+Davies%29+Psappha+Opera+video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tzuhalem","files":2,"time":1380503448,"description":"A filmed stage performance of Peter Maxwell Davies famed chamber opera. Reseeded from vimeo.\n\nCast\n\nJames Oxley  tenor Sandy \n \nDamian Thantrey  baritone Blazes \n \nJonathan Best  bass-baritone Arthur \n\n\nConrad Marshall  flute \n \nDov Goldberg  clarinet \n \nBeccy Goldberg  horn \n \nTracey Redfern  trumpet \n \nPhil Goodwin  trombone \n \nRichard Casey  piano \n \nTim Williams  percussion \n \nTom McKinney  guitar &amp; banjo \n \nDavid Routledge  violin  \n \nDavid Aspin  viola \n \nJennifer Langridge  cello \n \nDan Whibley  double bass \n \n\nThe Times, London by Geoff Brown\nOpera delivered the verve expected from a group who have carved a formidable niche reviving Maxwell Davies's pieces\nMeteorology's unholy trinity arrived at the Buxton Festival: it rained, it was cold, and it was windy. Just the day, then, to take shelter with Peter Maxwell Davies's The Lighthouse. Not that this chamber opera from 1980 offers much comfort to mariners: terse and haunting, it explores the documented mystery of three keepers in 1900 who disappeared from the Flannan Isles lighthouse, on the Outer Hebrides' outer rim. Psappha's production, directed by Elaine Tyler-Hall, is solid. So is the musical delivery, undertaken with the verve expected from a group who have carved a formidable niche reviving the composer's music-theatre pieces.\n\nThe Lighthouse wears its age well. By 1980 the mad clown in Maxwell Davies's music had been subdued; he'd refreshed his language with classical forms, descriptive writing, even take-home tunes. Indeed, his ear for sound pictures is so strong that Aaron Marsden's black, minimalist setting stunts nothing, for the craggy rocks, wind gusts, and squawking sea birds are all in the music, sharply conducted by Etienne Siebens. And Psappha's musicians, sharing the stage with the skeletal lighthouse, offer no visual distractions, unlike the surtitles flashing left and right at the stage's corners.\n\nFlashing to little purpose, too, for the cast of three pitch their material with plenty of force and clarity as Maxwell Davies's writing eases. Jonathan Best's sepulchral tones didn't help his Sancho Panza in Buxton's Camacho's Wedding, but they slot right into Arthur, the keeper who sings a Salvation Army hymn and expects the arrival of an apocalyptic beast from the sea, due to dine on sinners. The youthful anguish of James Oxley's high tenor is a good match for Sandy, spinner of erotic romance, while Damian Thantrey's baritone is at least reasonably equipped for Blazes, the keeper with a violent past.\n\nMarc Rosette's lighting, heavy on the murk, amplifies the structural mystery at the opera's heart, with singers doubling as keepers and the officers who discovered their disappearance. Are they one and the same? Are we seeing ghosts? Psappha's forceful production isn't telling","torrent":{"xt":"urn:btih:59499a864df669a95467ec6375c68e2522e86745","amp;dn":"The+Lighthouse+%28Maxwell+Davies%29+Psappha+Opera+video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59499a864df669a95467ec6375c68e2522e86745","infoHashBuffer":{"type":"Buffer","data":[89,73,154,134,77,246,105,169,84,103,236,99,117,198,142,37,34,232,103,69]},"announce":[],"urlList":[]}}