{"title":"Kung-Fu Shaolin: Los secretos del Kung-Fu para la autodefensa, l","uid":4735236,"size":1925667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59dc7576b6c1354856986f971899d323452ca486&amp;dn=Kung-Fu+Shaolin%3A+Los+secretos+del+Kung-Fu+para+la+autodefensa%2C+l&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"VasiaZozulia","files":-1,"time":1235245620,"description":"Kung-fu Shaoli'n suena a magia para mucha gente, pues han aprendido que no so'lo es un arte marcial efectivo y un excelente sistema para la salud y la vitalidad, sino que tambie'n es un camino hacia la dicha espiritual. Aquellos que tienen el privilegio de encontrarse con aute'nticos maestros Shaoli'n o de tener un conocimiento algo ma's que superficial de la tradicio'n Shaoli'n estara'n de acuerdo en que lo dicho no es una exageracio'n. El kung-fu Shaoli'n, junto con las artes relacionadas de chi kung Shaoli'n y zen o meditacio'n, se ensen~o' con gran secreto en el Monasterio Shaoli'n, conocido como el Ã‚Â«primer monasterio bajo el cieloÃ‚Â». \n\nEl Monasterio Shaoli'n era el templo imperial situado en la montan~a sagrada central de China, Songshan, donde los emperadores de cada dinasti'a desde su establecimiento ascendi'an a rezar en nombre del pueblo. Sin embargo, la razo'n principal para su prestigioso ti'tulo como Ã‚Â«el primer monasterio bajo el cieloÃ‚Â» no era esa conexio'n imperial, sino las maravillosas artes que en e'l se ensen~aban. \n\nNo es una coincidencia histo'rica que algunos de los mejores generales en la historia de China, como Yuan Zhong, de la dinasti'a Tang, Yue Fei, de la dinasti'a Song, y Chi Ji Guang, de la dinasti'a Ming, recibieran su formacio'n marcial en la tradicio'n Shaoli'n. ","torrent":{"xt":"urn:btih:59dc7576b6c1354856986f971899d323452ca486","amp;dn":"Kung-Fu+Shaolin%3A+Los+secretos+del+Kung-Fu+para+la+autodefensa%2C+l","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59dc7576b6c1354856986f971899d323452ca486","infoHashBuffer":{"type":"Buffer","data":[89,220,117,118,182,193,53,72,86,152,111,151,24,153,211,35,69,44,164,134]},"announce":[],"urlList":[]}}