{"title":"Linda Ronstadt - What's New","uid":4873730,"size":127451140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5a25e6ebbb96c8d282e09c5bbdd2393b584b41a8&amp;dn=Linda+Ronstadt+-+What%5C%27s+New&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1240991513,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;What's New?&quot; is a 1939 popular song composed by Bob Haggart, with lyrics by Johnny Burke. It was originally an instrumental tune titled &quot;I'm Free&quot; by Haggart in 1938, when Haggart was a member of Bob Crosby And His Orchestra. The tune was written with a trumpet solo, meant to showcase the talents of band-mate Billy Butterfield. Crosby's orchestra recorded &quot;I'm Free&quot; the same day it was written.\n\nThe following year, the music publishers hired Johnny Burke to write lyrics for the tune. Burke's telling of the torch song is unique, using one side of a casual conversation between former lovers. Thus the song was retitled using the song's first line, &quot;What's New?&quot; The song was recorded with the new title in 1939 by Bob Crosby And His Orchestra With Vocalist Teddy Grace. The song reached a peak chart position of #10.\n\n&quot;What's New&quot; was the title of a 1983 album by Linda Ronstadt, and was the first of three albums of recordings of standards by Linda Ronstadt singing with The Nelson Riddle Orchestra with arrangements by Riddle.\n\nWhat's New is a Grammy-nominated, Triple Platinum-certified, 1983 Jazz album by American singer/songwriter/producer Linda Ronstadt consisting of nine songs of Jazz music. It represents the first in a trilogy of 1980s albums Ronstadt recorded with the late bandleader/arranger Nelson Riddle.\n\nThe album spawned a major change in popular culture because Ronstadt was then considered the leading female vocalist of the 'Rock' era and for her to do this was then considered unorthodox. Both her record company and manager, Peter Asher, were very reluctant in producing this album with Ronstadt, but eventually her determination won them out and the albums exposed a whole new generation to the sounds of the pre-swing and swing eras.  It should be noted that in 1983, Traditional Pop Standards music was pushed aside and the onetime popular music sung by Frank Sinatra, Ella Fitzgerald, Peggy Lee, Tony Bennett and their contemporaries was relegated in the 1960s and 1970s to Las Vegas club acts and elevator music. Ronstadt recently remarked that she did her part in rescuing these songs in which she calls &quot;little jewels of artistic expression&quot; from &quot;spending the rest of their lives riding up and down on the elevators.&quot;\n\nSince, artist using the Ronstadt prototype, Rock, Pop, and R&amp;B stars singing Jazz and Traditional Pop music for a large commercial market, has become acceptable and bankable.\n\nWhat's New was released in September of 1983 and spent 81 weeks on the main Billboard album chart. It held the #3 position for five consecutive weeks while Michael Jackson's &quot;Thriller&quot; and Lionel Richie's &quot;Can't Slow Down&quot; locked in the #1 and #2 album positions. It was RIAA certified Triple Platinum for sales of over 3 million copies in the United States alone. The album also earned Ronstadt a Grammy nomination for Best Pop Vocal Performance, Female alongside Donna Summer, Bonnie Tyler, Irene Cara and Sheena Easton - all of whom performed live on the 1984 Grammy telecast.\n\nAs Stephen Holden of the New York Times noted the significance of the album to popular culture when he wrote that What's New &quot;isn't the first album by a rock singer to pay tribute to the golden age of the pop, but is ... the best and most serious attempt to rehabilitate an idea of pop that Beatlemania and the mass marketing of rock LP's for teen-agers undid in the mid-60's. In the decade prior to Beatlemania, most of the great band singers and crooners of the 40's and 50's codified a half-century of American pop standards on dozens of albums, many of them now long out-of-print.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5a25e6ebbb96c8d282e09c5bbdd2393b584b41a8","amp;dn":"Linda+Ronstadt+-+What%5C%27s+New","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a25e6ebbb96c8d282e09c5bbdd2393b584b41a8","infoHashBuffer":{"type":"Buffer","data":[90,37,230,235,187,150,200,210,130,224,156,91,189,210,57,59,88,75,65,168]},"announce":[],"urlList":[]}}