{"title":"Cyborg Cop 3 1995 DVDRIP - Hyperdrive25","uid":6406148,"size":605972440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5a47cae83bcb5063cecbe27f12f5a2629f9ddb57&amp;dn=Cyborg+Cop+3+1995+DVDRIP+-+Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Hyperdrive25","files":-1,"time":1305812803,"description":"                       **************************\n                      * Cyborg Cop 3 1995 DVDRIP *\n                       **************************\n\nAspect Ratio: 4:3 Fullscreen\nRunning time: 1hr. 34mins.\n\n\nThey saved the best for last. This is the last installment in the Cyborg Cop saga.\nThis film is directed by Yossi Wein who did the Cinematography for Cyborg Cop (1993) and Cyborg Cop 2(1994). It stars two great actors Bryan Genesse (The Bold And The Beautiful TV series, Cold Harvest and Project Shadowchaser II) and Frank \nZagarino (CY Warrior, Shadowchaser). The chemistry between them is what I like about this film. Bryan has a great sense of humor and there are a lot of wisecracks by him in this film. The plot and script is solid. The villain in this film is exceptional as well as his personal robotic assassin.   \n\nCast:\n-----\n    Bryan GENESSE as Max, Frank ZAGARINO as Saint, Ian ROBERTS as Sheen, Steven\n    RYMER as Truck Driver, Tyrone STEVENSON as Oscar, Hal ORLANDINI as Cooper,\n    Lynne WHITE as Students Mother, Jenny MILLER as Eveyln, Jaques MARAIS as  \n    Students Father, Jurgen HELLBERG as Derrick, Justin ILLUSION as Adam, Martin \n    Le MAITRE as Lennie, Michael BRUNNER as Dr. Phelps, Tony CAPRARI as Seth,\n    J.D. Du PLESSIS as TV cameraman, Wade EASTWOOD as Cyborg #2, Kevin FITZPATRICK\n    as Gas Attendant, Ian YULE as Harvey, Arthur BEREZIN as Cyborg #1, Vadim DOBRIN\n    as Cyborg #3.\n\n \nPlot\n----\nWhen healthy college students involved in a research project begin to disappear, glamorous TV news reporter Evelyn Reed (Jennifer Miller) goes in to investigate. With the help of an inside informant, she uncovers the shadowy side of the corporate giant Delta Tech - the creation of indestructible high-tech warriors. To shut Delta Tech down, Evelyn steals the computer's power supply and begins to run for her life. Two &quot;for hire&quot; federal marshals, Max and Saint (Frank Zagarino, Bryan Genesse) are sent in to recover the woman and the chip. Only after it's too late do they realize the true evil involved. To save Evelyn, and ultimately the world, the marshals must withstand the attack of these indestructible warriors amidst explosions and raining car metal in this ultimate showdown...\n___________________________________________________________________________________\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. \nJust burn the files onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!**********************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\nP.S. Please remember to add a comment. Thanks!","torrent":{"xt":"urn:btih:5a47cae83bcb5063cecbe27f12f5a2629f9ddb57","amp;dn":"Cyborg+Cop+3+1995+DVDRIP+-+Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a47cae83bcb5063cecbe27f12f5a2629f9ddb57","infoHashBuffer":{"type":"Buffer","data":[90,71,202,232,59,203,80,99,206,203,226,127,18,245,162,98,159,157,219,87]},"announce":[],"urlList":[]}}