{"title":"Isabella and Ferdinand Trilogy [MOBI]","uid":10088196,"size":1495820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bb19abf239f999a1cf213e158abab80c2a755f0&amp;dn=Isabella+and+Ferdinand+Trilogy+%5BMOBI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Xetron","files":3,"time":1399144190,"description":"[IMG]http://lookpic.com/O/i2/772/ZkHEmLLi.jpeg[/IMG]\n\nDetails -\n\nOverview:\n\n1. Castile for Isabella \nCastile for Isabella covers the early life of the most significant of all Spanish monarchs: Isabella of Castile. Isabella is seen as a young girl,within a few steps of the throne; first in the care of an ambitious but unbalanced mother; later in the licentious court of her half-brother HenryIV; and at length ascending the throne, Ferdinand beside her. Meanwhile Henry IV, weak and in the hands of favourites, had married a frivolous and immoral Princess whose illicit love affair brought scandal and confusion to Castile with the birth of a child whose legitimacy was in doubt. These were momentous years in Spanish history, for here was a country in the grip of anarchy, with a royal house divided against itself. But Isabella, firm, serene and courageous, was dedicated to an idea; to bring law and order to an all-Christian Castile and to marry Ferdinand of Aragon\n\n2. Spain for the Sovereigns \nMarried to Ferdinand after continual fears and disappointments, Isabella triumphed over every danger, convinced of her true destiny.\nWith the might of Portugal humbled, the Court of the Sovereigns saw the rise of Torquemada, the establishment of the dreaded Inquisition, and the coming of Columbus who left the woman he loved to make a dream reality.\n\nAmbitious and unfaithful, Ferdinand longed to lead his troops against the Moorish strongholds. Isabella knew a united Spain and a glorious future could be theirs, but they must only share it together...\n\n3. Daughters of Spain \nWith Spain now united, Ferdinand looked to his daughters to further his ambitions. All too often, Isabella found herself torn between his brilliant plans and her love for her children. During the last years of Isabella's reign it seemed there was a curse on the Royal House which struck at the children of the Sovereigns.\n","torrent":{"xt":"urn:btih:5bb19abf239f999a1cf213e158abab80c2a755f0","amp;dn":"Isabella+and+Ferdinand+Trilogy+%5BMOBI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb19abf239f999a1cf213e158abab80c2a755f0","infoHashBuffer":{"type":"Buffer","data":[91,177,154,191,35,159,153,154,28,242,19,225,88,171,171,128,194,167,85,240]},"announce":[],"urlList":[]}}