{"title":"Britney Spears In The Zone (CD Rip) MusicFanatic98","uid":9687044,"size":129987787,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5bbd11348255d7f4bf5bf0c66b51306312a837a9&amp;dn=Britney+Spears+In+The+Zone+%28CD+Rip%29+MusicFanatic98&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MusicFanatic98","files":-1,"time":1393787888,"description":"In the Zone is the fourth studio album by American recording artist Britney Spears. It was released on November 14, 2003, by Jive Records. Its music incorporates dance, house, trip hop and hip hop styles with instrumentation from guitars, drums, synthesizers, strings, and Middle Eastern musical instruments. Its themes range from love, dancing, empowerment, and in the case of songs such as &quot;Touch of My Hand&quot;, sex and masturbation. Contributions to the album's production came from a wide range of producers, including Bloodshy &amp; Avant, R. Kelly, Trixster, Moby, Guy Sigsworth and The Matrix. Four singles were released from the album: &quot;Me Against the Music&quot;, &quot;Toxic&quot; and &quot;Everytime&quot; became worldwide hits, all peaking at number one in Australia and Ireland and reaching top five positions worldwide. To promote In the Zone, Spears performed the songs in a number of television appearances and also embarked on The Onyx Hotel Tour. The album and its music videos are largely seen by critics as the end of her transition from teen pop star to a more adult female artist. In 2009, Amy Schriefer of NPR listed In the Zone as one of The 50 Most Important Recordings of the Decade, calling it &quot;a primer on the sound of pop in the '00s&quot;.","torrent":{"xt":"urn:btih:5bbd11348255d7f4bf5bf0c66b51306312a837a9","amp;dn":"Britney+Spears+In+The+Zone+%28CD+Rip%29+MusicFanatic98","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bbd11348255d7f4bf5bf0c66b51306312a837a9","infoHashBuffer":{"type":"Buffer","data":[91,189,17,52,130,85,215,244,191,91,240,198,107,81,48,99,18,168,55,169]},"announce":[],"urlList":[]}}