{"title":"Rambo 3 1080p H.264 mkv","uid":8881415,"size":1986997963,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5bc502b8862854c7762ec726661ec86a4129a8c2&amp;dn=Rambo+3+1080p+H.264+mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"audiomaximus","files":1,"time":1378333181,"description":"Colonel Sam Trautman returns to Thailand to once again enlist the help of Vietnam veteran John J. Rambo. After witnessing Rambo win a stick fighting match, Trautman visits Rambo at a Buddhist temple under construction and asks Rambo to join him on a resupply mission for mujahideen rebels in Afghanistan. Despite showing him photos of civilians suffering under Soviet military intervention, Rambo refuses and Trautman proceeds with the mission. Soviet forces ambush Trautman's convoy, capture him, and send him to a mountain base to be interrogated by Colonel Zaysen and his henchman Kourov.\nRambo learns of Trautman's capture from embassy field officer Robert Griggs and convinces the official to take him through a clandestine operation, though Griggs warns him that the government will deny of his existence if he is captured or killed. Rambo immediately flies to Peshawar, Pakistan and has the local arms supplier Mousa Ghani to bring him to Khost, a town in southern Afghanistan close to the Soviet base where Trautman is jailed. The mujahideen in the village, led by chieftain Masoud, are already hesitant to help Rambo in the first place, but are definitely convinced not to help him when their village is attacked by Soviet helicopters after one of Mousa's shop assistants tips off the Soviets. Aided only by Mousa and a young boy named Hamid, Rambo makes his way to the Soviet base and starts his plan to free Trautman. The first attempt is unsuccessful and Hamid and Rambo are wounded in the process while fighting a number of Russian troops. After escaping from the base, Rambo tends to Hamid's wounds and sends him and Mousa away to safety, before cauterizing his own wound.\nRambo recovers and infiltrates the base again the following day, just in time to rescue Trautman from being tortured with a flamethrower. He and Trautman rescue several other prisoners and hijacks a Hind helicopter to escape the base. However, the helicopter is damaged as it departs and soon crashes, forcing Rambo and Trautman to continue on foot while the other prisoners run off to safety after wishing Rambo and Trautman good luck. Zaysen sends Kourov and a Spetsnaz team against the two, who easily eliminate them in a cave. As Rambo and Trautman try to make their way to Pakistan, Zaysen blocks them with a large mechanized force and orders them to surrender. However, Masoud's mujahideen forces attack the Soviets in a cavalry charge. In the ensuing battle, in which both Trautman and Rambo are wounded, Rambo manages to kill Zaysen by driving a tank into his helicopter. Rambo survives the explosion and gets out of the tank. At the end of the battle, Rambo and Trautman say goodbye to their mujahideen friends and leave Afghanistan to go home.\n\nI ripped a blu ray into this smaller mkv.  The last few minutes of the end credits are distorted but the movie is ok.  If you want a perfect copy dont download this file.  ","torrent":{"xt":"urn:btih:5bc502b8862854c7762ec726661ec86a4129a8c2","amp;dn":"Rambo+3+1080p+H.264+mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bc502b8862854c7762ec726661ec86a4129a8c2","infoHashBuffer":{"type":"Buffer","data":[91,197,2,184,134,40,84,199,118,46,199,38,102,30,200,106,65,41,168,194]},"announce":[],"urlList":[]}}