{"title":"Anal Xcavators (Martin Del Toro Red Light District) 2006","uid":14660354,"size":1467359283,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5c4c0a900be72d8bb8278b7bb89f84e7e6aba6fa&amp;dn=Anal+Xcavators+%28Martin+Del+Toro+Red+Light+District%29+2006&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":6,"time":1463743831,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4047922418\r\n \nhttp://imagedisco.net/?g=6058449945\r\n\r\n\r\nPlot:\r\n\r\nFive anal angels beg to get their ass pipes rammed clean with huge pumping meat! Redefining hardcore, these sluts take everything that is thrown at them. In this case it happens to be big dicks. A lot of them. Getting throat fucked or two cocks rammed into their gaping asshole, these girls do it all!\r\n\r\nScene 1: Nadia Styles\r\nA truly evil looking man, holding a knife has Nadia Styles captive in a closet. He invites a few buddies over for a little abuse. Nadia is a cute little lady with a small body, highlighted by a red leather corset and matching heels. She's allowed out of the closet to satisfy the three guys, starting with her mouth, which she does earnestly, until drool is all over her face. The first guy wastes no time with her twat and goes right for her brown eye. Nadia does the anal taste testing, asking for more. Nadia gets the full blow poop shoot salute on this scene, climaxing with Nadia having her mouth treated as a cum dumpster by all three guys. All anal to the extreme.\r\n\r\nScene 2: Jamie Elle\r\nThe next scene starts with showing another psycho's dirty secret of having half naked porn stars hidden in their closet. Jamie makes her way out bound and gagged, dressed in some funky fetish wear, highlighting her slim figure and long dirty blonde hair. She looks scared at first, but soon warms up to the notion of sucking some serious cock until she gags. A neighbor stops by and is offered a portion of Jamie's bald pussy, which he happily slams aggressively. The guys take turns poking Jamie's pooper, including a motivated double penetration. Ass to mouth, gaping assholes, with a stocking over Jamie's head until she's covered in man mayo before being returned to the closet.\r\n\r\nScene 3: Cindy Sterling\r\nA pair of psychos have poor Cindy Sterling, bound and gagged in the back of a car, and the two decide to take her for a test drive. Cindy is a slim woman with dirty blonde hair and an appetite to suck dick. She takes on both cocks well, before one brave adventurer takes his cock and rams it in her bald, pierced twat. Rectal reaming comes into playwith Cindy getting sodomized well and often in this scene. She even gets her armpits fucked (really) before the two guys jerk off down her throat.\r\n\r\nScene 4: Monica Sweetheart\r\nMonica Sweetheart is tied up behind the bar, wearing nothing more than large fishnets, boots and a tank top. The psycho releases her to show off a tightly shaved pussy. Monica is a cute woman who acts timid and shy before warming up to her role of fuck toy. The pool boy decides to help the homeowner with nailing Monica, much like two guys would share a game of pool. Monica gets her face, pussy and ass fucked by both guys hard, but this scene lacked energy. Monica looks fantastic, but didn't bring her 'a' game to this scene. Monica goes back to the bar, covered in semen and her fishnets wrapped around her face.\r\n\r\nScene 5: Sandra Romain\r\nTwo guys pull up to their spot and look to show off their &quot;life&quot;, like a twisted version of &quot;cribs&quot;. As part of the tour, the two show off Anal queen Sandra Romain locked in a cupboard, wearing only a mini skirt and heels. After searing her with a chainsaw, the wailing Sandra, thankful for her life, begs for the guys to fuck her ass, sparking her pussy. Sandra, is a dynamo with naturally large tits, back hair and a desire to get her ass penetrated. In a super rough scene, Sandra takes hard anal sex, including some rough double anal. This is a very enthusiastic scene from Sandra, who remains one of my favorite butt sluts.\r\n\r\nSummary: This Red Light District release features some really blatant disregard for woman's rights, portraying women like treating the women like pieces of meat. I know I'm going to hell, but I really liked it. Director Martin Del Toro created the fantasy of captive women who's sole purpose was to be tied in a closet awaiting their captors next sexual need","torrent":{"xt":"urn:btih:5c4c0a900be72d8bb8278b7bb89f84e7e6aba6fa","amp;dn":"Anal+Xcavators+%28Martin+Del+Toro+Red+Light+District%29+2006","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4c0a900be72d8bb8278b7bb89f84e7e6aba6fa","infoHashBuffer":{"type":"Buffer","data":[92,76,10,144,11,231,45,139,184,39,139,123,184,159,132,231,230,171,166,250]},"announce":[],"urlList":[]}}