{"title":"EnigmaT Set Rips { Cuts } - January 17th, 2014","uid":9488898,"size":541847734,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5ca74b5a6146bb0156a98602fb988184b75114f0&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+January+17th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":67,"time":1389959324,"description":"Access feat. Martina Kay - Speranza (Allen &amp; Envy Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nAd Brown - More (Ltn Remix) (Cut From LTN Set)-enTc.mp3\nAd Brown And Shawn Mitiska - Pulse (Jaap Ligthart Remix) (Cut From Ad Brown Set)-enTc.mp3\nAeden - Destinations (Cosmic Heaven Remix) (Cut From Above Clouds Set)-enTc.mp3\nAerosoul - Time Is By Your Side (Dan Sieg '12 Bootleg) (Cut From Aerosoul Set)-enTc.mp3\nAlexey Ryasnyansky - Mad Love (AERO 21 Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nArs - Wonderworks (Ltn Remix) (Cut From LTN Set)-enTc.mp3\nATB feat. Stanfour - Face To Face (Rudee Remix) (ASOT 648 Rip)-enTc.mp3\nBasil O'Glue - Occult (Cut From Glue Set)-enTc.mp3\nBeatsole - Do Not Give Up! (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nBiologik - Saphire (Shane Robinson Remix) (Cut From LTN Set)-enTc.mp3\nBruno Motta - Friendzoned (Original Mix) (Cut From Aerosoul Set)-enTc.mp3\nChris Schweizer - Phoenix (ASOT 648 Rip)-enTc.mp3\nDaniel Kandi vs Markus Wilkinson - Cityscape (ASOT 648 Rip)-enTc.mp3\nDario Sorano - Impulse (Original Mix) (Cut From Patterson Set)-enTc.mp3\nDarren Tate vs Jono Grant - Let The Light Shine In (Tenishia Rework) (ASOT 648 Rip)-enTc.mp3\nDavick - Nuclear (Original Mix) (Cut From MIKE Set)-enTc.mp3\nDelfii &amp; Beta5 - Christmas Eve (Cut From Aurosonic Set)-enTc.mp3\nDisclosure - F For You (Totally Enormous Extinct Dinosaurs Remix) (Cut From Blake Set)-enTc.mp3\nDJ Observer &amp; Daniel Heatcliff featuring Madeleine Rison - Vision (Lentos Dub) (GDJB Rip)-enTc.mp3\nE-Clip &amp; Symbolic - Live Your Life (Original Mix) (Cut From Patterson Set)-enTc.mp3\nEDU &amp; Kristoffer Ljungberg - Around The Sun (Dan Stone Remix) (ASOT 648 Rip)-enTc.mp3\nEdu Padilla - Carrousel (GDJB Rip)-enTc.mp3\nEleven.five - Remind Me Again (Original Mix) (Cut From Jaytech Set)-enTc.mp3\nEvave - Till You Fly (Skylight Remix) (Cut From Aurosonic Set)-enTc.mp3\nFabio XB feat. Christina Novelli - Back To You (Wach Remix) (ASOT 648 Rip)-enTc.mp3\nFehrplay - All By Myself (Original Mix) (Cut From Blake Set)-enTc.mp3\nFerrin Morris feat. Hysteria! - Changes (ASOT 648 Rip)-enTc.mp3\nGiuseppe Ottaviani feat. Alana Aldea - Heal This Empty Heart (John O'Callaghan Remix) (ASOT 648 Rip)-enTc.mp3\nHells Kitchen - Tria (PHM Remix) (Cut From Barone Set)-enTc.mp3\nID - ID (Christopher Vassilakis Remix) (Cut From Glue Set)-enTc.mp3\nJimmy Chou - Madison (NoMask Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nJonas Stenberg - Overworld (Alexander Popov Remix) (ASOT 648 Rip)-enTc.mp3\nKaspar Kochker - Life is Wonderful (Cut From Aurosonic Set)-enTc.mp3\nKlauss Goulart featuring Amanda Wilson - Live for Now (Absolute Chaos) (GDJB Rip)-enTc.mp3\nKristoffer Ljungberg - Confusion (Original Mix) (Cut From Ad Brown Set)-enTc.mp3\nLisa Lashes - ARPWave (Champa Remix) (Cut From CL Set)-enTc.mp3\nLisa Lashes - ARPwave (Original Mix) (Set Rip)-enTc.mp3\nLtn - Teardrops (Cut From LTN Set)-enTc.mp3\nMarius Ene - Out Of The Night (Cut From Barone Set)-enTc.mp3\nMarkus Schulz - In the Shadows (-OvErSpAmMeD- GDJB Rip)-enTc.mp3\nMatt Chowski - Simply Magic (Emanuele Congeddu's Magical Touch) (Cut From Romel Set)-enTc.mp3\nMaywave - Flames (GDJB Rip)-enTc.mp3\nMimax - Insomnia (Audiko Remix) (Cut From Kristina Sky Set)-enTc.mp3\nMindset - Sun On My Shoulders (Original Mix) (Cut From EDU Set)-enTc.mp3\nMisja Helsloot - B.O.T.S. (Cut From Helsloot Set)-enTc.mp3\nMitaric - Track Thirty One (Marcelo Paladini Remix) (Cut From Barone Set)-enTc.mp3\nMizuh - Transcedental (Original Mix) (Cut From Aerosoul Set)-enTc.mp3\nMoschic - Do it to me Now (Gai Barone Starsk Remix) (Cut From Barone Set)-enTc.mp3\nMotorcycle - As The Rush Comes (Novaline Remix) (ASOT 648 Rip)-enTc.mp3\nNeeba - The Elements (Danny Young Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nNikita Rise &amp; Roman Akrill - Everything Will Be Fine (Dub Mix) (Cut From Aurosonic Set)-enTc.mp3\nPaul Hazendonk &amp; Noraj Cue - Inner Monologues (Bastards of Funk and Sonic Union Remix) (Cut From Barone Set)-enTc.mp3\nPAX - Xenon (GDJB Rip)-enTc.mp3\nRenato Cohen - Pontape 2013 Remake (Wrechiski Perpetual Edit) (GDJB Rip)-enTc.mp3\nRoman Messer feat. Christina Novelli - Frozen (ASOT 648 Rip)-enTc.mp3\nRuben De Ronde Feat. Aelyn - She's Already Gone (Ltn Remix) (Cut From LTN Set)-enTc.mp3\nSensetive5 &amp; Max Meyer - Bilbao Sunrise (Zack Roth Remix) (Cut From Ad Brown Set)-enTc.mp3\nSnr - What Happens There (Ltn Lowride Remix) (Cut From LTN Set)-enTc.mp3\nSou Kanai - Liberty (Original Mix) (Cut From Temple One Set)-enTc.mp3\nSpace RockerZ and Cathy Burton - Lead You Back (ASOT 648 Rip)-enTc.mp3\nSygnus - A New Direction (Original Mix) (Cut From DJ Leon Set)-enTc.mp3\nTalla 2XLC - Never Look Back (Darren Porter Remix) (ASOT 648 Rip)-enTc.mp3\nValer den Bit - Symphonica (Denis Neve Remix) (Cut From Aurosonic Set)-enTc.mp3\nVlad Varel - Miami (Aimoon Remix) (ASOT 648 Rip)-enTc.mp3\nWize - Midnight Calls (We Are Creators Remix) (Cut From Jaytech Set)-enTc.mp3\nYahel - Dune (Benjani Remix) (GDJB Rip)-enTc.mp3\n","torrent":{"xt":"urn:btih:5ca74b5a6146bb0156a98602fb988184b75114f0","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+January+17th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca74b5a6146bb0156a98602fb988184b75114f0","infoHashBuffer":{"type":"Buffer","data":[92,167,75,90,97,70,187,1,86,169,134,2,251,152,129,132,183,81,20,240]},"announce":[],"urlList":[]}}