{"title":"[DUTCH] Marcel Messing; 2 documentaires; Worden Wij Wakker &amp; Het","uid":4196864,"size":1923550162,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cb8acc2c33a934345607244935103674ff98e3f&amp;dn=%5BDUTCH%5D+Marcel+Messing%3B+2+documentaires%3B+Worden+Wij+Wakker+%26+Het&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lucasdr","files":4,"time":1211275343,"description":"WORDEN WIJ WAKKER?\n\nInterview met Marcel MEssing naar aanleiding van het verschijnen van zijn gelijknamige boek.\nDe auteur spreekt open over de machten en krachten op en achter het wereldtoneel en gaat daarbij ook terug naar de oorsprong daarvan.\nHij acht het van groot belang dat de mens de geheime machtsagenda, welke leidt tot een alsmaar groeiende wereldheerschappij, gaat doorzien. Een agenda, waarbij technologie en allerhande controle-mechanismen een belangrijke rol spelen.\nIn de huidige transformerende overgangsfase van planeet en mensheid kan nu nog veel lijden worden afgewend, wanneer wij tijdig ontwaken.\nVraag en antwoord over de ware spirituele bestemming van de mens en hoe wij daar naar toe kunnen groeien in dit cruciaal tijdsgewricht.\n\n\n\nHET WITTE GAT\n\nOntsnappingsmogelijkheid uit de matrix van illusie;\n\nHet individuele bewustzijn is in een crisis geraakt, maar staat tegelijkertijd voor een ongekend evolutiemoment: Een boeiend vraaggesprek over het aflopen van de kosmische klok richting 2012 en ons gezamenlijk spirituele pad naar wie wij werkelijk zijn.\n\nIn een wereld van verbrokkeling, fragmentatie en isolement laat Marcel Messing zich steeds meer omschrijven als een onafhankelijk leraar met een totaalvisie op mens, kosmos en maatschappij.\nHij studeerde antropologie, filosofie en vergelijkende godsdienstwetenschap, publiceerde talloze boeken en gaf inmiddels meer dan duizend lezingen en studiedagen in binnen- en buitenland. Onvermoeibaar spoort hij aan tot zelfonderzoek en zelfstandig denken","torrent":{"xt":"urn:btih:5cb8acc2c33a934345607244935103674ff98e3f","amp;dn":"%5BDUTCH%5D+Marcel+Messing%3B+2+documentaires%3B+Worden+Wij+Wakker+%26+Het","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cb8acc2c33a934345607244935103674ff98e3f","infoHashBuffer":{"type":"Buffer","data":[92,184,172,194,195,58,147,67,69,96,114,68,147,81,3,103,79,249,142,63]},"announce":[],"urlList":[]}}