{"title":"Various Artists - Plug It In! Turn It Up! Electric Blues - The D","uid":9572870,"size":528191560,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5d9fb2217795e496d730734e1d181f77c52c0a5f&amp;dn=Various+Artists+-+Plug+It+In%21+Turn+It+Up%21+Electric+Blues+-+The+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"terrenmcconn","files":-1,"time":1391654118,"description":"mp3 v0\n\nVarious Artists - Plug It In! Turn It Up! Electric Blues - The Definitive Collection, Pt. 4: 1970-2005 [2012]\n\nOriginal Release / Bear Family / BCD 16924 CP / CD\n\n(3 CD-digipac with 172-page booklet) Blues historian and musicologist Bill Dahl from Chicago has produced the most comprehensive history of electric blues ever! With nearly 300 tracks, BEAR FAMILY RECORDS is telling the story from the beginning into the new millennium. Every significant artist... every significant recording from the 1930s to the present day, including T-Bone Walker, Muddy Waters, Howlin' Wolf, George Thorogood, and Freddie, B.B. and Albert King, Jeff Beck, Fleetwood Mac, Charlie Musselwhite, Eric Clapton, and Stevie Ray Vaughan, and literally hundreds more! Cross-licensed from every record company to be truly comprehensive!\n\nIn the 1930s, the invention of Gibson's ES-150 - the first electric guitar - changed popular music forever. The first generation of blues pioneers played acoustic instruments, but with the invention of amplification, guitar and harmonica players could be heard over the piano, drums and horns. Music was revolutionized!\n\nThis is one of four 3-CD sets in elegant deluxe digipacs. All four sets combined add up to 12 generously full CDs plus more than 650 pages in four lavishly illustrated booklets, in which Bill Dahl writes authoritatively about the history of electric blues, and how it influenced rock music during the 1960s and beyond. Here's the complete story from jazz-inspired jump numbers in the late 1930s to hard-driving blues/rock from the States and Great Britain in the 1960s, '70s, and beyond. The journey closes with today's contemporary blues. This is it! Truly definitive! Done as only BEAR FAMILY can do it!\n\nAllmusic.com\nIn some ways, the fourth installment of Bear Family's four-volume Plug It In! Turn It Up! Electric Blues - The Definitive Collection is the most important -- not because this was the most innovative period for electric blues but rather the years of 1970-2005 are generally considered to be when the genre was rather dormant. Certain acts had hits now and then, but the blues weren't ruling the R&amp;B charts and rock &amp; roll starts to shed its blues influence during the '70s, so its presence doesn't seem as immediate. Nevertheless, this fourth volume proves that electric blues not only has a rich legacy but that it is one that continues into the modern era, both by old hands (Buddy Guy pops up with his 1991 &quot;Damn Right, I've Got the Blues&quot;) and new (Robert Cray's &quot;Smoking Gun,&quot; which actually crossed over into the Top 40). Most of the major names of soul-blues and mainstream blues are here -- B.B. King, Al Green, Z.Z. Hill, O.V. Wright, Bobby Rush, Bobby &quot;Blue&quot; Bland, Albert King -- and this also traces the rise of Alligator Records (Hound Dog Taylor's &quot;Give Me Back My Wig&quot; still sounds nasty all these years later), grapples with such rock bands as the J. Geils Band and ZZ Top, and makes a case for the influence of Stevie Ray Vaughan and the Fabulous Thunderbirds. While it doesn't necessarily make a case for the next generation -- some of the newer tracks toward the end of the set are by old guys like R.L. Burnside -- this fourth volume does prove that electric blues remained vital well into the new millennium.\n\n\nTracks\n\nDisc 1\n\n01 - Taylor, Ted - Something Strange Is Goin' on in My House\n02 - Green, Al - I Can't Get Next to You\n03 - Tolbert, Israel 'Popper Stopper' - Beg Leg Woman (With a Short Mini Skirt)\n04 - Coday, Bill - Get Your Lie Straight\n05 - Hill, Z. Z. - Don't Make Me Pay for His Mistakes\n06 - Wright, O. V. - A Nickel and a Nail\n07 - Rush, Bobby - Chicken Heads\n08 - Taylor, Lilttle Johnny - Everybody Knows About My Good Thing\n09 - Simon, Joe - Drowning in the Sea of Love\n10 - Little Beaver - Joey\n11 - Little Milton - That's What Love Willl Make You Do\n12 - Peebles, Ann - Breaking up Somebody's Home\n13 - King, Albert - I'll Play the Blues for You\n14 - LaSalle, Denise - Man Sized Job\n15 - Lavette, Betty - Your Turn to Cry\n16 - Little Sonny - It's Hard Going Up (But Twice as Hard Coming Down)\n17 - King, B. B. - To Know You Is to Love You\n18 - Taylor, Johnnie - Cheaper to Keep Her\n19 - Latimore - Let's Straighten It Out\n20 - Bland, Bobby - I Wouldn't Treat a Dog (The Way You Treated Me)\n21 - Johnson, Syl - Take Me to the River\n22 - Davis, Tyrone - Turning Point\n23 - Watson, Johnny 'Guitar' - Ain't That a Bitch\n24 - White, Artie - (You Are My) Leanin' Tree\n\nDisc 2\n\n01 - King, B. B. - The Thrill Is Gone\n02 - Winter, Johnny - Memory Pain\n03 - King, Freddie - Going Down\n04 - J. Geils Band - Homework\n05 - Rush, Otis - Right Place, Wrong Time\n06 - Taylor, Hound Dog - Give Me Back My Wig\n07 - Willis, Chick - Stoop Down Baby\n08 - Gallagher, Rory - Should've Learnt My Lesson\n09 - Buchanan, Roy - After Hours\n10 - Seals, Son - Your Love Is Like a Cancer\n11 - Elvin Bishop Group, The - Stealin' Watermelons\n12 - Allison, Luther - Luther's Blues\n13 - James Cotton Band, The - Boogie Thing\n14 - ZZ Top - La Grange\n15 - Robinson, Fenton - Somebody Loan Me a Dime\n16 - Wells, Junior - The Train I Ride\n17 - McClinton, Delbert - Before You Accuse Me\n18 - Raitt, Bonnie - Runaway\n19 - Taylor, Koko - Hey Bartender\n20 - Roomful of Blues - Duke's Blues\n21 - Clearwater, Eddie - Bad Dream\n\nDisc 3\n\n01 - Hollywood Fats Band - Rock This House\n02 - Collins, Albert - Brick\n03 - Hill, Z. Z. - Down Home Blues\n04 - Copeland, Johnny - Claim Jumper\n05 - Brown, Clarence 'Gatemouth' - Dollar Got the Blues\n06 - Thorogood, George &amp; The Destroyers - Bad to the Bone\n07 - Vaughan, Stevie Ray &amp; Double Trouble - Pride and Joy\n08 - Brooks, Lonnie - Don't Take Advantage of Me\n09 - Fabulous Thunderbirds, The - Tuff Enuff\n10 - Cray, Robert - Smoking Gun\n11 - Walker, Joe Louis - Cold Is the Night\n12 - Guy, Buddy - Damn Right, I've Got the Blues\n13 - Ward, Robert - Your Love Is Real\n14 - Eaglin, Snooks - Red Beans\n15 - Kimbrough, Junior &amp; The Soul Blues Boys - All Night Long\n16 - Burnside, R. L. - Old Black Mattie\n17 - Earl, Ronnie &amp; The Broadcasters - Robert Nighthawk Stomp\n18 - Allison, Luther - Bad Love\n19 - Adams, Arthur - Backup Man\n20 - Moss, Nick &amp; The Flip Tops - Check My Pulse","torrent":{"xt":"urn:btih:5d9fb2217795e496d730734e1d181f77c52c0a5f","amp;dn":"Various+Artists+-+Plug+It+In%21+Turn+It+Up%21+Electric+Blues+-+The+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d9fb2217795e496d730734e1d181f77c52c0a5f","infoHashBuffer":{"type":"Buffer","data":[93,159,178,33,119,149,228,150,215,48,115,78,29,24,31,119,197,44,10,95]},"announce":[],"urlList":[]}}