{"title":"Campbell-Assault at Ruby Creek,Idaho Massacre(Ruby Ridge inciden","uid":4738307,"size":5868628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5db362fc5c5223d04f95218e054e71084ddc5808&amp;dn=Campbell-Assault+at+Ruby+Creek%2CIdaho+Massacre%28Ruby+Ridge+inciden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1235416671,"description":"This is Maynard C. Campbell Jr.'s shocking book Assault at Ruby Creek, the Idaho Massacre (1993) which is the &quot;underground&quot; story of the siege against Randy Weaver's family at Ruby Ridge in Idaho and the tragic end it brought about. Many still remember Ruby Ridge as the site of a violent confrontation and siege in the U.S. state of Idaho in 1992. It involved Randy Weaver, his family, Weaver's friend Kevin Harris, federal agents from the United States Marshals Service and the Federal Bureau of Investigation. The incident was like most other major events in America in that the media was ever present but still managed to misreport so much. Written very soon after the standoff by an author that was already persecuted by the system which later killed him in the jail (stabbed to death and left to die). This rare book also contains hand-written letters of the Weaver family members which clearly show the dreadful psychological stress they were undergoing and their religious convictions. Assault at Ruby Creek is the story of an American atrocity and clearly exposes the totalitarian intents of the big brother New World Order which wants to destroy the christian family values and religion. Find out how US federal agents murdered helpless citizens in a gross display of government power against a single christian family who wanted nothing more than to live in peace under god, outside of modern society. For those of you who are awake enough to realize that US government and it's media are prone to dis-information, mis-information and outright lies, here is the rest of the story! 80 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:5db362fc5c5223d04f95218e054e71084ddc5808","amp;dn":"Campbell-Assault+at+Ruby+Creek%2CIdaho+Massacre%28Ruby+Ridge+inciden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db362fc5c5223d04f95218e054e71084ddc5808","infoHashBuffer":{"type":"Buffer","data":[93,179,98,252,92,82,35,208,79,149,33,142,5,78,113,8,77,220,88,8]},"announce":[],"urlList":[]}}