{"title":"Follia.2005.iTALiAN.DVDRip.XviD-BABiES[volpebianca]","uid":4501248,"size":733915136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e189d94b9e108ee0936cf0186d3586e1c256ac8&amp;dn=Follia.2005.iTALiAN.DVDRip.XviD-BABiES%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ivanone","files":1,"time":1226363610,"description":"Follia\n\nTitolo originale:  \tAsylum\nNazione:  \tRegno Unito\nAnno:  \t2005\nGenere:  \tDrammatico, Thriller\nDurata:  \t105&amp;#039;\nRegia:  \tDavid Mackenzie\nSito ufficiale:  \twww.paramountvantage.com/asylum\n\nCast:  \tNatasha Richardson, Ian McKellen, Marton Csokas, Hugh Bonneville, Gus Lewis, Joss Ackland, Wanda Ventham\nProduzione:  \tMace Neufeld Productions, Samson Films, Seven Arts Pictures, Zephyr Films Ltd.\nDistribuzione:  \tNoShame Films\nData di uscita:  \t15 Giugno 2007 (cinema)\n\nTrama:\nStella Raphael, moglie di un illustre psichiatra, si ritrova a vivere con il figlio nei pressi del manicomio diretto dal dottor Peter Cleave a causa del suo nuovo incarico assunto dal consorte. Stella ÃƒÂ¨ una donna profondamente inquieta e in realtÃƒÂ  sotterraneamente insoddisfatta della propria condizione di moglie e madre. Tra i pazienti del dottor Cleave, c&amp;#039;ÃƒÂ¨ anche Edgar Stark, un artista tormentato e divorato da una patologica forma di gelosia psicotica che lo ha spinto anni prima a massacrare la moglie. Cleave, profondamente attratto da Stark, in quanto affascinato dalle personalitÃƒÂ  artistiche, essendo egli probabilmente un artista mancato, nota durante il ricevimento indetto per celebrare l&amp;#039;arrivo del dottor Raphael che tra Stella ed Edgar scatta una scintilla d&amp;#039;attrazione. Stella, sconvolta dal desiderio che prova per Edgar, per la sua sensuale vulnerabilitÃƒÂ  che sembra celare anche oscure minacce, prova a mettere a tacere la sua angoscia. Poi non puÃƒÂ² fare a meno di cedere. Edgar e Stella si amano furiosamente, rabbiosamente. Con un&amp;#039;intimitÃƒÂ  sconcertante. Come se i loro corpi si conoscessero da sempre. Cleave, che dietro la sua gelida maschera di distacco professionale cova in realtÃƒÂ  un disperato quanto impotente amore per Stella, osserva i due amanti divincolarsi nel loro desiderio proibito. Stella, schiava ormai della sua passione per Edgar, diventa imprudente. Scoppia uno scandalo feroce. Il dottor Raphael, pur di salvare l&amp;#039;apparenza della sua rispettabilitÃƒÂ  borghese, perdona la moglie. Stella perÃƒÂ² sa che si tratta solo di una per lei ormai inaccettabile forma di ipocrisia e decide di vivere sino in fondo il suo amore per Edgar. Stella lascia il marito e va a vivere con Edgar nel frattempo fuggito dal manicomio. Poco alla volta, perÃƒÂ², in Edgar riemergono i segni della sua folle gelosia. La donna, pur profondamente attratta dall&amp;#039;uomo, inizia a vivere nel terrore delle sue reazioni violente.","torrent":{"xt":"urn:btih:5e189d94b9e108ee0936cf0186d3586e1c256ac8","amp;dn":"Follia.2005.iTALiAN.DVDRip.XviD-BABiES%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e189d94b9e108ee0936cf0186d3586e1c256ac8","infoHashBuffer":{"type":"Buffer","data":[94,24,157,148,185,225,8,238,9,54,207,1,134,211,88,110,28,37,106,200]},"announce":[],"urlList":[]}}