{"title":"Dead&amp;Breakfast Soundtrack Zacharia&amp;The Lobos Riders FLAC","uid":8916225,"size":141426034,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e26ad32462c3763dc50eba31ace35be1677039d&amp;dn=Dead%26amp%3BBreakfast+Soundtrack+Zacharia%26amp%3BThe+Lobos+Riders+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Xenux_","files":-1,"time":1379147151,"description":"Tracks ripped with Sound Juicer \n\nFLAC 16/44\n\n\n1.  Possessed (Is The Way To Be)\n2.  &quot;Traumatized&quot;\n3.  We're Comin' To Kill Ya\n4.  &quot;Hand Me Some Chew&quot;\n5.  &quot;Johnny Stay Away From That Box&quot;\n6.  Riding The Rails\n7.  &quot;David Kicks Ass&quot;\n8.  &quot;Ten Bucks That All Three Die&quot;\n9.  Quiet LIttle TOwn\n10.  My Favorite Notes In The World\n\n\nMovie link &lt;a href=&quot; http://www.imdb.com/title/tt0350774/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0350774/?ref_=fn_al_tt_1&lt;/a&gt;\n\nArtist link &lt;a href=&quot; http://www.zachariahmusic.com/main.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.zachariahmusic.com/main.html&lt;/a&gt;\n\n                                  Movie Plot: \n\nSix friends, Christian (Jeremy Sisto), David (Erik Palladino), Kate (Bianca Lawson), Johnny (Oz Perkins), Sara (Ever Carradine) and Melody (Gina Philips), are traveling in an R.V. to get to the wedding of their friend, Kelly (Portia de Rossi), in Galveston, Texas. However they become lost in a small town called Lovelock, and decide to spend the night at the local Bed &amp; Breakfast, owned by the creepy Mr Wise (David Carradine). While staying, the group insult the chef, Henri (Diedrich Bader), causing an argument to break out. After everyone goes to bed, David goes to the kitchen to get a snack, only to discover Henri brutally murdered, before Mr Wise suffers a heart attack.\n\nWith the phone line broken it takes until morning for the Sheriff (Jeffrey Dean Morgan), and his Deputy, Enus (Mark Kelly), to be summoned for help. The Sheriff is quick to suspect the group, and takes the keys to the R.V. away, so they can not leave the town until the investigation is over. The group goes into town, while the Sheriff arrests a mysterious drifter (Brent David Fraser), who quickly becomes the prime suspect. The drifter warns Christian and Sara of ancient exotic wooden box, that Sara realizes belongs to Mr Wise. However it is too late, as Johnny arrives back at the bed &amp; breakfast and opens the box, unleashing the &quot;Kuman Thong&quot; which possesses him, causing him to savagely murder various people. Meanwhile, Christian and Sara meet town local Lisa Belmont (Miranda Bailey) who swears she saw Mr Wise dig up the body of his dead son and perform a form of black magic on the body. Sara and Christian return to the bed &amp; breakfast and discover Johnny has opened the box.\n\nSara and Christian alert the Sheriff, who drives them to a local party, that David, Kate and Melody are attending with the rest of the town folk. The possessed Johnny arrives and a bloody massacre ensues, with the town folk, including Enus, becoming zombies as Johnny puts various body parts of his victims in the box. In the chaos, Christian is decapitated as David, Kate, Sara and Melody escape with the Sheriff in a truck. They accidentally run over the drifter, knocking him unconscious after he escapes from his prison cell. Taking him with them, the radiator soon blows in the truck, forcing the group to take shelter in the bed &amp; breakfast. They gather weapons, before the drifter tells them they must retrieve the body of Mr Wise to kill Johnny. The zombies arrive at the bed &amp; breakfast and the group fend them off, before the Sheriff, Melody and the drifter sneak out the back door to retrieve the bones of Mr Wise.\n\nAt the bed &amp; breakfast, the zombies retrieve some of David's blood that was on the step of the house, placing it in the box causing him to become possessed. David beats Kate to death with a metal pole, before attacking Sara. However Sara manages to kill David with a chainsaw. At the cemetery, the Sheriff, Melody and the drifter retrieve the body of Mr Wise and perform a black magic spell, taking the bones from the body. As they travel to the bed &amp; breakfast they encounter a group of zombies. The Sheriff has his neck snapped, killing him, before Lisa arrives and rescues the drifter and Melody, who continue on to the bed &amp; breakfast. Meanwhile, at the bed &amp; breakfast, the zombies break in. Sara fights them, but is soon cornered. The drifter, and Melody arrive outside, where Melody shoots Johnny through the heart with a bone from the body of Mr Wise, killing him and the other zombies. Sara reunite with Melody and the drifter, and together they leave Lovelock in their R.V.","torrent":{"xt":"urn:btih:5e26ad32462c3763dc50eba31ace35be1677039d","amp;dn":"Dead%26amp%3BBreakfast+Soundtrack+Zacharia%26amp%3BThe+Lobos+Riders+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e26ad32462c3763dc50eba31ace35be1677039d","infoHashBuffer":{"type":"Buffer","data":[94,38,173,50,70,44,55,99,220,80,235,163,26,206,53,190,22,119,3,157]},"announce":[],"urlList":[]}}