{"title":"Art Hodes Blue Five &amp; Six - 1989 - Midnight Blue FLAC","uid":8712192,"size":250067769,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f42e545465f8b610e16a13cb42703e95dbfb241&amp;dn=Art+Hodes+Blue+Five+%26amp%3B+Six+-+1989+-+Midnight+Blue+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1374261652,"description":"Art Hodes Blue Five &amp; Six - 1989 - Midnight Blue\n\nArtist Biography by Scott Yanow\nThroughout his long career, Art Hodes was a fighter for traditional jazz, whether through his distinctive piano playing, his writings (which included many articles and liner notes), or his work on radio and educational television. Renowned for the feeling he put into blues, Hodes was particularly effective on up-tempo tunes, where his on-the-beat chordings from his left hand could be quite exciting. Born in Russia, he came to America with his family when he was six months old and grew up in Chicago. Hodes had the opportunity to witness Chicago jazz during its prime years in the 1920s, and he learned from other pianists. In 1928, he made his recording debut with Wingy Manone, but spent most of the 1930s in obscurity in Chicago until he moved to New York in 1938. He played with Joe Marsala and Mezz Mezzrow before forming his own band in 1941. Hodes recorded for Solo Art, his Jazz Record label, Signature, Decca, and Black &amp; White during 1939-1942, but he made more of an impression with his heated Dixieland recordings for Blue Note during 1944-1945 (all of which have been reissued on a Mosaic box set). During 1943-1947, Hodes edited the important magazine the Jazz Record, had a radio show, and became involved in the moldy fig versus bebop wars with Leonard Feather and Barry Ulanov; jazz on a whole lost to the latter. In 1950, he returned to Chicago, where he remained active locally and made occasional records. Hodes hosted a television series, Jazz Alley, for a time in the 1960s, wrote for Downbeat, and was a jazz educator. Art Hodes recorded frequently during the 1970s and '80s, and was widely recognized as one of the last survivors of Chicago jazz. His later recordings were for such labels as Audiophile, Jazzology, Delmark, Storyville, Euphonic, Muse, Parkwood, Candid, and Music &amp; Arts. (AllMusic)\n\nTrack list:\n01 - I Want A Little Girl\n02 - Willie The Weeper\n03 - A Little Bit Of Yancey In London\n04 - Trouble In Mind\n05 - Canal Street Blues\n06 - Squeeze Me\n07 - Salty Dog\n08 - Old Stack O'Lee Blues\n09 - A Date With An Angel\n10 - Tin Roof Blues\n11 - Wrap Your Troubles In Dreams\n12 - Doctor Jazz\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:5f42e545465f8b610e16a13cb42703e95dbfb241","amp;dn":"Art+Hodes+Blue+Five+%26amp%3B+Six+-+1989+-+Midnight+Blue+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f42e545465f8b610e16a13cb42703e95dbfb241","infoHashBuffer":{"type":"Buffer","data":[95,66,229,69,70,95,139,97,14,22,161,60,180,39,3,233,93,191,178,65]},"announce":[],"urlList":[]}}