{"title":"Welcome Back, Kotter Classics-Disc 1of2 [dvdrip]","uid":4011783,"size":720096525,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f58c985aa9c7a0cbfd897f74467354d46f0a7a3&amp;dn=Welcome+Back%2C+Kotter+Classics-Disc+1of2+%5Bdvdrip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekolb","files":5,"time":1202142961,"description":"Welcome Back, Kotter was an American television sitcom that originally aired on the ABC network from September 9, 1975 to June 8, 1979.The show starred comedian Gabriel Kaplan as the title character Gabe Kotter, a wise-cracking teacher who returns to his high school alma mater?James Buchanan High in Brooklyn, New York?to teach an often unruly group of remedial wiseguys known as the &quot;Sweathogs.&quot;\n\nThe Sweathogs inner circle consisted of:\n\nVinnie Barbarino, (John Travolta) the leader of the Sweathogs. A handsome, charming (and selectively air-headed) Italian-American.\n \nJuan Epstein, (Robert Hegyes) the wild boy of the gang, a Puerto Rican Jew (or, more accurately, a Jewish Puerto Rican).\n\nFreddie &quot;Boom Boom&quot; Washington, (Lawrence Hilton-Jacobs) the hip African-American basketball enthusiast.\n\nArnold Horshack, (Ron Palillo) the diminutive oddball of the Sweathogs known for his wheezing laugh.\n \nKotter (Gabriel Kaplan) had attended the same remedial classes when he was a student at Buchanan and was a founding member of the Sweathogs. He soon befriends his students who often visit his Bensonhurst apartment, sometimes to the chagrin of his wife, Julie (Marcia Strassman).\n\nMost of the major characters of Welcome Back, Kotter were based on actual people from Kaplan&amp;#039;s teen years as a remedial high school student in Brooklyn. As a stand-up comic, one of Kaplan&amp;#039;s most popular routines was &quot;Holes and Mellow Rolls&quot;, in which he talked in depth about the kids with whom he had attended remedial education classes. The names of three of the four major characters in Holes and Mellow Rolls were changed for the TV series: &quot;Vinnie Barbarino&quot; was inspired by Eddie Lecarri; &quot;Freddie Washington&quot; was inspired by Freddie &quot;Furdy&quot; Peyton; and &quot;Juan Epstein&quot; was partially inspired by Epstein &quot;The Animal&quot;; only &quot;Arnold Horshack&amp;#039;s&quot; name remained unchanged.\n\n\nWelcome Back, Kotter&amp;#039;s beginning had its controversial moments.\n\nIn Boston, the local ABC affiliate (WCVB) refused to air the show. The city was going though a tumultuous school busing program to enhance racial equality and the local affiliate felt Kotter&amp;#039;s fictional integrated classroom would only add fuel to the fire. However, the show became an early ratings success and the affiliate relented, picking it up from its fifth episode.\n\nTeachers in other cities had concerns about how Kotter would be portrayed, so producers allowed a union representative on the set to ensure the show protected the image of those in the profession. Kaplan opposed the idea, at one point asking a reporter if there was a junkman on the set of Sanford and Son to protect the reputation of junkmen.\n\nThere were also concerns that the show would celebrate juvenile delinquency. However, these sentiments faded after the Sweathogs&amp;#039; antics proved to be more silly than scary. Like Kaplan, Hegyes was a fan of the Marx Brothers. Hegyes claims that he suggested that the Sweathogs be modeled after the Marx Brothers in order to reduce tension.\n \nBy the third season, the ratings began to slip. In an interview years later, Kaplan attributed the decline to the age of the actors playing the Sweathogs (Palillo was 30, Hegyes was 28, Hilton-Jacobs was 27 and Travolta was 25), saying they were no longer believable as high school students. His idea was that to have Kotter join the faculty of a community college attended by the Sweathogs. However, this storyline never materialized. To help lure more viewers, the Kotters had twin girls, but this didn&amp;#039;t prove to be enough to regain the show&amp;#039;s earlier momentum.\n\nMajor changes took place in the fourth and final season:\n\nTravolta, who had already starred in box office hits such as Grease and Saturday Night Fever, began to focus more time on his film career. He was featured in fewer than half of that year&amp;#039;s episodes and was billed a &quot;special guest star&quot;. It was Travolta&amp;#039;s phasing out from the storyline that was the primary contributor to the cancellation of the show itself.\n\nMr. Woodman was promoted to Principal of the school (Principal Lazarus retired), and Kotter was promoted to Vice-Principal, and the show&amp;#039;s focus moved away from Kotter&amp;#039;s class. Meanwhile, behind-the-scenes disputes led to limited appearances by Kaplan. To help fill the voids, Stephen Shortridge joined the cast as smooth-talking Southerner Beau De Labarre, and Kotter&amp;#039;s wife, Julie, becomes a secretary at the school. \n\nThe popular theme song Welcome Back, written and recorded by former Lovin&amp;#039; Spoonful frontman John Sebastian, became a #1 hit in the spring of 1976. The show was originally going to be called Kotter, but that was changed because of the theme song lyrics. Sebastian has said he tried to find a more general theme for the song after being unable to find any reasonable rhymes for Kotter. In recent times, a few songs have sampled the show&amp;#039;s theme song by hip-hop artists Onyx in &quot;Slam Harder&quot;, AZ in &quot;Once Again&quot;, and Mase in &quot;Welcome Back&quot;.\n\nDISC 1of2\n1) One Flu Over The Cuckoo&amp;#039;s Nest\n2) Father Vinnie\n3) Sweatside Story\n\nLenght 25 Minutes..(Average)\n\n[Video]\nFormat.......................: NTSC\nOrig. Source Aspect Ratio....: 4 : 3\nDisplay Aspect Ratio.........: 1.38\nResolution...................: 640 x 464\nColorDepth...................: 24 bit\nFramerate....................: 29.970 Frames/Sec\nCodec........................: XviD, 2 Pass mode\nBitrate......................: Avg. 1143 kBit/s\n\n[Audio]\nLanguage.....................: English [1 channels] AC3\nFormat.......................: MP3\nChannels.....................: 2 Channels (Surround Stereo)\nSampleRate...................: 48000 Hz\nBitrate......................: 128 kBit/s\nAudio Post-Processing........: None\n\nEnjoy! and please seed..\nEkolb..","torrent":{"xt":"urn:btih:5f58c985aa9c7a0cbfd897f74467354d46f0a7a3","amp;dn":"Welcome+Back%2C+Kotter+Classics-Disc+1of2+%5Bdvdrip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f58c985aa9c7a0cbfd897f74467354d46f0a7a3","infoHashBuffer":{"type":"Buffer","data":[95,88,201,133,170,156,122,12,191,216,151,247,68,103,53,77,70,240,167,163]},"announce":[],"urlList":[]}}