{"title":"When Technology Fails (ePUB,Retail){32Skulls}","uid":11042819,"size":12965506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f883b90cbab56efa10f006b8512fd816877ad27&amp;dn=When+Technology+Fails+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"32Skulls","files":-1,"time":1410896355,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nThere's never been a better time to &quot;be prepared.&quot; Matthew Stein's comprehensive primer on sustainable living skills--from food and water to shelter and energy to first-aid and crisis-management skills--prepares you to embark on the path toward sustainability. But unlike any other book, Stein not only shows you how to live &quot;green&quot; in seemingly stable times, but to live in the face of potential disasters, lasting days or years, coming in the form of social upheaval, economic meltdown, or environmental catastrophe.\n\nWhen Technology Fails covers the gamut. You'll learn how to start a fire and keep warm if you've been left temporarily homeless, as well as the basics of installing a renewable energy system for your home or business. You'll learn how to find and sterilize water in the face of utility failure, as well as practical information for dealing with water-quality issues even when the public tap water is still flowing. You'll learn alternative techniques for healing equally suited to an era of profit-driven malpractice as to situations of social calamity. \n\nEach chapter (a survey of the risks to the status quo; supplies and preparation for short- and long-term emergencies; emergency measures for survival; water; food; shelter; clothing; first aid, low-tech medicine, and healing; energy, heat, and power; metalworking; utensils and storage; low-tech chemistry; and engineering, machines, and materials) offers the same approach, describing skills for self-reliance in good times and bad.\n\nFully revised and expanded -- the first edition was written pre-9/11 and pre-Katrina, when few Americans took the risk of social disruption seriously -- When Technology Fails ends on a positive, proactive note with a new chapter on &quot;Making the Shift to Sustainability,&quot; which offers practical suggestions for changing our world on personal, community and global levels.\n\nBy Matthew Stein\nPublished by Chelsea Green Publishing in 2008\nEPUB, Retail, 493 pages, English\n","torrent":{"xt":"urn:btih:5f883b90cbab56efa10f006b8512fd816877ad27","amp;dn":"When+Technology+Fails+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f883b90cbab56efa10f006b8512fd816877ad27","infoHashBuffer":{"type":"Buffer","data":[95,136,59,144,203,171,86,239,161,15,0,107,133,18,253,129,104,119,173,39]},"announce":[],"urlList":[]}}