{"title":"FS2004-FSX- Instant Object Maker  1.02 + Serial","uid":4749565,"size":6715642,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:60094702b51400c5ec48456b1bf3f1782cfe3efc&amp;dn=FS2004-FSX-+Instant+Object+Maker++1.02+%2B+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"captainahmed","files":3,"time":1236106280,"description":"Instant Object Maker is an easy-to-use tool for making simple 3D objects for Flight Simulator.\n\nInstant Object Maker allows creating realistic looking objects using photographs or any other images. Simply outline individual polygons composing the object on one or more photographs and put them together to form a 3D object. Instant Object Maker automatically generates scenery and texture files. The perspective correction function allows using photographs taken at an angle. You can also paint your own images and construct 3D objects that use them as textures.\n\nIt takes just a few minutes to make simple objects like cars, trees and simple houses. And flat billboards and signs take less than one minute. With Instant Object Maker, everyone can add houses, hangars, vehicles and other objects that look exactly like their real counterparts, instead of relying on generic library objects. You can finally add your house to the scenery that looks exactly like your house!\n\nInstant Object Maker is very easy to learn and use. In more complicated 3D modeling tools, you first have to create an abstract-looking 3D model of your object, then make textures with an image editor and then apply the textures to the model to give it a realistic look. With Instant Object Maker, you cut individual parts of your object directly out of photographs, so that they are already textured. This makes it very easy to arrange individual parts to form the object. You don't have to use any image editors, because Instant Object Maker will automatically extract individual texture fragments out of your photographs, convert them according to your settings, calculate the optimum FS texture layout and produce the corresponding textures. And if you need to retouch anything, you can simply edit the original photograph and have the program rebuild the object.\n\nMaking flat objects like road signs and billboards is even easier. All you have to do is to draw the outline of the object on the photograph and tell Instant Object Maker it's real-world size and position. Do you need to paint a sign on a building or a hangar? Simply paint it with an image editor and use Instant Object Maker to place it into the scenery.\n\nInstant Object Maker allows you to either place your object by entering coordinates, or to create a library for use with Flight1's Instant Scenery object placement program.\n\nBy default, objects produced are in the FS2004 format and will work both with FSX and with FS2004. If you are designing exclusively for FSX, you also have an option to generate textures in the DXT5 format for better FSX performance.\n\nWe sell Instant Object Maker using the Flight1's wrapper system. Like all products sold using the wrapper, it comes with a 30-day money back guarantee. For a limited time only, we are offering this product at a special introduction price of just $19.95 US.\n\nInstant Object Maker uses the ImageTool program found in the Flight Simulator SDK. If you have FSX Deluxe edition, the SDK is already included and installed. If you are using FS2004 or FSX Standard edition, please download and install the FS2004 Terrain SDK which contains ImageTool.\n\nProgram features:\n\n    * Imports one or more images in JPG, GIF, PNG or BMP format.\n    * Allows making individual textured polygons by just outlining them on the photograph.\n    * Perspective correction function for correcting perspective distortions found on photographs taken at an angle.\n    * Offers 3D and wireframes views allowing you to combine and adjust individual textured polygons to form a 3D object.\n    * Offers a full textured preview of the object inside the program.\n    * Options to specify the resolutions of individual texture fragments.\n    * Option to make individual polygons stay lit at night.\n    * Automatically calculates the optimum texture layout and generates textures.\n    * Creates BGL files placing the object at the user-defined location.\n    * Alternatively creates libraries in BGL format for use with Flight1's Instant Scenery program.\n\nSystem requirements:\n\n    * An OpenGL-compatible graphics card and drivers.\n    * FSX or FS2004.\n    * FSX or FS2004 SDK installed. FS2004 SDK can be used with the FSX Standard Edition.\n    * At least 512MB of RAM recommended.\n","torrent":{"xt":"urn:btih:60094702b51400c5ec48456b1bf3f1782cfe3efc","amp;dn":"FS2004-FSX-+Instant+Object+Maker++1.02+%2B+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60094702b51400c5ec48456b1bf3f1782cfe3efc","infoHashBuffer":{"type":"Buffer","data":[96,9,71,2,181,20,0,197,236,72,69,107,27,243,241,120,44,254,62,252]},"announce":[],"urlList":[]}}