{"title":"Osho_Bodhidharma The Greatest Zen Master-10.avi","uid":15223295,"size":166162712,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6137156f14dc5a13359c2955fccc9a981028bd5b&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-10.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467751851,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #10\r\nChapter title: Not to be in the mind is everything\r\n9 July 1987 pm in Gautam the Buddha Auditorium\r\nLength: \t86 mins\r\nBELOVED BHAGWAN,\r\nUSING THE MIND TO LOOK FOR REALITY IS DELUSION. NOT USING THE MIND TO LOOK FOR REALITY IS AWARENESS. FREEING ONESELF FROM WORDS IS LIBERATION. REMAINING UNBLEMISHED BY THE DUST OF SENSATION IS GUARDING THE DHARMA. TRANSCENDING LIFE AND DEATH IS LEAVING HOME. NOT SUFFERING ANOTHER EXISTENCE IS REACHING THE WAY. NOT CREATING DELUSIONS IS ENLIGHTENMENT. NOT ENGAGING IN IGNORANCE IS WISDOM. NO AFFLICTION IS NIRVANA. AND NO APPEARANCE OF THE MIND IS THE OTHER SHORE.\r\nIN THE LIGHT OF THE IMPARTIAL DHARMA, MORTALS LOOK NO DIFFERENT FROM SAGES. THE SUTRAS SAY THAT THE IMPARTIAL DHARMA IS SOMETHING THAT MORTALS CAN'T PENETRATE AND SAGES CAN'T PRACTICE. THE IMPARTIAL DHARMA IS ONLY PRACTICED BY GREAT BODHISATTVAS AND BUDDHAS. TO LOOK ON LIFE AS DIFFERENT FROM DEATH OR ON MOTION AS DIFFERENT FROM STILLNESS IS TO BE PARTIAL. TO BE IMPARTIAL MEANS TO LOOK ON SUFFERING AS NO DIFFERENT FROM NIRVANA BECAUSE THE NATURE OF BOTH IS EMPTINESS. BY IMAGINING THEY'RE PUTTING AN END TO SUFFERING AND ENTERING NIRVANA, ARHATAS END UP TRAPPED BY NIRVANA. BUT BODHISATTVAS KNOW THAT SUFFERING IS ESSENTIALLY EMPTY. AND BY REMAINING IN EMPTINESS, THEY REMAIN IN NIRVANA. NIRVANA MEANS NO BIRTH AND NO DEATH. IT'S BEYOND BIRTH AND DEATH AND BEYOND NIRVANA. WHEN THE MIND STOPS MOVING, IT ENTERS NIRVANA. NIRVANA IS AN EMPTY MIND.      ...AN UNINHABITED PLACE IS ONE WITHOUT GREED, ANGER OR DELUSION.      ...WHOEVER KNOWS THAT THE MIND IS A FICTION AND DEVOID OF ANYTHING REAL KNOWS THAT HIS OWN MIND NEITHER EXISTS NOR DOESN'T EXIST. MORTALS KEEP CREATING THE MIND, CLAIMING IT EXISTS. AND ARHATS KEEP NEGATING THE MIND, CLAIMING IT DOESN'T EXIST. BUT BODHISATTVAS AND BUDDHAS NEITHER CREATE NOR NEGATE THE MIND. THIS IS WHAT'S MEANT BY THE MIND THAT NEITHER EXISTS NOR DOESN'T EXIST. THE MIND THAT NEITHER EXISTS NOR DOESN'T EXIST IS CALLED THE MIDDLE WAY ....\r\nWHEN YOUR MIND DOESN'T STIR INSIDE, THE WORLD DOESN'T ARISE OUTSIDE. WHEN THE WORLD AND THE MIND ARE BOTH TRANSPARENT, THIS IS TRUE VISION. AND SUCH UNDERSTANDING IS TRUE UNDERSTANDING.\r\n\r\nThese sutras of Bodhidharma are pure gold except on one point: wherever he mentions the arhatas he suddenly becomes absolutely blind. His conception about the arhatas is the only flaw that he cannot drop. I will remind you whenever he falls below the ultimate wisdom and becomes attached to his opinion. It is extremely surprising that a man of the caliber of Bodhidharma can behave just like any ignorant person in certain situations. But this reminds us of the frailty of human beings and this can be helpful to you not to become too much attached to your opinions, because every opinion is going to make you blind, blind to the opposite opinion","torrent":{"xt":"urn:btih:6137156f14dc5a13359c2955fccc9a981028bd5b","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-10.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6137156f14dc5a13359c2955fccc9a981028bd5b","infoHashBuffer":{"type":"Buffer","data":[97,55,21,111,20,220,90,19,53,156,41,85,252,204,154,152,16,40,189,91]},"announce":[],"urlList":[]}}