{"title":"Cloudbuilt.Through.the.Fog-SKIDROW","uid":10517500,"size":1601913517,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6218806666cefb4e1ac999b9c2b61239c46cf68f&amp;dn=Cloudbuilt.Through.the.Fog-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Mr.Stifmeister","files":2,"time":1404926445,"description":"\n                           S  K  I  D  R  O  W\n                           .the leading force.\n\n                            proudly presents\n           Cloudbuilt: Through the Fog (c) Rising Star Games\t\n\n\n   09-07-2014......Release Date  Protection.................Steam\n   Action.............Game Type  Disk(s)....................1 DVD\n\n\n   RELEASE NOTES\n\n\nA young woman, a mysterious world and dark clouds on the horizon...\nwelcome to Cloudbuilt.\n\nCloudbuilt sees quick wits and even quicker reflexes become your\nclosest friends as you carve your own path through the mysterious\nfloating ruins high above the clouds. A game of speed, precision and\nfreedom, use your rocket-powered exoskeleton and manipulate the laws of\nphysics to avoid fatal hazards, dodge hostile robots and reach not\njust the finish line of each stage, but the top of the worldwide\nleaderboards too.\n\nPacked with progressively challenging levels, as well as all manner of\nshortcuts and secrets to discover, Cloudbuilt s fast-paced competitive\naction will push the limits of gamers seeking a challenge time and time\nagain.\n\nFeatures:\n\nJaw-dropping visuals   A unique and utterly gorgeous cel-shaded art\nstyle makes the world of Cloudbuilt come alive like nothing you ve\never seen.\n\nRun, jump, fight!   Cloudbuilt combines parkour-style platforming,\naction-packed gunplay and the fast-paced thrills of racing against\nthe clock to create a hugely addictive and competitive game.\n\nBlaze a trail   Open level design allows you to reach each goal in\nall kinds of different ways. Carve your own route through any stage\nyou like, then keep refining it to get the fastest time possible.\n\nGo your own way   Players can find their own route to the finish not\njust through each level, but also the game; a branching story across\n22 levels offer seven unique worlds and four different endings to\ndiscover.\n\nFight for supremacy   Finish stages quickly and make your mark on the\nglobal leaderboards. Find new shortcuts and use all your skill to climb\nas high as you can!\n\nA minute to learn, a lifetime to master   Rather than making players\nunlock abilities, Cloudbuilt gives you everything you need right from\nthe start. Pick up the basics immediately, then discover skills you\nnever knew you had and put them to good use!\n\nCloudbuilt: Through the Fog notes:\n\nThis first DLC pack for Cloudbuilt adds a new themed area to the world\n(Fog) and introduces five unique levels thatll really test your\nskills! These new stages arent just fun for experienced players, but\nalso provide new players with an opportunity to experience the\nplatforming aspect of the game on its own before taking on enemies.\nWith the fog closing in and your visibility clouded, have you got what\nit takes to make it to the exit?\n\nPlease note: in order for the Fog area to unlock, players must have\nfirst completed the Initial Entry tutorial stage.\n\nThis edition is STANDALONE!\n\n\n   INSTALL NOTES\n\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\n   install folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\n   secure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!\n\n\n   GREETINGS\n\n\nTo all friends of the family and honorable rival groups!\n\n\n                                ascii art by the\n                               godlike &amp; terrific duo\n                                   malodix + irokos\n                                    titan artdivision\n","torrent":{"xt":"urn:btih:6218806666cefb4e1ac999b9c2b61239c46cf68f","amp;dn":"Cloudbuilt.Through.the.Fog-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6218806666cefb4e1ac999b9c2b61239c46cf68f","infoHashBuffer":{"type":"Buffer","data":[98,24,128,102,102,206,251,78,26,201,153,185,194,182,18,57,196,108,246,143]},"announce":[],"urlList":[]}}