{"title":"The Jim Carroll Band - Catholic Boy - People Who Died","uid":12028419,"size":9714991,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:62a1f24ef5347dea0d6f291af4ca9a6b1e7d4809&amp;dn=The+Jim+Carroll+Band+-+Catholic+Boy+-+People+Who+Died&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big-Papi","files":3,"time":1434581779,"description":"[i]One of the best punk songs every written and an anthem for millions of teens who thought they would live forever while knowing their friends would die from the same lifestyle. It made no sense but it was an awesome time to be a kid and listen to punk even if you didn't spike your hair and wear a dog collar.\n\nThis song got in my head today for no reason. Well, not for no reason. I have a friend and whoever hangs out with her almost dies. She's a good friend but it's very dangerous to be around her and that damned curse.\n\nAnyway, this track id from a 5 album upload from a pirate named samuelbeckett22 so he gets the credit. It is a flawless MP3 V0 rip which is almost as good as FLAC at a fraction of the file size. Don't let the file size fool you this is an amazing song at great quality. With that said, please grab the 5 album torrent. That torrent file is inside this download and also at the following link:[/i]\n\n[torrent=3101211]\n[i]\nFinal note, this guy and his band started in the area where I now live, the San Francisco Bay Area.[/i]\n\n[i]- Big Papi[/i]\n[center]\n[img]https://yuq.me/users/15/891/E8PTZIM4yg.jpg[/img]\n\nTeddy sniffing glue he was 12 years old\nFell from the roof on East Two-nine\nCathy was 11 when she pulled the plug\nOn 26 reds and a bottle of wine\nBobby got leukemia, 14 years old\nHe looked like 65 when he died\nHe was a friend of mine\n\nRefrain:\nThose are people who died, died\nThose are people who died, died\nThose are people who died, died\nThose are people who died, died\nThey were all my friends, and they died\n\nG-berg and Georgie let their gimmicks go rotten\nSo they died of hepatitis in upper Manhattan\nSly in Vietnam took a bullet in the head\nBobby OD'd on Drano on the night that he was wed\nThey were two more friends of mine\nTwo more friends that died / I miss 'em--they died\n\nRepeat Refrain\n\nMary took a dry dive from a hotel room\nBobby hung himself from a cell in the tombs\nJudy jumped in front of a subway train\nEddie got slit in the jugular vein\nAnd Eddie, I miss you more than all the others,\nAnd I salute you brother/ This song is for you my brother\n\nRepeat Refrain\n\nHerbie pushed Tony from the Boys' Club roof\nTony thought that his rage was just some goof\nBut Herbie sure gave Tony some bitchen proof\n&quot;Hey,&quot; Herbie said, &quot;Tony, can you fly?&quot;\nBut Tony couldn't fly . . . Tony died\n\nRepeat Refrain:\n\nBrian got busted on a narco rap\nHe beat the rap by rattin' on some bikers\nHe said, hey, I know it's dangerous,\nbut it sure beats Riker's\nBut the next day he got offed\nby the very same bikers\n\nRepeat Refrain; repeat song to Eddie\n\n[/center]","torrent":{"xt":"urn:btih:62a1f24ef5347dea0d6f291af4ca9a6b1e7d4809","amp;dn":"The+Jim+Carroll+Band+-+Catholic+Boy+-+People+Who+Died","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a1f24ef5347dea0d6f291af4ca9a6b1e7d4809","infoHashBuffer":{"type":"Buffer","data":[98,161,242,78,245,52,125,234,13,111,41,26,244,202,154,107,30,125,72,9]},"announce":[],"urlList":[]}}