{"title":"Bottled and Sold:  Obsession with Bottled Water","uid":8321018,"size":1362372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6334e967ac30a551bfe66943af131afe2cfc9bb2&amp;dn=Bottled+and+Sold%3A++Obsession+with+Bottled+Water&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364672495,"description":"Bottled and Sold: The Story Behind Our Obsession with Bottled Water By Peter H. Gleick\n2010 | 232 Pages | ISBN: 1597265284 | EPUB | 1 MB\n\n\n\nPeter Gleick knows water. A world-renowned scientist and freshwater expert, Gleick is a MacArthur Foundation &quot;genius,&quot; and according to the BBC, an environmental visionary. And he drinks from the tap. Why don't the rest of us? Bottled and Sold shows how water went from being a free natural resource to one of the most successful commercial products of the last one hundred years-and why we are poorer for it. It's a big story and water is big business. Every second of every day in the United States, a thousand people buy a plastic bottle of water, and every second of every day a thousand more throw one of those bottles away. That adds up to more than thirty billion bottles a year and tens of billions of dollars of sales. Are there legitimate reasons to buy all those bottles? With a scientist's eye and a natural storyteller's wit, Gleick investigates whether industry claims about the relative safety, convenience, and taste of bottled versus tap hold water. And he exposes the true reasons we've turned to the bottle, from fearmongering by business interests and our own vanity to the breakdown of public systems and global inequities. &quot;Designer&quot; H2O may be laughable, but the debate over commodifying water is deadly serious. It comes down to society's choices about human rights, the role of government and free markets, the importance of being &quot;green,&quot; and fundamental values. Gleick gets to the heart of the bottled water craze, exploring what it means for us to bottle and sell our most basic necessity.\n","torrent":{"xt":"urn:btih:6334e967ac30a551bfe66943af131afe2cfc9bb2","amp;dn":"Bottled+and+Sold%3A++Obsession+with+Bottled+Water","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6334e967ac30a551bfe66943af131afe2cfc9bb2","infoHashBuffer":{"type":"Buffer","data":[99,52,233,103,172,48,165,81,191,230,105,67,175,19,26,254,44,252,155,178]},"announce":[],"urlList":[]}}