{"title":"BoundGods--BG-39629 Damien Michaels and Tommy Regan Hi HD","uid":14015489,"size":2468823605,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:635a5127e157bdadb27131b04229eb98eef843ac&amp;dn=BoundGods--BG-39629+Damien+Michaels+and+Tommy+Regan+Hi+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":2,"time":1458861711,"description":"\nEnhanced Interrogation: Detained Stud Faces a Horny, Sadistic Agent\r\n\r\nMar 24, 2016 - Performers: Damien Michaels  and  Tommy Regan \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nIt's dark, and Tommy Regan can't move. Heavy straps keep him bolted to a chair in some God-knows-where place. Occupational hazard for a spy. Suddenly, bright lights wash into his eyes as the hood over his head rips off. As he regains his bearings, he realizes that some intelligence officer, Damien Michaels, has him as prisoner. Damien spares no pleasantries and gets straight to the interrogation, punching Tommy's bulging pecs and twisting his nipples raw. The bad cop routine isn't getting Damien what he wants, so he flips the approach and edges Tommy's cock to get the intel. Now that Damien got what he wants, he keeps Tommy around for fun, suspending his arms above his head and flogging his hard body raw, only interrupting the torment to make Tommy gag on his dick. Damien takes Tommy deeper into the black site, chaining him from the ceiling in a sleep sack and fitting his dick with electrodes. Tommy reels under the pain from the electricity, submitting fully to his captor. Damien keeps Tommy slung from the ceiling as he fucks him relentlessly. Damien milks a load from his captive before covering his ass in cum. Tommy sways in the air, defeated and broken as the cum drips down from his body. \r\n\r\nVan's Note: I had an estim pad below each of Tommy's nipple under the sleepsack. That would complete the circuit for each estim nipple clamps. I couldn't get the damn thing to work so I didn't bother to open the sleepsack to reveal the pads and decided to leave everything on as decoration. I was going to discuss it in the post interview. It was such a long day and I simply forgot. Sincerely, Van\r\n\r\nScreens \nhttp://www.boundgods.com/site/shoot.jsp?shootId=39629\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:635a5127e157bdadb27131b04229eb98eef843ac","amp;dn":"BoundGods--BG-39629+Damien+Michaels+and+Tommy+Regan+Hi+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"635a5127e157bdadb27131b04229eb98eef843ac","infoHashBuffer":{"type":"Buffer","data":[99,90,81,39,225,87,189,173,178,113,49,176,66,41,235,152,238,248,67,172]},"announce":[],"urlList":[]}}