{"title":"Dreamscapes Magical Menagerie (gnv64)","uid":8643590,"size":15783127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63e50fcac2589438e34272acc523ae24a708ef36&amp;dn=Dreamscapes+Magical+Menagerie+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1372933707,"description":"Dreamscapes Magical Menagerie: Creating Fantasy Creatures and Animals with Watercolor \nby Stephanie Pui-Mun Law\nIMPACT | July 2012 | ISBN-10 1440310831 | ePUB | 129 pages | 15 mb &lt;a href=&quot;\nhttp://www.amazon.com/Dreamscapes-Magical-Menagerie-Creatures-Watercolor/dp/1440310831&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Dreamscapes-Magical-Menagerie-Creatures-Watercolor/dp/1440310831&lt;/a&gt;\n\nCreate Fantasy Creatures &amp; Animals with Watercolor!\nDreamscapes artist Stephanie Pui-Mun Law weaves her spell once again, this time with a focus on winged, underwater and four-legged creatures that captivate with their grace and impossible beauty. Step by step, you'll learn how to partner with watercolor to paint koi, the Phoenix, Pegasus and other fantastical creatures to inhabit your otherworlds.\n\n-    Bring life to beasts of water, sky and woods. Follow along, step by step, to create sea turtles, owls, earth dragons...more than 20 mythical and real-world creatures.\n -   Expand your watercolor techniques. This book covers everything from the basics of assembling your tools and selecting paper, to tips for making colors sing and techniques for evoking mysterious, underwater, woodland and celestial settings.\n-    Embrace the possibilities! Sparkling with a sense of whimsy and wonder, and peppered with bits of legend and lore to inform and inspire your art, Dreamscapes Magical Menagerie opens your eyes to the makings of fantasy all around you. If you can dream it, you can paint it!\n\nAbout the Author &lt;a href=&quot;\nhttp://www.crescentblues.com/6_11issue/otherpics/stephanie2a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.crescentblues.com/6_11issue/otherpics/stephanie2a.jpg&lt;/a&gt;\nStephanie Pui-Mun Law (born 1976) is an American painter and illustrator who works predominantly in watercolor and whose art is inspired by, and depicts scenes of fantasy, the Other World, and the surreal. She has also been influenced by the art of the Impressionists, Pre-Raphaelites, and Surrealists, as well as other contemporary popular fantasy artists.\nShe studied at University of California, Berkeley with a double BA degree in Fine Arts and Computer Science. She currently resides in Oakland, California.\nStephanie Pui-Mun Law is a freelance artist whose work consists of fantasy, the otherworld and the surreal. Her illustrations have been used for game and publishing clients, including Wizards of the Coast, HarperCollins, LUNA Books, Tachyon Books, White Wolf, Alderac Entertainment and Green Ronin. Stephanie?s first two books, Dreamscapes and Dreamscapes Myth &amp; Magic were published by IMPACT in 2008 and 2010. Visit her website at Shadowscapes.com.\n\nCONTENTS\nIntroduction\nMaterials &amp; Techniques\nSelecting Pencils, Choosing Brushes and Other Tools, Finding Paints, Gathering Extras, Selecting Paper, Stretching Watercolor Paper, Understanding Color, Suggesting Edges and Incorporating Spills, Laying a Flat Wash, Laying a Graded Wash, Glazing, Layering, Glazes, Blending, Using Salt\nMore Watercolor Techniques, Positive and Negative Space, Using Opaque Whites, Lifting Out, Using Ideas Around You\nWaters\nFish, Paint Koi, Paint an Eel, Sea Horses, Draw a Sea Horse, Paint a Sea Horse, Paint a Sea Turtle, Sea Dragons, Paint a Sea Dragon\nSkies\nBirds, Paint Bird Eyes, Wings and Feathers, Paint a Mourning Dove, Paint Ravens, Paint an Owl, Paint a Raptor, Paint a Peacock, Paint Distant Blackbirds, Paint the Phoenix, Butterflies, Paint a Butterfly Kaleidoscope\nWoods\nCats, Paint a Cat, Paint a Lion, Foxes, Paint a Fox, Horses, Paint a Wild Horse, Paint a Pegasus, Earth Dragons, Dragon Body Types, Paint an Earth Dragon, Ideas. Instruction. Inspiration","torrent":{"xt":"urn:btih:63e50fcac2589438e34272acc523ae24a708ef36","amp;dn":"Dreamscapes+Magical+Menagerie+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63e50fcac2589438e34272acc523ae24a708ef36","infoHashBuffer":{"type":"Buffer","data":[99,229,15,202,194,88,148,56,227,66,114,172,197,35,174,36,167,8,239,54]},"announce":[],"urlList":[]}}