{"title":"Michio Kaku - Visions of The Future","uid":4852731,"size":593378364,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:63f15af5abb43494dcac51f8453a5f287880630c&amp;dn=Michio+Kaku+-+Visions+of+The+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ludovic50","files":1,"time":1239933696,"description":"Visions of the Future is a 2007 documentary television series on the BBC Four television channel. The series stars theoretical physicist and futurist Dr Michio Kaku as he documents cutting edge science.\n\nThere are a total of 3 installments in the series.\n\nEpisodes\n\n* Episode 1 - The Intelligence Revolution - Dr Kaku explains how he believes artificial intelligence will revolutionize the world. Also, Kaku investigates virtual reality technology and its potential. Controversially, Kaku documents the work of scientists using a combination of artificial intelligence and neuroscience technology transform a person suffering from major depressive disorder in one who is happy and content by a push of a button.\n\n\n* Episode 2 - The Biotech Revolution - This episode focuses mainly on recent advances in genetics and biotechnology. Amongst other things Kaku documents advances in DNA screening, gene therapy and lab-grown organ transplants.\n\n\n* Episode 3 - The Quantum Revolution - Dr Kaku investigates the advances of quantum physics and the effects it could have on the average human life. Kaku looks at the work of science fiction writers and how many concepts conceived for entertainment could in fact become reality. Kaku also speculates about the effects that such technology may have on the future of the human race.\n\n\n\nFiles\n\nThe files are compressed in a rar-file. Windows-users can use Winrar to open it.\nThe videos are in mp4-format. Just add them all to a playlist.\nQuality isn't the best, but good enough.","torrent":{"xt":"urn:btih:63f15af5abb43494dcac51f8453a5f287880630c","amp;dn":"Michio+Kaku+-+Visions+of+The+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63f15af5abb43494dcac51f8453a5f287880630c","infoHashBuffer":{"type":"Buffer","data":[99,241,90,245,171,180,52,148,220,172,81,248,69,58,95,40,120,128,99,12]},"announce":[],"urlList":[]}}