{"title":"Samuel Shellabarger - Prince of Foxes (pdf)","uid":10153212,"size":6640016,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64771eef6e41a661afe23124461010a711844775&amp;dn=Samuel+Shellabarger+-+Prince+of+Foxes+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400123318,"description":"Samuel Shellabarger - Prince of Foxes (Little, Brown, 1947). 433 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. There was some slight warping to the pages, but the result is still pretty good. Sorry about the dreadful cover; I couldn't find a better one.\n\n\ndescription:\n\nSet in Renaissance Italy, this classic of American popular fiction is the story of Andrea Orsini, a peasant boy who rises to perform delicate political, military and romantic missions for Cesare Borgia. When first published in mid-20th century, Orson Welles was cast as Borgia in the film version. Tyrone Power as Orsini.\n\nA novel as colorful as the era itself. Fiction yes, but convincing fiction, based on sound scholarship and inspired research. (San Francisco Chronicle)\n\nA magnificent job from beginning to end -- a completely absorbing book. (Boston Herald)\n\nThere are many reasons for reading Prince of Foxes -- not least, as some reviewers like to say, that it's just about impossible to put it down once you start it -- but I would like to put it forward as a textbook example of what American were reading during the golden age of American popular fiction. This period lasted for about three decades, from the early 1930's to the late 1950's, during which much of the commercial fiction that millions of American read for pleasure -- fiction that made the best-seller lists -- was work of considerable literary skill and stylistic distinctiveness. That stands in sharp contrast to the popular fiction Americans now read...None wrote better than Shellabarger...Shellabarger was an educator by training and inclination, and he wanted readers to learn from his novels as well as be entertained by them. To say that you will learn a lot about Renaissance Italy from Prince of Foxes is an understatement. (Jonathan Yardley, Pulitzer Prize winning book critic and columnist for the Washington Post and author of six books)\n","torrent":{"xt":"urn:btih:64771eef6e41a661afe23124461010a711844775","amp;dn":"Samuel+Shellabarger+-+Prince+of+Foxes+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64771eef6e41a661afe23124461010a711844775","infoHashBuffer":{"type":"Buffer","data":[100,119,30,239,110,65,166,97,175,226,49,36,70,16,16,167,17,132,71,117]},"announce":[],"urlList":[]}}