{"title":"Total Marvel Week of 2/13/2013 (darkhomr) [TPB]","uid":8144896,"size":472773219,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6504c417fcacd0eeb7963c8a841ea8e63f02cea7&amp;dn=Total+Marvel+Week+of+2%2F13%2F2013+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":14,"time":1360890781,"description":"Each week I will be posting the current week's Marvel titles  These are the titles for February 13, 2013. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/aa12_zpsb500f1b7.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/fanf4_zpsee2ca2f7.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/aoa12_zps3dba0576.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/xm41_zps18773366.jpg[/IMG]\n\nAge Of Apocalypse #12 (CBR 2/13/2013)\n\nThe battle is over and the world has changed. But is anyone better off?  Those who are left of the Exterminated try to pick up the pieces. \n\nAvengers Arena #4 (CBR 2/13/2013)\n\nThe Runaways vs. Avengers Academy! \n\nAvengers Assemble #12 (CBR 2/13/2013)\n\nThe sins of Black Widow's past have resurfaced and threaten the safety of not only the Avengers, but also the entire world!!  Widow, Spider-Woman and Hawkeye must travel to Siberia to search for a missing girl with ties to an old Soviet assassination.  But the truth behind this girl's disappearance may be more than the Avengers are prepared to handle!Acclaimed writer Kelly Sue DeConnick teams with Pete Woods for an all new Avengers Assemble epic! \n\nCable And X-Force #4 (CBR 2/13/2013)\n\nWitness the massacre that makes Cable and X-Force criminals. They can't go back from here.\n\nFantastic Four #4 (CBR 2/13/2013)\n\nAn alien world, a thousand-year-old prophesy-is the Invisible Woman a long-awaited intergalactic messiah? \n\nFury Max #9 (CBR 2/13/2013)\n\nFury and Frank Castle, a.k.a. The Punisher, are captured in Vietnam in the heat of the war. Discover the real reason Nick Fury was sent into the most dangerous place on earth. \n\nPowers Bureau #1 (CBR 2/13/2013)\n\nA new chapter of the Eisner Award-winning POWERS that sends Deena Pilgrim into the big leagues!  Pilgrim is now a federal agent and dealing with the biggest powers cases in the entire country. But will this new life close the closet full of skeletons she carries with her? (Absolutely not!) And what does this mean for her old partner, Walker?  This is a bold game-changer for the iconic crime superhero comic that started it all and an amazing jumping-on point for new readers! \n\nScarlet Spider #14 (CBR 2/13/2013)\n\n'IN THE MIDST OF WOLVES' PART TWO OF THREE  The cast deals with the fallout from last issue's shocking fatality.  The Lobos are on the prowl as Aracely fights for her life. WHO IS THE OTHER? \n\nUltimate Comics X-Men #22 (CBR 2/13/2013)\n\nRESERVATION X CONTINUES!!!  Guest-starring the IRON PATRIOT!  The mutants hold the key to solving world hunger, but what is the deadly cost? A fatal showdown between Kitty and Mach Two! \n\nUncanny X-Men #1 (CBR 2/13/2013)\n\nThe true flagship book of the X-Men returns. In the wake of the Phoenix, the world has changed and is torn on exactly what Cyclops and his team of X-Men are--visionary revolutionaries or dangerous terrorists?  Whatever the truth, Cyclops, Emma Frost, Magneto, and Magik are out in the world gathering up new mutants and redefining the name UNCANNY X-MEN.\n\nWolverine and the X-Men #25 (CBR 2/13/2013)\n\nThe hottest new X-Book turns 25!  Jason Aaron (THOR:GOD OF THUNDER) and Eisner-Award winner Ramon Perez (Tale of Sand, JOHN CARTER) kick off the mega story that will define WXM in 2013!  Wolverine and the students go to the Savage Land!  Plus, Wolverine's brother Dog, from the super hit ORIGIN, returns and becomes the biggest new X-Villain in years. \n\nX-Men #41 (CBR 2/13/2013)\n\nFINAL ISSUE!  At the end of an era, Storm puts a team together to search for the start of the next.  In the field, will Angel challenge her for leadership? \n\nX-treme X-Men #10 (CBR 2/13/2013)\n\nAfter the events of their last mission, something is off about Xavier.  Will the team be able to close the tears between dimensions without him?  PLUS! Romance is in the air-or it could be, if Dazzler and Cyclops don't kill each other first! \n\n\n\n\n\n","torrent":{"xt":"urn:btih:6504c417fcacd0eeb7963c8a841ea8e63f02cea7","amp;dn":"Total+Marvel+Week+of+2%2F13%2F2013+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6504c417fcacd0eeb7963c8a841ea8e63f02cea7","infoHashBuffer":{"type":"Buffer","data":[101,4,196,23,252,172,208,238,183,150,60,138,132,30,168,230,63,2,206,167]},"announce":[],"urlList":[]}}