{"title":"Atlanta Blues-Big City Blues From The Heartland (4CD-JSP-192k)","uid":7382536,"size":454409367,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6526fe952893164956ff105a8ecc0beaa7f21352&amp;dn=Atlanta+Blues-Big+City+Blues+From+The+Heartland+%284CD-JSP-192k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mudmashers","files":109,"time":1340548032,"description":"Atlanta Blues - Big City Blues From The Heartland [JSP] (4CD192kb)\n\n~JSP's Atlanta Blues compiles four CDs of performances by Julius Daniels, Curley Weaver, Georgia Browns, Peg Leg Howell, Henry Williams &amp; Eddie Anthony, Macon Ed &amp; Tampa Joe, Lil McClintock, and Lillie Mae. It's hard to go wrong with these 101 recordings cut between 1926 and 1949. The tracks have been remastered, making the majority of this material sound great. Highly recommended, especially for the blues novice. (Al Campbell)\n\n~JSP records in london is to be commended for all their great budget price box sets of old-time music. This 4 disc set of atlanta blues is especially notable for all the Peg Leg Howell sides. I have read much about peg leg howell over the years, yet, for some reason, his music was near impossible to find on compilations. Mr Howell was a very pleasing blues singer with a relaxed vocal delivery and an easy fluid guitar style. He is even accompanied on a few tracks by violin and mandolin, which you don't hear too often on these old blues tunes. \n\nAnother artist featured on this set is Curley Weaver, who is by far the most accomplished guitarist on this set. He plays slide guitar with such facile grace and adventuresome rythmn that all slide guitar enthusiasts and blues fans should thrill to his sound.\n\nThe highlight of this is Julius Daniels. Mr Daniels, while not the guitar stylist of the aforementioned artists, is an outstanding blues singer, with a deep confident voice that is amongst the best i have heard in blues from the 20's. There are eleven sides from mr daniels included (4 of them alternate takes), and i would say they are must haves for blues fanatics. There are six other artists/bands included on this set, and they are good in their own right, but it is Peg Leg Howell, Curly Weaver, and Julius Daniels that really standout on this package. (Amazon)","torrent":{"xt":"urn:btih:6526fe952893164956ff105a8ecc0beaa7f21352","amp;dn":"Atlanta+Blues-Big+City+Blues+From+The+Heartland+%284CD-JSP-192k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6526fe952893164956ff105a8ecc0beaa7f21352","infoHashBuffer":{"type":"Buffer","data":[101,38,254,149,40,147,22,73,86,255,16,90,142,204,11,234,167,242,19,82]},"announce":[],"urlList":[]}}