{"title":"The Mongol Invasions of Japan 1274 and 1281 {BBS}","uid":6795263,"size":11646338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65fa744fb0ae9d513af2e5aaa5bf6d5efd198de9&amp;dn=The+Mongol+Invasions+of+Japan+1274+and+1281+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320424798,"description":"The two attempts by Khubilai Khan, the Mongol Emperor of China, to invade Japan in 1274 and 1281 represent unique events in the history of both countries. It pitted the samurai of Japan against the fierce warriors of the steppes who had conquered half the known world.\n\nThe Mongol conquest of Korea left them with a considerable quantity of maritime resources, which enabled them to thin seriously for the first time about crossing the Tsushima strait between Korea and Japan with an army of invasion. The first invasion, which began with savage raiding on the islands of Tsushima and Iki, made a landfall at Hakata Bay and forced the samurai defenders back inland. Luckily for the Japanese defenders, a storm scattered the Mongol invasion fleet, leading them to abandon this attempt.\n\nIn the intervening years the Japanese made defensive preparation, and the Mongol increased their fleet and army, so that the second invasion involved one of the largest seaborne expeditions in world history up to that time. This attempt was aimed at the same landing site, Hakata Bay, and met stiffer opposition form the new defences and the aggressive Japanese defenders. Forced buy a series of major Japanese raids to stay in their ships at anchor, the Mongol fleet was obliterated by a typhoon - the kami kaze (divine wind) - for the loss of as many as 90 per cent of the invaders. Although further preparations were made for an assault by the Mongols at the end of the 13ht and beginning of the 14th centuries, this proved to be the last realistic threat of an invasion of the home islands till 1945. \n\n\n\n# Paperback: 96 pages\n# Publisher: Osprey Publishing (Jan 26 2010)\n# Language: English\n# ISBN-10: 1846034566\n# ISBN-13: 978-1846034565","torrent":{"xt":"urn:btih:65fa744fb0ae9d513af2e5aaa5bf6d5efd198de9","amp;dn":"The+Mongol+Invasions+of+Japan+1274+and+1281+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65fa744fb0ae9d513af2e5aaa5bf6d5efd198de9","infoHashBuffer":{"type":"Buffer","data":[101,250,116,79,176,174,157,81,58,242,229,170,165,191,109,94,253,25,141,233]},"announce":[],"urlList":[]}}