{"title":"Smuggler Nation: How Illicit Trade Made America","uid":8550139,"size":3569394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:661b6425ad301d4a4ceddb305dd418ad0ae2098f&amp;dn=Smuggler+Nation%3A+How+Illicit+Trade+Made+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370625938,"description":"Peter Andreas, &quot;Smuggler Nation: How Illicit Trade Made America&quot;\nISBN: 0199746885 | 2013 | EPUB\n\nAmerica is a smuggler nation. Our long history of illicit imports has ranged from West Indies molasses and Dutch gunpowder in the 18th century, to British industrial technologies and African slaves in the 19th century, to French condoms and Canadian booze in the early 20th century, to Mexican workers and Colombian cocaine in the modern era. Contraband capitalism, it turns out, has been an integral part of American capitalism.\n\nProviding a sweeping narrative history from colonial times to the present, Smuggler Nation is the first book to retell the story of America--and of its engagement with its neighbors and the rest of the world--as a series of highly contentious battles over clandestine commerce. As Peter Andreas demonstrates in this provocative and fascinating account, smuggling has played a pivotal and too often overlooked role in America's birth, westward expansion, and economic development, while anti-smuggling campaigns have dramatically enhanced the federal government's policing powers. The great irony, Andreas tells us, is that a country that was born and grew up through smuggling is today the world's leading anti-smuggling crusader.","torrent":{"xt":"urn:btih:661b6425ad301d4a4ceddb305dd418ad0ae2098f","amp;dn":"Smuggler+Nation%3A+How+Illicit+Trade+Made+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661b6425ad301d4a4ceddb305dd418ad0ae2098f","infoHashBuffer":{"type":"Buffer","data":[102,27,100,37,173,48,29,74,76,237,219,48,93,212,24,173,10,226,9,143]},"announce":[],"urlList":[]}}