{"title":"Quickoffice Pro Full v5.0.164","uid":6993917,"size":9502766,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:66dce81e03e830ed2ec0e00b55248263cc48fcfd&amp;dn=Quickoffice+Pro+Full+v5.0.164&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"StoneBoyTony","files":-1,"time":1327798707,"description":"Quickoffice Pro Full v5.0.164\n\n\nRequires Android: 2.0+\n\nRelease Date: 20 December 2011\n\n\nAre you looking for a way to make your phone a powerful productivity tool? Quickoffice Pro takes mobile productivity to the next level with one of the most comprehensive suites you can find on Android. Create, access, edit, and share all of your Microsoft Word documents, Excel spreadsheets, and PowerPoint presentations with QuickofficePro on your Android smartphone.\n\nAnytime Office Editing\n\nQuickoffice Pro lets you get work done on the road by allowing easy access to Microsoft Word, Excel, and PowerPoint wherever you take your mobile. This app also provides you with a convenient PDF viewer so you can keep your important documents with you at all times. View document footnotes and endnotes in Word. Use the text-to-speech voice input and text recital option for an alternative way to word-process your documents. Get the most out of your Android device with this award-winning productivity suite.\n\nCloud Compatibility\n\nConveniently access, share, and manage files remotely from your Google Docs, Dropbox, Box, Huddle, SugarSync, and MobileMe accounts. You'll get the same access and permissions to your files from your SD card with the enhanced Connected File Manager. You can even save space on your device by installing this app to your SD card.\n\nComplete File Management\n\nClean up your files and sort folders by name, type, size, and date. You can easily rename, copy, or delete files as well. Quickoffice Pro lets you create, open, and edit your PowerPoint files (.ppt and .pptx). Insert shapes and render vertical text in your presentations. Gain clipboard access so you can cut, copy, and paste between apps. Looking for a bit of photo editing within this app? Insert and resize text boxes, shapes, and images from your gallery or camera.\n\nExcel Support\n\nAre you an Excel expert? Don't limit yourself to just basic input options. Quickoffice Pro supports advanced formulas and charts so you can get creative with your spreadsheets. Apply formulas to multiple cells by tapping and dragging. Add, delete, and rename worksheets in Excel files.\n\nA Productive Point of View\n\nThe thumbnail preview lets you scroll easily so you can skim documents with multiple pages and get to the content you're looking for. Edit documents in Page Layout mode.\n\nAccess all of your Word documents, Excel spreadsheets, PowerPoint presentations, and PDF files\n\nCreate your PowerPoint presentation on the go\n\nManage your Excel sheets complete with complex formulas\nYour Mobile Productivity Solution\nTop 10 Must-Have Android Apps--NY Times\n\nTop 10 Finalist--Mobile Apps Showdown--CES 2011\n\n&quot;If you are a person who gets sent documents on the go and has a need to edit them on the go then you should look at Quickoffice.&quot;--ZDNet\n\n&quot;If you're hoping to do some hardcore word processing on your Android phone, Quickoffice has your back.&quot;--IntoMobile.com\n\n&quot;Convenience at its finest.&quot;--Phandroid.com\n\nKey Microsoft Office Features\n\nCreate, view, and edit Microsoft Word documents (.doc and .docx)\nCreate, view, and edit Excel spreadsheets (.xls and .xlsx)\nCreate, view, and edit PowerPoint presentations (.ppt and .pptx)\n\nKey Connected File Manager Features\n\nSeamlessly access Google Docs, Dropbox, Box, Huddle, SugarSync, and MobileMe\nBrowse zip files and copy files from zip folders to other directories\nView Office and non-Office files within the file manager\nCreate, copy, move, delete and rename files and folders\nShare files via e-mail, SMS, Bluetooth, and cloud services\nAccess and manage files on your SD Card\n\nProduct Features\n\nTake your work with you with this mobile Microsoft Office application\nCreate, view, and edit Word, Excel, and PowerPoint files on the go\nSeamlessly access Google Docs, Dropbox, Box, Huddle, SugarSync, and MobileMe\nOpen and view PDF documents, including password protected and encrypted files\nTake pictures with your Android's camera and paste them neatly into documents\n\nWhat's new in version 5.0.164:\n\n- Support for Microsoft Office 2010 files\n- Access and save to Evernote, Catch, and Egnyte\n- Share files using Facebook, Twitter, LinkedIn, SlideShare, Docstoc, Scribd, and Yammer\n- Updated user interface for easier navigation and control\n- Freeze panes, split/merge cells, and wrap cell text in spreadsheets\n- Create and indent numbered lists, bulleted lists in documents\n- More fonts in documents and presentations\n- Improved slide rendering and layout in PowerPoint files\n- many more great new enhancements!\n\n\nWant to visit my other uploads?\n &lt;a href=&quot;\nhttp://www.kat.ph/user/StoneBoyTony/uploads/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kat.ph/user/StoneBoyTony/uploads/&lt;/a&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/user/StoneBoyTony/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/StoneBoyTony/&lt;/a&gt;\n\nEnjoy and Please SeeD :)\n\n","torrent":{"xt":"urn:btih:66dce81e03e830ed2ec0e00b55248263cc48fcfd","amp;dn":"Quickoffice+Pro+Full+v5.0.164","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66dce81e03e830ed2ec0e00b55248263cc48fcfd","infoHashBuffer":{"type":"Buffer","data":[102,220,232,30,3,232,48,237,46,192,224,11,85,36,130,99,204,72,252,253]},"announce":[],"urlList":[]}}