{"title":"Carbon Nanomaterials - Yury Gogotsi","uid":15331580,"size":36501995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6784919646adf8056a8be6ea1f635e6daa466311&amp;dn=Carbon+Nanomaterials+-+Yury+Gogotsi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468735296,"description":"Carbon Nanomaterials - Yury Gogotsi (CRC, 2006).pdf\r\n\r\nISBN 9780849393860\r\n\r\nFirst Self-Contained Source Entirely Dedicated to Nanocarbons\r\n\r\nCarbon nanotubes (CNTs) attract a good deal of attention for their electronic, mechanical, optical, and chemical characteristics. But nanostructured carbons are not limited to nanotubes and fullerenes—they also exist as nano-diamonds, fibers, cones, scrolls, whiskers, and graphite polyhedral crystals. While excellent papers and articles exist scattered across several journals, a comprehensive, single volume focused simply on carbon-based nanostructures was unavailable, until now.\r\n\r\nFeaturing the contributions of exceptional leaders in the field, Carbon Nanomaterials brings together the most up-to-date research findings on the special properties, practical synthesis, and real applications for all types of carbon-related nanomaterials. The authors emphasize the importance of nanotexture and surface chemistry in various modification methods used to customize properties for a wide range of applications. They also draw attention to challenges that must be addressed before they are fully integrated into the next generation of science and engineering applications. The final chapter is dedicated to examining the timely application of carbon nanotubes as a composite material for solar cells and electrical hydrogen storage.\r\n\r\nCarbon Nanomaterials provides a broad survey of numerous carbon-based nanomaterials in the context of commercially available nanomaterials as well as emerging technologies and future applications in the fields of molecular electronics, sensoring, nano- and micro electromechanic devices, field-emission displays, energy storage, and composite materials","torrent":{"xt":"urn:btih:6784919646adf8056a8be6ea1f635e6daa466311","amp;dn":"Carbon+Nanomaterials+-+Yury+Gogotsi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6784919646adf8056a8be6ea1f635e6daa466311","infoHashBuffer":{"type":"Buffer","data":[103,132,145,150,70,173,248,5,106,139,230,234,31,99,94,109,170,70,99,17]},"announce":[],"urlList":[]}}