{"title":"Holy Hatred by James Haught","uid":7167235,"size":4412406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67a571cf18a15816f61355600b092f543ce85e2a&amp;dn=Holy+Hatred+by+James+Haught&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1333820010,"description":"It is a bitter irony that today millions who claim to be religious --\nthose who counsel peace, advocate the community of humankind, and voice\nconcern for the welfare of others -- often perpetrate madness, mayhem,\nand murder on a grand scale, and all in the name of some &quot;rightous&quot; cause.\nIt would seem that the Crusades, Inquisitions, and Witch hunts of our dark\nand blood-drenched past have taught us nothing.  In just the first few\nyears of the 1990s the world has witnessed Sikh violence against Muslims\nin India; Serbian Orthodox Christians against Croatian Catholics and\nBosnian Muslims in the shattered Yugoslavia; the extremism of Muslim\nholy laws throughout Africa and the Middle East; Catholics against\nProtestants in Northern Ireland; the Branc Davidian inferno in Waco,\nTexas; Hindues and Buddhists engageing in violent clashes in Sri Lanka;\nand the United States' first real experience of international religious\nterrorism on its own shores -- namely, the bombing of the World Trade\nCenter in New York City.\n\nThese are but a few of the horrific episodes that make so many people\nquestion the benign message of modern religion.\n\nIn Holy Hatred: Religious Conflicts of the 1990s, renowned journalist\nJames A. Haught, author of the widely acclaimed Holy Horrors: An\nIllustrated History of Religious Murder and Madness, demonstrates\nin gruesome detail that humanity in general and the world's religions\nin particular have learned little from the brutal mistakes of their\npredecessors.  Whether it be masses of Hindues storming the gates of\na Muslim mosque in India; a car bombing in Belfast; the shotgun\nmurder of an abortion-clinic physician in Florida; &quot;ethnic clensing&quot;\nat the hands of Orthodox Serbs in Bosnia-Herzegovina; or the bounties\nplaced on the heads of those who dare question the iron law of Islam;\nthe frightening effects of &quot;fractious faith&quot; can be seen in virtually\nevery part of the globe.  But before ational people can join together\nto develope constructive answers to the conflicts of religious\ntribalism, which divide nations, communities, and families, the\ngripping realities of recent years must be acknowledged.\n\nVividly illustrated with compelling photographs and valuable maps,\nHoly Hatred offers a sobering chronicle of the many acts of cruelty,\nmolestation, and slaughter of innocents that humanity has permitted\nto take place in the name of one religion or another.  Included are\nreports on incidents in twenty five nations: Afghanistan, Bangladesh,\nCypres, Egypt, India, Indonesia, Iran, Iraq, Israel, Jordan, Lebanon,\nLibya, Kuwait, Nigeria, Northern Ireland, Pakistan, the Philippines,\nSaudi Arabia, Somalia, the former Soviet Union, Sri Lanka, Sudan,\nTrinidad, Turkey, and the United States.\n\nWhether as willing participants or as casual observers, we have\npermitted the bloodshed to continue; it is up to each of us to stop\nit.\n","torrent":{"xt":"urn:btih:67a571cf18a15816f61355600b092f543ce85e2a","amp;dn":"Holy+Hatred+by+James+Haught","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a571cf18a15816f61355600b092f543ce85e2a","infoHashBuffer":{"type":"Buffer","data":[103,165,113,207,24,161,88,22,246,19,85,96,11,9,47,84,60,232,94,42]},"announce":[],"urlList":[]}}