{"title":"Classic.eBooks.of.the.Day.September.17.07-LegalTorrents","uid":3808776,"size":8902896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68b117c268b2730cd2fc66f4ff6258dd1d9fbde7&amp;dn=Classic.eBooks.of.the.Day.September.17.07-LegalTorrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"LegalTorrents","files":13,"time":1189956292,"description":"10 Classic Books Included in Pack:\n\n20,000 Leagues Under The Sea:\n\n\nOriginally published in 1870, Verne?s amazing undersea adventure is one of the earliest science fiction novels ever written. Since that time, generations of readers have plunged below the ocean?s waves with Captain Nemo and his first-ever submarine, The Nautilus. It?s a voyage of exploration and the imagination.\n\n\n\n\n\n\n\nHow To Use Your Mind\n\nEducational leaders are seeing with increasing clearness the necessity of teaching students not only the subject-matter of study but also methods of study. The recognition of this condition is taking the form of the movement toward &amp;#039;&amp;#039;supervised study,&amp;#039;&amp;#039; which attempts to acquaint the student with principles of economy and directness in using his mind. It is generally agreed that there are certain &amp;#039;&amp;#039;tricks&amp;#039;&amp;#039; which make for mental efficiency, consisting of methods of apperceiving facts, methods of review, devices for arranging work. Some are the fruits of psychological experimentation; others are derived from experience. Many of them can be imparted by instruction, and it is for the purpose of systematizing these and making them available for students that this book is prepared.\n\n\n\n\nJapanese Fairy Tales\n\n\n\n\n\n\nMademoiselle of Monte Carlo\n\nThe Master of Mystery waves his magic wand again. In this book the strange inter-relationships between the &quot;upper crust&quot; and the underworld are revelaed with convincing realism. Besides the elusive &quot;Mademoiselle,&quot; we come in tantalizing conact with the &quot;Sparrow,&quot; the incredible super criminal whose emissaries and operatives baffle the greatest detectives of Europe.\n\n\n\n\n\n\nPlanet of the Damned\n\nHugo nominated in 1962, originally published in Analog Science Fact-Science Fiction as &quot;Sense of Obligation.&quot; Brion has just won the Twenties, a global competition to test achievements in 20 categories of human activities -- but before he can enjoy his victory he&amp;#039;s forced to leave his homeworld to help salvage Dis, the most hellish planet in the galaxy.\n\n\n\n\n\n\n\nPride and Prejudice\n\nAusten&amp;#039;s finest comedy of manners portrays life in the genteel rural society of the early 1800s, and tells of the initial misunderstandings (and mutual enlightenment) between lively and quick witted Elizabeth Bennet and the haughty Mr. Darcy.\n\n\n\n\n\n\nThe Adventures of Sherlock Holmes\n\nI. A Scandal in Bohemia\nII. The Red-headed League\nIII. A Case of Identity\nIV. The Boscombe Valley Mystery\nV. The Five Orange Pips\nVI. The Man with the Twisted Lip\nVII. The Adventure of the Blue Carbuncle\nVIII. The Adventure of the Speckled Band\nIX. The Adventure of the Engineer&amp;#039;s Thumb\nX. The Adventure of the Noble Bachelor\nXI. The Adventure of the Beryl Coronet\nXII. The Adventure of the Copper Beeches\n\n\n\n\n\n\nThe Art of Public Speaking\n\n\n\n\n\n\nThe Hacker&amp;#039;s Dictionary\n\n\n\n\n\n\n\nWar &amp; Peace\n\nThe novel tells the story of a number of aristocratic families and the entanglements of their personal lives with Napoleon&amp;#039;s invasion of Russia. As events proceed, Tolstoy systematically denies his subjects any significant free choice: the onward roll of history determines happiness and tragedy alike.","torrent":{"xt":"urn:btih:68b117c268b2730cd2fc66f4ff6258dd1d9fbde7","amp;dn":"Classic.eBooks.of.the.Day.September.17.07-LegalTorrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68b117c268b2730cd2fc66f4ff6258dd1d9fbde7","infoHashBuffer":{"type":"Buffer","data":[104,177,23,194,104,178,115,12,210,252,102,244,255,98,88,221,29,159,189,231]},"announce":[],"urlList":[]}}