{"title":"Making the Modern World - Vaclav Smil","uid":9342470,"size":3541023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68b8f788d661d001da27d6bc1ab25b80570a8b03&amp;dn=Making+the+Modern+World+-+Vaclav+Smil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1386961749,"description":"How much further should the affluent world push its material consumption? Does relative dematerialization lead to absolute decline in demand for materials? These and many other questions are discussed and answered in Making the Modern World: Materials and Dematerialization. \nOver the course of time, the modern world has become dependent on unprecedented flows of materials. Now even the most efficient production processes and the highest practical rates of recycling may not be enough to result in dematerialization rates that would be high enough to negate the rising demand for materials generated by continuing population growth and rising standards of living. This book explores the costs of this dependence and the potential for substantial dematerialization of modern economies. \nMaking the Modern World: Materials and Dematerialization considers the principal materials used throughout history, from wood and stone, through to metals, alloys, plastics and silicon, describing their extraction and production as well as their dominant applications. The evolving productivities of material extraction, processing, synthesis, finishing and distribution, and the energy costs and environmental impact of rising material consumption are examined in detail. The book concludes with an outlook for the future, discussing the prospects for dematerialization and potential constrains on materials. \nThis interdisciplinary text provides useful perspectives for readers with backgrounds including resource economics, environmental studies, energy analysis, mineral geology, industrial organization, manufacturing and material science. ","torrent":{"xt":"urn:btih:68b8f788d661d001da27d6bc1ab25b80570a8b03","amp;dn":"Making+the+Modern+World+-+Vaclav+Smil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68b8f788d661d001da27d6bc1ab25b80570a8b03","infoHashBuffer":{"type":"Buffer","data":[104,184,247,136,214,97,208,1,218,39,214,188,26,178,91,128,87,10,139,3]},"announce":[],"urlList":[]}}