{"title":"Exit Wounds (Graphic Novel) (2007)","uid":9442300,"size":111681357,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6a997a71468973e50e91067e33f7f993da6123fc&amp;dn=Exit+Wounds+%28Graphic+Novel%29+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"desertlightning","files":-1,"time":1389032712,"description":"\n\nSet in modern-day Tel Aviv, A young man, Koby Franco, receives an urgent phone call from a female soldier. Learning that his estranged father may have been a victim of a suicide bombing in Hadera, Koby reluctantly joins the soldier in searching for clues. His death would certainly explain his empty apartment and disconnected phone line. As Koby tries to unravel the mystery of his father's death, he finds himself not only piecing together the last few months of his father's life, but his entire identity. With thin, precise lines and luscious watercolors, Modan creates a portrait of modern Israel, a place where sudden death mingles with the slow dissolution of family ties.\n\nExit Wounds is the North American graphic novel debut from one of Israeli's best-known cartoonists, Rutu Modan.\n\nShe has received several awards in Israel and abroad, including the Best Illustrated Children's Book Award from the Israel Museum in Jerusalem four times, Young Artist of the Year by the Israel Ministry of Culture and is a chosen artist of the Israel Cultural Excellence Foundation.\n\nExit Wounds was the winner of the 2008 Eisner award for Best Graphic Album -New and was nominated for the televised 2007 Quill Awards in the graphic novel category.\n\n\nSeed and enjoy!!","torrent":{"xt":"urn:btih:6a997a71468973e50e91067e33f7f993da6123fc","amp;dn":"Exit+Wounds+%28Graphic+Novel%29+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a997a71468973e50e91067e33f7f993da6123fc","infoHashBuffer":{"type":"Buffer","data":[106,153,122,113,70,137,115,229,14,145,6,126,51,247,249,147,218,97,35,252]},"announce":[],"urlList":[]}}