{"title":"Carly Simon - You're So Vain","uid":4754942,"size":165781508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6a9cd1dcc683d38806b59fe1d45d4db14ddb04d1&amp;dn=Carly+Simon+-+You%5C%27re+So+Vain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1236402236,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;You're So Vain&quot; is a song written and performed by Carly Simon released in December 1972.\n\nThe song is a critical profile of a self-absorbed lover. The song was a number-one hit (it topped the Billboard Hot 100 for three weeks in early 1973, and also spent two weeks at the top of the Adult Contemporary chart, her first #1 song on either chart), and spawned what many fans consider to be the biggest musical mystery of the era. There has been much debate over whom exactly the song is about. Popular guesses on the subject include Mick Jagger (who sang uncredited backing vocals on the song), Cat Stevens, Warren Beatty, Kris Kristofferson (with whom she had had brief relationships), the unfaithful fiancÃƒÂ© William Donaldson and Simon's ex-husband, James Taylor. Stevens has never acknowledged this possibility.\n\nThe song listed at #72 on Billboard's Greatest Songs of All-Time. &quot;You're So Vain&quot; was voted #216 in RIAA's Songs of the Century.\n\n    * Two solar eclipses (&quot;Then you flew your Learjet up to Nova Scotia to see the total eclipse of the sun&quot;) were visible from Nova Scotia in the early 1970s. The first eclipse, on March 7, 1970, was visible in the USA, but the second one, on July 10, 1972, was not. Warren Beatty's mother was born and raised in Nova Scotia.\n    * The line &quot;I hear you went up to Saratoga and your horse naturally won,&quot; refers to the Saratoga Race Course meeting held in late July, August and early September in Saratoga Springs, New York. The meeting is known to be frequented by the rich and famous of New York and other cities on the East Coast.\n\nMany people mistakenly think that the phrase &quot;your horse naturally won&quot; refers to a bet wagered on the race. In fact, Warren Beatty owned a horse named &quot;Naturally&quot; that was entered in the race.\n\nRecently, Beatty admitted that he in fact believes he is the subject of the song, saying: &quot;Let's be honest. That song was about me.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6a9cd1dcc683d38806b59fe1d45d4db14ddb04d1","amp;dn":"Carly+Simon+-+You%5C%27re+So+Vain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a9cd1dcc683d38806b59fe1d45d4db14ddb04d1","infoHashBuffer":{"type":"Buffer","data":[106,156,209,220,198,131,211,136,6,181,159,225,212,93,77,177,77,219,4,209]},"announce":[],"urlList":[]}}