{"title":"Mobile DeathCamp - Black Swamp Rising (Murlok)","uid":7158531,"size":30646518,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ac94711404c8a4172e2650f6cb58cb68d228dc5&amp;dn=Mobile+DeathCamp+-+Black+Swamp+Rising+%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Murlok","files":-1,"time":1333530746,"description":"Ohio three-piece MOBILE DEATHCAMP can play some pummeling no holds barred speed metal.\n\nThe quality of the songs on their full-length debut, Black Swamp Rising, are straight ahead old school\nmetal assaults with cross over appeal. What they do is nothing new or even technically difficult, but the\nsheer force of their songs is commendable. Originally released in 2008, only a 1,000 copies of Black\nSwamp Rising were released through the band, but now that Sacrifice Records took over their distribution,\nthe band is hoping they will be able to ship some more units. Guitarist/vocalist Todd Evans was GWAR s bassist\nBeefcake the Mighty, (the third one). He proudly served five years in the GWAR monster army, but he quit the\nband because of his desire to play guitar again with his own band.One Brainis an instrumental that starts off\nthe CD. It s a mid-paced pounding with some driving riffs and frantic lead work by Evans.Feed The Machineis\na quick punk-tinged blaster with a crushing chorus.Offensive Releaseis another instrumental with guests Devin\nTownsend, Shane Clark of 3 INCHES OF BLOOD and Evans trading guitar solos.The Buffalo Songis an authentic\npiece of music based on a real pow wow which pays homage to the Native American Indian. It s a welcomed\nendeavor for a metal band s diversity to include a song of this nature to its repertoire. This is a pretty decent\nrelease with good production. As one of the opening slots on GWAR s current Bloody Tour of Horror, they have\na great chance to influence the fans to get on board with their brand of straight ahead speed metal.\n\nSave Our Children\n\n\nEnjoy","torrent":{"xt":"urn:btih:6ac94711404c8a4172e2650f6cb58cb68d228dc5","amp;dn":"Mobile+DeathCamp+-+Black+Swamp+Rising+%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ac94711404c8a4172e2650f6cb58cb68d228dc5","infoHashBuffer":{"type":"Buffer","data":[106,201,71,17,64,76,138,65,114,226,101,15,108,181,140,182,141,34,141,197]},"announce":[],"urlList":[]}}