{"title":"Our.Idiot.Brother.hardcore74.mp4.mp4","uid":8965890,"size":630768640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b09c6fca9dba5ad617a532ccc74eb7f47045e16&amp;dn=Our.Idiot.Brother.hardcore74.mp4.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hardcore74","files":1,"time":1380220376,"description":"Ned Rochlin (Paul Rudd) is a biodynamic farmer living with his girlfriend, Janet (Kathryn Hahn). While Ned is selling at a local market, a police officer asks where he can buy cannabis. Ned, skeptical at first, is moved by the officer's professed desperation due to having a stressful week. Feeling sympathetic, Ned gives him a rhubarb and a bag of marijuana for free. Insisting on paying, the officer coaxes Ned into charging him twenty dollars. Ned is then arrested on a charge of selling drugs.\nNed has three sisters: Miranda (Elizabeth Banks) is a journalist for Vanity Fair trying to get her first major article published. Though she has trouble finding a man to keep her interest, she and a neighbor, Jeremy (Adam Scott) have hidden feelings for each other. Natalie (Zooey Deschanel), is an independent, bisexual hipster living with her girlfriend, Cindy (Rashida Jones), and five other roommates. Her love for Cindy conflicts with her fear of commitment. Liz (Emily Mortimer), the oldest, is married to Dylan (Steve Coogan), a documentary filmmaker. Their marriage is failing as Dylan shows no sexual or emotional interest in Liz. They also have strict control over their son River (Matthew Mindler), which leaves him unhappy and unable to express himself.","torrent":{"xt":"urn:btih:6b09c6fca9dba5ad617a532ccc74eb7f47045e16","amp;dn":"Our.Idiot.Brother.hardcore74.mp4.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b09c6fca9dba5ad617a532ccc74eb7f47045e16","infoHashBuffer":{"type":"Buffer","data":[107,9,198,252,169,219,165,173,97,122,83,44,204,116,235,127,71,4,94,22]},"announce":[],"urlList":[]}}