{"title":"The Beach Boys Springfield Civic Center (Springfield, MA) May 15","uid":7265536,"size":56319611,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6c275e62499616b46aee01c7f89ed8178863f4b9&amp;dn=The+Beach+Boys+Springfield+Civic+Center+%28Springfield%2C+MA%29+May+15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":18,"time":1336870265,"description":"The Beach Boys Springfield Civic Center (Springfield, MA) May 15, 1979\n\nfm broadcast\nmp3 256\n\nMike Love - lead vocals\nBrian Wilson - keyboards, vocals\nCarl Wilson - bass, vocals\nDennis Wilson - drums, vocals\nAl Jardine - rhythm guitar, vocals\nBruce Johnston - keyboards, vocals\nBobby Figueroa - drums\nMike Meros - organ, synth\nEd Carter - bass, guitar\n\nRecorded during one of their many &quot;resurgent periods,&quot; this tour marked the reunion of Brian Wilson to the touring lineup of The Beach Boys. Although Wilson had returned to live shows with the band some three years earlier, he was only playing an occasional gig, when his psychiatrist Dr. Eugene Landy allowed. Landy, who was accused of taking advantage of Brian Wilson's fragile mental state through mind control techniques, was eventually ousted when the band and Wilson's immediate family forced an intervention.\n\nThis tour was designed to reconnect Brian with the band he had created and fronted since 1961. Sadly, the tour would also mark one of the last times the original members would all tour together, since drummer Dennis Wilson would accidentally drown four years later in California while under the influence of alcohol. Brother Carl Wilson, in addition, would pass away, sadly, in 1998 from lung cancer.\n\nBecause of the publicity generated by Brian's return, the Light Tour (named after the band's new album at that time, The Light Album) was a huge success, and saw them selling out large arenas many nights. It also marked the return of Bruce Johnston, who had come into the band in 1965 to replace Brian for touring purposes, until leaving in the early 1970s. Johnston went off to write hits for the likes of Barry Manilow, but returned in 1978, when the band began writing and recording new albums.\n\nThis half hour recording represents only one third of the actual show The Beach Boys played on the Light Tour, but several of their biggest classic '60s hits are captured here - including &quot;Surfer Girl,&quot; &quot;I Get Around,&quot; &quot;Help Me Rhonda,&quot; &quot;Wouldn't It Be Nice&quot; and &quot;Surfin' U.S.A.&quot; Another notable track is the band's vocal reworking of the classic Chuck Berry song, &quot;Rock &amp; Roll Music.&quot;\n\nThis show was taped at a time when The Beach Boys were still a viable U.S. act, focused on playing good music and nailing their soaring vocal harmonies. In 1979, they still had relevant new material to offer their fans; and although they would have one more #1 hit (1988's &quot;Kokomo&quot;), Brian Wilson was long absent by that time. These days, the relationship between Mike Love and Brian Wilson, namely, is strained from, the ongoing legal disputes over the ownership of songs and the right to use The Beach Boys name. But you can still catch them here, in their late prime, when the sun was still shining on one of America's most innovative and distinctive groups.","torrent":{"xt":"urn:btih:6c275e62499616b46aee01c7f89ed8178863f4b9","amp;dn":"The+Beach+Boys+Springfield+Civic+Center+%28Springfield%2C+MA%29+May+15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c275e62499616b46aee01c7f89ed8178863f4b9","infoHashBuffer":{"type":"Buffer","data":[108,39,94,98,73,150,22,180,106,238,1,199,248,158,216,23,136,99,244,185]},"announce":[],"urlList":[]}}