{"title":"The Upperfloor--tUF-39848 Kacie Castle, Rikki Rumor, Aiden Starr","uid":14129927,"size":4412059072,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6cb20116909f1bacedae81165918d5400d99a536&amp;dn=The+Upperfloor--tUF-39848+Kacie+Castle%2C+Rikki+Rumor%2C+Aiden+Starr&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":129,"time":1459549433,"description":"Caged Slut Puppy Slaves\r\n\r\nApr 1, 2016 - Performers: Aiden Starr ,  Mickey Mod ,  Kacie Castle  and  Rikki Rumor \r\n\r\n\r\nMed, Hi and HD MP4 + Pics.\r\n\r\n\r\nThe Upper Floor loves fresh meat, and the party is delighted with the cutest caged puppy slaves, panting and whining for the bone. Rikki Rumor and Kacie Castle drool and beg to be let out of their cages as local BDSM babes vibe and fuck their pussies and clamps their tongues. Eventually one slutty little dog talks another crowd member to take her place in the cage and dashes out to start lapping at hard cocks and her fellow slaves trapped cunt. \r\n\r\nRikki has proven herself capable of human comportment and takes her puppy slave sis on a walk with a metal butt plug leash. Both slaves must learn the rules before they can get properly fucked, but the crowd is not easy. The girls are rolling over, licking asses, getting spanked and kissing shoes before they even have two rules. Eventually their governess takes pity and shoves one slaves ass in her face and give's the other one away to a guest of honor to be anally pounded. Rikki gets her perfect pink pussy brutally fisted while Kacie finally receives the bone she has been howling for. \r\n\r\nIt is time for slut puppies to graduate to full on slave trainees. Tied down in tight ropes, the girls must recite the rules well, but Aiden grows bored easily and just goes after Kacie's punished pussy like a shark, zapping her asshole and clit, beating her labia with a fist full of canes. One Kacie's cunt is beet red, she receives a reward fucking and enough hints to belt the rules out during a screaming orgasm. Rikki gets her first taste of cock for the night, and serves the party many shuddering orgasms. \r\n\r\nAiden is in a particularly generous mood and allows Rikki to service her pussy while she enjoys some cake served by Stefanos. After their brief snack break, both slave puppies get a final chance to prove they are worth their collars and bounce on Mr. Mod's massive cock until their get a load of cum. Will they be allowed out of the dog house? Watch to find out. \r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=39848\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:6cb20116909f1bacedae81165918d5400d99a536","amp;dn":"The+Upperfloor--tUF-39848+Kacie+Castle%2C+Rikki+Rumor%2C+Aiden+Starr","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cb20116909f1bacedae81165918d5400d99a536","infoHashBuffer":{"type":"Buffer","data":[108,178,1,22,144,159,27,172,237,174,129,22,89,24,213,64,13,153,165,54]},"announce":[],"urlList":[]}}