{"title":"Stossel.2014.01.23.[Chill Out].Fox Business.CF.avi","uid":9524992,"size":338713406,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6d342faf86a2ccaa01fe57d2addc621155e4f5a0&amp;dn=Stossel.2014.01.23.%5BChill+Out%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1390730211,"description":"----------\n\nSTOSSEL - [Chill Out] - Fox Business Network\n2014, January 23, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\n\nCLIMATE CHANGE: Bill Nye the Science Guy, who says he is &quot;frantic&quot; about climate change debates skeptic Marc Morano of ClimateDepot.com.\n\nGREEN GIVEAWAYS: President of the WorldWatch Institute Robert Engelman defends subsidies for wind and solar power.\n\nWAR ON COAL: Bill Bissett of the Kentucky Coal Association says we have clean air now, and the coal industry gets zero credit for the progress it has made. West Virginia coal miner Mark Nelson talks about lost jobs.\n\nAN INCONSISTENT TRUTH: Radio host Phil Valentine made this movie to rebut Al Gore's documentary. Valentine calls Gore a hypocrite.\n\nTHE MORAL CASE FOR FOSSIL FUELS: Alex Epstein of the Center for Industrial Progress says he loves fossil fuels because they create cheap, plentiful and reliable energy.\n\nMY TAKE: As the world got richer, the air got cleaner. The pollution we should worry about, like soot, particulates and sulfur, is down:\n\nGreenhouse gases may prove to be a problem, but we don't yet know that. The world has real problems like malaria, malnutrition and desperate poverty. America is deep in debt, and fewer jobs get created because we have too many rules. We don't need more micromanagement from the EPA, we need less. Let's chill out about global warming. Then free people will create a better world. ","torrent":{"xt":"urn:btih:6d342faf86a2ccaa01fe57d2addc621155e4f5a0","amp;dn":"Stossel.2014.01.23.%5BChill+Out%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d342faf86a2ccaa01fe57d2addc621155e4f5a0","infoHashBuffer":{"type":"Buffer","data":[109,52,47,175,134,162,204,170,1,254,87,210,173,220,98,17,85,228,245,160]},"announce":[],"urlList":[]}}