{"title":"Wild Wax Combo - Rumble in the Jungle 2006","uid":6855682,"size":248679031,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6df749c478179333e59ed06b1bf74f35016ebc57&amp;dn=Wild+Wax+Combo+-+Rumble+in+the+Jungle+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1322691077,"description":"The Danish trio Wild Wax Combo have come a long way from their 1999 debut album Jungle Fever. That set was a statement of intent, an exhilarating trawl through rockabilly's past, with the band barreling across a stream of rockabilly and R&amp;B covers with positive panache. Seven years on, and the Combo are back with Rumble in the Jungle, their fourth set, and arguably their best to date. Now, of course, the originals far outnumber the covers, although the latter are just as sizzling: check out their inspired version of Susie Q for proof. There's also a rip-roaring take on Miss Froggie, where guitarist Andre goes head to head with guesting pianist Thomas Heed, as well as an emotive cover of Phone Call. The band get the party started by revving up their Hot Rod Racer, then tear up the place with the urgent Call Me Up. They swing their girls 'round the tropics on the title track, and power down the tracks on a driving Choo Choo Train, and Gettin' Down with a steam-rolling rhythm. But it's not all storming R&amp;B and brusque rockabilly. Sentimental Fool, for instance, is insistent, but with a brightness and a touch of elegance that shifts deftly into big-band style swing (albeit in a truncated trio form). Big Beautiful Eyes is equally agile, again big-band style, but also surf-tinged, while Miss Betty blurs the edges between rockabilly and C&amp;W. An electrifying album, but with plenty of diversity in style, this Rumble should be shaking up the rockabilly scene for the foreseeable future.\n(Jo-Ann Greene, allmusic.com)\n\n- - -\n\nWild Wax Combo - Rumble in the Jungle 2006\n(Enviken Enviken Records)\n\n 1. Hot rod racer\n 2. Mad dog mama\n 3. Phone call\n 4. Rumble in the jungle\n 5. Choo choo train\n 6. Gettin' down \n 7. Sentimental fool\n 8. Call me up\n 9. Miss Betty\n10. Susie Q\n11. Baby Lou\n12. Big beautiful eyes\n13. Miss Froggie\n14. Mad dog mama\n","torrent":{"xt":"urn:btih:6df749c478179333e59ed06b1bf74f35016ebc57","amp;dn":"Wild+Wax+Combo+-+Rumble+in+the+Jungle+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df749c478179333e59ed06b1bf74f35016ebc57","infoHashBuffer":{"type":"Buffer","data":[109,247,73,196,120,23,147,51,229,158,208,107,27,247,79,53,1,110,188,87]},"announce":[],"urlList":[]}}