{"title":"Karl Jenkins - Imagined Oceans (1998), [MP3 192 Kbps] Classical ","uid":4838397,"size":93380560,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e06a0049b774ec06dc53f3522afdb574e933130&amp;dn=Karl+Jenkins+-+Imagined+Oceans+%281998%29%2C+%5BMP3+192+Kbps%5D+Classical+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"year2012","files":14,"time":1239405303,"description":"Karl Jenkins - Imagined Oceans (1998), [LOSSY MP3 192 Kbps] Classical [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Karl%20Jenkins%20-%20Imagined%20Oceans%20(1998)&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nKarl Jenkins - Imagined Oceans\nby anno2036\n\nCover\n Visit this link: http://upload.wikimedia.org/wikipedia/en/a/ab/Imagined_oceans_cover.jpg\n\nAlbum\nTitle: Imagined Oceans\nYear:  1998                                    \nGenre: Classical\nLabel: Sony Classical\n\nTracklist\n1. Mare Crisium Introitus\n2. Lacus Serenitatis\n3. Mare Vaporum\n4. Mare Australis\n5. Lacus Somniorum\n6. Lacus Pereverantiae\n7. Lacus Doloris\n8. Mare Undarum\n9. Palus Nebularum\n10.Sinus Iridium\n11.Mare Imbrium\n12.Lacus Temporis\n13.Lacus Lenitatis\n14.Mare Crisium\n\nDescription\nfonte:  Visit this link: http://en.wikipedia.org/wiki/Imagined_Oceans\nReleased in 1998, Imagined Oceans is an album by Welsh composer Karl Jenkins. This work was inspired by thirteen lunar mare for which the tracks are titled. The musical style is similar to Jenkins's Adiemus compositions and each track explores the meaning of its Latin name through various musical techniques. Unlike most of the Adiemus pieces, the lyrics for Imagined Oceans consist of syllables from the tracks' titles rather than invented text.\n\nBiography\nfonte:  Visit this link: http://en.wikipedia.org/wiki/Karl_Jenkins\nKarl William Jenkins OBE D.Mus. (born 17 February 1944) is a Welsh musician and composer. Jenkins was appointed an Officer of the Order of the British Empire in the New Year Honours list for 2005.\nBackground\nJenkins was born and raised in the Gower village of Penclawdd. His father, who was a local schoolteacher, organist, and choirmaster, gave him his initial musical instruction.\nJenkins began his diverse musical career as an oboist in the National Youth Orchestra of Wales. He went on to study music at University College, Cardiff, and then commenced postgraduate studies at the Royal Academy of Music.\nCareer overview\nFor the bulk of his early career, he was known as a jazz and jazz-rock musician, playing variously: baritone and soprano saxophones, keyboards, and oboe, an unusual instrument in a jazz context. He joined jazz composer Graham Collier's group and later co-founded the jazz-rock group Nucleus, which won first prize at the Montreux Jazz Festival in 1970. Later he joined the Canterbury progressive rock band Soft Machine in 1972 and co-led their very last performances in 1984. The group defied categorisation and played venues as diverse as The Proms, Carnegie Hall, and the Newport Jazz Festival. The album on which Jenkins first played with Soft Machine, Six, won the Melody Maker British Jazz Album of the Year award in 1973. Jenkins also won the miscellaneous musical instrument section (as he did the following year). Soft Machine was voted best small group in the Melody Maker jazz poll of 1974. After Mike Ratledge left the band in 1976 Soft Machine did not include any of its founding members, but kept recording on a project basis with line-ups revolving around Jenkins and drummer John Marshall. Balanced against Melody Maker's positive view of the Soft Machine of 1973 and 1974, Hugh Hopper, involved with the group since inception, cites Jenkins &quot;third rate&quot; musical involvement in his own decision to leave the band, and the band of the late '70s has been described by band member John Etheridge as wasting its potential.\nJenkins has created a good deal of advertising music, twice winning the industry prize in that field. Perhaps his most-heard piece of music is the classical theme used by De Beers diamond merchants for their famous television advertising campaign focusing on jewellery worn by people who are otherwise seen only in silhouette. He later included it as the title track in a compilation of various works called Diamond Music, and eventually created Palladio, using it as the theme of the first movement.\nAs a composer, his breakthrough came with the crossover project Adiemus. Jenkins has conducted the Adiemus project in Japan, Germany, Spain, Finland, the Netherlands, and Belgium, as well as London's Royal Albert Hall and Battersea Power Station. The Adiemus: Songs of Sanctuary (1995) album sold well enough where it topped the classical album charts. It spawned a series of successors, each revolving around a central theme.\nJenkins was the first international composer and conductor to conduct the University of Johannesburg Kingsway Choir led by Renette Bouwer, during his visit to South Africa as the choir performed his The Armed Man: A mass for peace together with a 70 piece orchestra.\nHe is also a joint president of the British Double Reed Society\nAwards and achievements\nJenkins holds a D.Mus (Doctor of Music) degree from the University of Wales. He has been made both a Fellow and an Associate of the Royal Academy of Music, and a room has been named in his honour. He also has fellowships at Cardiff University, the Royal Welsh College of Music &amp; Drama, Trinity College Carmarthen, Swansea Institute and was presented by Classic FM with the 'Red f' award for outstanding service to classical music.\nHe was awarded an honorary doctorate in Music from the University of Leicester, the Chancellors Medal from the University of Glamorgan and two Honorary visiting Professorships; one at Thames Valley University, London College of Music and the other at the ATriUM, Cardiff.\nHe was awarded an OBE, by Her Majesty The Queen, in the 2005 New Years Honours List &quot;for services to music&quot;.\nJenkins' Post-nominal letters include D.Mus., FRAM (Fellow of the Royal Academy of Music), FWCMD and FTCC.\n\nFormat\nMP3 - 192 Kbps - 44 kHz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:6e06a0049b774ec06dc53f3522afdb574e933130","amp;dn":"Karl+Jenkins+-+Imagined+Oceans+%281998%29%2C+%5BMP3+192+Kbps%5D+Classical+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e06a0049b774ec06dc53f3522afdb574e933130","infoHashBuffer":{"type":"Buffer","data":[110,6,160,4,155,119,78,192,109,197,63,53,34,175,219,87,78,147,49,48]},"announce":[],"urlList":[]}}