{"title":"Conan the Barbarian (Marvel) [BigBonedNinja][h33t]","uid":4023298,"size":3349221554,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6ef22060d872a1b53713258ae5f9c1b5ee70b0f6&amp;dn=Conan+the+Barbarian+%28Marvel%29+%5BBigBonedNinja%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seedYAbastid","files":302,"time":1202771607,"description":"[IMG]http://img443.imageshack.us/img443/941/ctbv1cs5.jpg[/IMG]\nConan the Barbarian Volume One 1-275:\nConan (often referred to as Conan the Cimmerian, from the name of his homeland, Cimmeria) is a fictional character created by Robert E. Howard in the 1930s. Howard&amp;#039;s Conan appeared as short stories in Weird Tales magazine, a renowned publication of the era. Conan has appeared in comics nearly non-stop since 1970. The comics are arguably, apart from the books, the vehicle that has had the greatest influence on the public mind concerning the character.  Two comic series have been produced with the name &quot;Conan&quot;?one from Marvel Comics and one from Dark Horse Comics.  Marvel Comics introduced a fairly faithful version of Conan the Barbarian in 1970 with Conan the Barbarian, written by Roy Thomas and illustrated by Barry Windsor-Smith. He was succeeded after several issues by penciller John Buscema, while Thomas continued to write for many years. Later writers included J.M. DeMatteis, Bruce Jones, Michael Fleisher, Doug Moench, Jim Owsley, Alan Zelenetz, Chuck Dixon, and Don Kraar. Although many artists worked on the different Marvel Conan comic-books at one time or the other, only a few apart from Windsor-Smith and Buscema produced more than a handful of stories. The most prolific include Ernie Chan, Alfredo Alcala, Gil Kane, Rafael Kayanan, Mike Docherty, Val Semeiks, and Gary Kwapisz.\n\n[IMG]http://img508.imageshack.us/img508/5296/sitwjl2.jpg[/IMG]\nConan The Barbarian - Stalker of the Woods Volume Two 1-3:\n3 part mini-series from 1997 written by Roland Green and Pencilled by Claudio Castellini (Italian comic book artist and graphical creator of Nathan Never\n\n[IMG]http://img341.imageshack.us/img341/819/4m02yxurl0.jpg[/IMG]\nGiant Size Conan the Barbarian 1-5\n\n[IMG]http://img152.imageshack.us/img152/8349/conanannual0101nl7pw2.jpg[/IMG]\nConan the Barbarian Annuals 1-12:\nMarvel Comics introduced a fairly faithful version of Conan in 1970 with Conan the Barbarian, written by Roy Thomas and illustrated by Barry Windsor-Smith. He was succeeded after several issues by penciller John Buscema, while Thomas continued to write for many years. Later writers included J.M. DeMatteis, Bruce Jones, Michael Fleisher, Doug Moench, Jim Owsley, Alan Zelenetz, Chuck Dixon, and Don Kraar. Although many artists worked on the different Marvel Conan comic-books at one time or the other, only a few apart from Windsor-Smith and Buscema produced more than a handful of stories. The most prolific include Ernie Chan, Alfredo Alcala, Gil Kane, Rafael Kayanan, Mike Docherty, Val Semeiks, and Gary Kwapisz.\nThe Annuals feature the Work of Barry Windsor-Smith, John Buscema, Gil Kane, Val Mayarek &amp; Ernie Chan. The story in Annual 12 is continued in Conan the Barbarian 200.\n\n[IMG]http://img178.imageshack.us/img178/6952/faflf3.jpg[/IMG]\nConan the Barbarian - Flame &amp; the Fiend 1-3\n\n[IMG]http://img128.imageshack.us/img128/3169/tumh2.jpg[/IMG]\nConan The Barbarian - The Usurper 1-3:\nConan the Usurper is a 1967 collection of four fantasy short stories written by Robert E. Howard and L. Sprague de Camp featuring Howard&amp;#039;s seminal sword and sorcery hero Conan the Barbarian. Most of the stories originally appeared in the fantasy magazine Weird Tales in the 1930s. The book has been reprinted a number of times since by various publishers, and has also been translated into German, Spanish, Italian and Dutch.\n\n\nThanks to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding. :D\n","torrent":{"xt":"urn:btih:6ef22060d872a1b53713258ae5f9c1b5ee70b0f6","amp;dn":"Conan+the+Barbarian+%28Marvel%29+%5BBigBonedNinja%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ef22060d872a1b53713258ae5f9c1b5ee70b0f6","infoHashBuffer":{"type":"Buffer","data":[110,242,32,96,216,114,161,181,55,19,37,138,229,249,193,181,238,112,176,246]},"announce":[],"urlList":[]}}