{"title":"Jurassic Park NL sub avi (MovieNight)","uid":6614017,"size":836503040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f946b16f0537e11a50338d1ad8a186d15a71707&amp;dn=Jurassic+Park+NL+sub+avi+%28MovieNight%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MovieNight","files":1,"time":1313710133,"description":"Steven Spielbergs meesterlijke en baanbrekende avonturenfilm over een eiland met prachtige maar ook gevaarlijke dinosauriÃƒÂ«rs\n\nOp een afgelegen eiland voor de kust van Costa Rica heeft de rijke, excentrieke ondernemer John Hammond een uitzonderlijk themapark gebouwd. Het park bevat prehistorische schepsels van 65 miljoen jaar terug, die door wetenschappers met behulp van DNA uit dinosaurusbloed tot leven zijn gewekt. Een select groepje, bestaande uit advocaat Donald Gennaro, wiskundige Ian Malcolm, dinosaurusexpert dr. Alan Grant en oudheidkundige dr. Ellie Sattler, wordt door Hammond samen met zijn kleinkinderen Tim en Lex uitgenodigd om voor de officiÃƒÂ«le opening een kijkje te komen nemen. Maar de rondleiding krijgt een ander verloop dan verwacht als het veiligheidssysteem kapot gaat en de reuzen op hol slaan.\n\nMet 'Jurassic Park' leverde regisseur Steven Spielberg een film af die een mijlpijl op computer-animatie gebied werd. De fantastische special effects van ILM (Industrial Light &amp; Magic) werden terecht bekroond met een Oscar. Deze uitstekende verfilming, gebaseerd op een boek van Michael Crichton, werd een wereldhit en kreeg twee vervolgen.\n\n\nMovieNight\n\nVerzoeken? Vraag maar raak.","torrent":{"xt":"urn:btih:6f946b16f0537e11a50338d1ad8a186d15a71707","amp;dn":"Jurassic+Park+NL+sub+avi+%28MovieNight%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f946b16f0537e11a50338d1ad8a186d15a71707","infoHashBuffer":{"type":"Buffer","data":[111,148,107,22,240,83,126,17,165,3,56,209,173,138,24,109,21,167,23,7]},"announce":[],"urlList":[]}}