{"title":"How Games Move Us - Emotion by Design (2016).epub Gooner","uid":14996995,"size":4931779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fb593daaf1def8177e616ac54e92adac348c28e&amp;dn=How+Games+Move+Us+-+Emotion+by+Design+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1466354873,"description":"How Games Move Us - Emotion by Design (2016).epub Gooner\r\n\r\nPublisher: MIT Press (25 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 0262034263\r\nISBN-13: 978-0262034265\r\n\r\nThis is a renaissance moment for video games -- in the variety of genres they represent, and the range of emotional territory they cover. But how do games create emotion? \r\n\r\nIn How Games Move Us, Katherine Isbister takes the reader on a timely and novel exploration of the design techniques that evoke strong emotions for players. She counters arguments that games are creating a generation of isolated, emotionally numb, antisocial loners. Games, Isbister shows us, can actually play a powerful role in creating empathy and other strong, positive emotional experiences; they reveal these qualities over time, through the act of playing. She offers a nuanced, systematic examination of exactly how games can influence emotion and social connection, with examples -- drawn from popular, indie, and art games -- that unpack the gamer's experience. \r\n\r\nIsbister describes choice and flow, two qualities that distinguish games from other media, and explains how game developers build upon these qualities using avatars, non-player characters, and character customization, in both solo and social play. She shows how designers use physical movement to enhance players' emotional experience, and examines long-distance networked play. She illustrates the use of these design methods with examples that range from Sony's Little Big Planet to the much-praised indie game Journey to art games like Brenda Romero's Train. \r\n\r\nIsbister's analysis shows us a new way to think about games, helping us appreciate them as an innovative and powerful medium for doing what film, literature, and other creative media do: helping us to understand ourselves and what it means to be human","torrent":{"xt":"urn:btih:6fb593daaf1def8177e616ac54e92adac348c28e","amp;dn":"How+Games+Move+Us+-+Emotion+by+Design+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb593daaf1def8177e616ac54e92adac348c28e","infoHashBuffer":{"type":"Buffer","data":[111,181,147,218,175,29,239,129,119,230,22,172,84,233,42,218,195,72,194,142]},"announce":[],"urlList":[]}}