{"title":"Robert De Niro Movie Pack-TorrentLeech","uid":4549627,"size":20913413149,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7034bbce62766a1ab62aa834ada82f6601b65992&amp;dn=Robert+De+Niro+Movie+Pack-TorrentLeech&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"circlensess","files":115,"time":1228253743,"description":"The Godfather (1972)\n\n\nGenre: Drama, Thriller  \nYear: 1972 \nCountry: USA \nRuntime: 175min  \nDirector: Francis Ford Coppola  \nWriter: Mario Puzo, Mario Puzo  \nCast:   Marlon Brando, Al Pacino, James Caan, Richard S. Castellano, Robert Duvall, Diane Keaton, Robert De Niro \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068646/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068646/&lt;/a&gt;\n\nThe story begins as &quot;Don&quot; Vito Corleone, the head of a New York Mafia &quot;family&quot;, oversees his daughter's wedding. His beloved son Michael has just come home from the war, but does not intend to become part of his father's business. Through Michael's life the nature of the family business becomes clear. The business of the family is just like the head of the family, kind and benevolent to those who give respect, but given to ruthless violence whenever anything stands against the good of the family. Don Vito lives his life in the way of the old country, but times are changing and some don't want to follow the old ways and look out for community and &quot;family&quot;. An up and coming rival of the Corleone family wants to start selling drugs in New York, and needs the Don's influence to further his plan. The clash of the Don's fading old world values and the new ways will demand a terrible price, especially from Michael, all for the sake of the family.\n\n\n\n\n\n\nThe Godfather: Part II (1974)\n\n\nGenre: Drama, Thriller \nYear: 1974 \nCountry: USA \nRuntime: 200min  \nDirector: Francis Ford Coppola  \nWriter: Mario Puzo, Francis Ford Coppola  \nCast:   Al Pacino, Robert Duvall, Diane Keaton, Robert De Niro, John Cazale, Talia Shire, Richard Bright \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071562/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071562/&lt;/a&gt;\n\nThe continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.\n \n\n\nTaxi Driver (1976)\n\n\nGenre: Crime, Drama, Thriller \nYear: 1976 \nCountry: USA \nRuntime: 110min  \nDirector: Martin Scorsese  \nWriter: Paul Schrader  \nCast:   Robert De Niro, Cybill Shepherd, Peter Boyle, Jodie Foster, Harvey Keitel, Albert Brooks \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0075314/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0075314/&lt;/a&gt;\nNew York City cab driver Travis Bickle constantly, almost obsessively, reflects on the ugly corruption of life around him, and becomes increasingly disturbed over his own loneliness and alienation. In nearly every phase of his life, Bickle remains a complete outsider, failing to make emotional contact with anyone. Unable to sleep night after night, Travis haunts the local pornography emporiums to find diversion, and begins desperately thinking about an escape from his depressing existence.\n\n\n\n\n\n\nThe Deer Hunter (197\n\n\nGenre: Drama, War \nYear: 1978 \nCountry: USA \nRuntime: 182min  \nDirector: Michael Cimino \nWriter: Michael Cimino, Deric Washburn  \nCast:   Robert De Niro, John Cazale, John Savage, Christopher Walken, Meryl Streep, Rutanya Alda \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0077416/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0077416/&lt;/a&gt;\n\nMichael, Steven and Nick are young factory workers from Pennsylvania who enlist into the Army to fight in Vietnam. Before they go, Steven marries the pregnant Angela and their wedding-party is also the men's farewell party. After some time and many horrors the three friends fall in the hands of the Vietcong and are brought to a prison camp in which they are forced to play Russian roulette against each other. Michael makes it possible for them to escape, but they soon get separated again. \n\n\n\n\n\n\n\nRaging Bull (1980)\n\nGenre: Biography, Drama, Sport \nYear: 1980 \nCountry: USA \nRuntime: 129min  \nDirector: Martin Scorsese  \nWriter: Jake LaMotta, Joseph Carter  \nCast:   Robert De Niro, Cathy Moriarty, Joe Pesci, Frank Vincent, Nicholas Colasanto, Theresa Saldana \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0081398/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0081398/&lt;/a&gt;\n\nWhen Jake LaMotta steps into a boxing ring and obliterates his opponent, he's a prizefighter portrayed in this Martin Scorsese film by Robert De Niro. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone. If you never thought boxing cinematography could be breathtaking, check out Michael Chapman's handiwork.\n\n\n\n\n\n\n\n\nOnce Upon a Time in America (1984)\n\nGenre: Crime, Drama \nYear: 1984 \nCountry: USA \nRuntime: 139min  \nDirector: Sergio Leone  \nWriter: Harry Grey, Leonardo Benvenuti  \nCast:   Robert De Niro, James Woods, Elizabeth McGovern, Tuesday Weld, Treat Williams, Joe Pesci, Danny Aiello, Burt Young  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0087843/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0087843/&lt;/a&gt;\n\nEpic, episodic, tale of the lives of a small group of New York City Jewish gangsters spanning over 40 years. Told mostly in flashbacks and flash-forwards, the movie centers on small-time hood David 'Noodles' Aaronson and his lifelong partners in crime; Max, Cockeye and Patsy and their friends from growing up in the rough Jewish neighborhood of New York's Lower East Side in the 1920s, to the last years of Prohibition in the early 1930s, and then to the late 1960s where an elderly Noodles returns to New York after many years in hiding to look into the past. \n\n\n\n\n\n\n\n\nAngel Heart (1987)\n\nGenre: Horror, Mystery, Thriller \nYear: 1987 \nCountry: USA \nRuntime: 113min  \nDirector: Alan Parker  \nWriter: Alan Parker, William Hjortsberg  \nCast:   Mickey Rourke, Robert De Niro, Lisa Bonet, Charlotte Rampling, Judith Drake, Stocker Fontelieu, Brownie McGhee,  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0092563/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0092563/&lt;/a&gt;\n\nHarry Angel is a private investigator. He is hired by a man who calls himself Louis Cyphre to track down a singer called Johnny Favorite. But the investigation takes an unexpected and somber turn.\n\n\n\n\n\n\n\n\n\nGoodfellas (1990)\n\nGenre: Biography, Crime, Drama \nYear: 1990 \nCountry: USA \nRuntime: 195min  \nDirector: Martin Scorsese  \nWriter: Nicholas Pileggi  \nCast:   Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco, Paul Sorvino, Frank Sivero, Tony Darrow, Mike Starr     \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0099685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0099685/&lt;/a&gt;\n\n&quot;As far back as I can remember, I've always wanted to be a gangster.&quot; -- Henry Hill, Brooklyn, N.Y. 1955.\n\n\n\n\n\n\nA Bronx Tale (1993)\n\nGenre: Crime, Drama \nYear: 1993 \nCountry: USA \nRuntime: 121min  \nDirector: Robert De Niro  \nWriter: Chazz Palminteri  \nCast:   Robert De Niro, Chazz Palminteri, Lillo Brancato, Francis Capra, Kathrine Narducci, Joe Pesci  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0106489/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0106489/&lt;/a&gt;\n\nGangster Sonny is the big man in Calogero's Bronx neighborhood. A shooting witnessed by Calogero is the starting point of a lasting bond between the gangster and the small boy. Father (bus driver Lorenzo), however, disap- proves. Calogero grows up under the wings of both men, torn between his own natural honesty and his fascination with Sonny. C's neighborhood cronies get involved in theft, use of guns, racial fights. When C meets girl, things don't become easier. C's leap to manhood is marked by tragedy, but also by his recognition of the many faces of love.\n\n\n\n\n\n\n\nCasino (1995)\n\nGenre: Crime / Drama \nYear: 1995 \nCountry: USA \nRuntime: 175min  \nDirector: Martin Scorsese  \nWriter: Nicholas Pileggi \nCast:   Robert De Niro, Sharon Stone, Joe Pesci, James Woods, Frank Vincent, Kevin Pollak, Don Rickles  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0112641/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0112641/&lt;/a&gt;\n\nThis Martin Scorsese film depicts the Janus-like quality of Las Vegas--it has a glittering, glamorous face, as well as a brutal, cruel one. Ace Rothstein and Nicky Santoro, mobsters who move to Las Vegas to make their mark, live and work in this paradoxical world. Seen through their eyes, each as a foil to the other, the details of mob involvement in the casinos of the 1970's and '80's are revealed. Ace is the smooth operator of the Tangiers casino, while Nicky is his boyhood friend and tough strongman, robbing and shaking down the locals. However, they each have a tragic flaw--Ace falls in love with a hustler, Ginger, and Nicky falls into an ever-deepening spiral of drugs and violence.\n\n\n\n\n\n\n\n\n\nHeat (1995)\n\nGenre: Crime / Drama \nYear: 1995 \nCountry: USA \nRuntime: 171min  \nDirector: Michael Mann  \nWriter: Michael Mann  \nCast:   Robert De Niro, Al Pacino, Val Kilmer, Jon Voight, Tom Sizemore, Diane Venora, Amy Brenneman, Ashley Judd,   &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113277/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113277/&lt;/a&gt;\n\nNeil McCauley is a thief... an expert thief... one of the best. His philosophy in life - become attached to nothing in life that you can't walk away from in 30 seconds if you spot the &quot;Heat&quot; around the corner. His crew of criminals is a high-tech outfit pulling off professional jobs that impress even the likes of Detective Vincent Hanna. But Hanna, a man driven through life only by his work, becomes obsessed, at the expense of his private life, with bringing McCauley down. As McCauley's crew prepare for the score of a lifetime, and Hanna's team tries to bring him in, the two find that they are challenged by the greatest minds on the opposite side of the law that either one has ever encountered.\n\n\n\n\n\n\n\nRonin (1999)\n\nGenre: Action, Crime, Thriller \nYear: 1998 \nCountry: USA \nRuntime: 116min  \nDirector: John Frankenheimer  \nWriter: JJ.D. Zeik  \nCast:   Robert De Niro, Jean Reno, Natascha McElhone, Stellan Skarsgard, Sean Bean, Jonathan Pryce, Ron Perkins  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0122690/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0122690/&lt;/a&gt;\n\nRonin is the Japanese word used for Samurai without a master. In this case, the Ronin are outcast specialists of every kind, whose services are available to everyone - for money. Dierdre (undoubtedly from Ireland) hires several Ronin to form a team in order to retrieve an important suitcase from a man who is about to sell it to the Russians. After the mission has been completed successfully, the suitcase immediately gets switched by a member of the team who seems to work into his own pocket. The complex net of everyone tricking everyone begins to surface slowly, and deadly...\n\n\n\n\n\n\nMeet the Parents (2000)\n\nGenre: Comedy, Romance \nYear: 2000 \nCountry: USA \nRuntime: 107min  \nDirector: Jay Roach  \nWriter: Greg Glienna, Mary Ruth Clarke  \nCast:   Robert De Niro, Ben Stiller, Teri Polo, Blythe Danner, Nicole DeHuff, Jon Abrahams, Owen Wilson  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0212338/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0212338/&lt;/a&gt;\n\nA Jewish male nurse (Ben Stiller) plans to ask his live-in girl friend (Teri Polo) to marry him. However, he learns that her strict father (Robert DeNiro) expects to be asked for his daughter's hand before she can accept. Thus begins the visit from Hell as the two travel to meet Mom (Blythe Danner) and Dad, who turns out to be former CIA with a lie detector in the basement. Coincidentally, a sister (Nicole DeHuff) also has announced her wedding to a young doctor (Thomas McCarthy). Of course everything that can go wrong, does, including the disappearance of Dad's beloved Himalayan cat, Jinxie.\n\n\n\n\n\n\n\nMeet the Fockers (2004)\n\nGenre: Comedy, Romance \nYear: 2004 \nCountry: USA \nRuntime: 110min  \nDirector: Jay Roach  \nWriter: Greg Glienna, Mary Ruth Clarke  \nCast:   Robert De Niro, Ben Stiller, Dustin Hoffman, Barbra Streisand, Blythe Danner, Teri Polo, Owen Wilson  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0290002/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0290002/&lt;/a&gt;\n\n\nHaving given permission to male nurse Greg Focker to marry his daughter, ex-CIA man Jack Byrnes and his wife travel to Miami to Greg's parents, who this time around are Mr. and Mrs. Focker, who are as different from them as can be. As asked in the first movie, what sort of people name their son Gaylord M. Focker?","torrent":{"xt":"urn:btih:7034bbce62766a1ab62aa834ada82f6601b65992","amp;dn":"Robert+De+Niro+Movie+Pack-TorrentLeech","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7034bbce62766a1ab62aa834ada82f6601b65992","infoHashBuffer":{"type":"Buffer","data":[112,52,187,206,98,118,106,26,182,42,168,52,173,168,47,102,1,182,89,146]},"announce":[],"urlList":[]}}