{"title":"Joan of Arc - How Memory Works (1998) [FLAC] - Kitlope","uid":4740355,"size":216336849,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:71846f27fefae5ce3b85927a6d474dd70b4a80c8&amp;dn=Joan+of+Arc+-+How+Memory+Works+%281998%29+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":15,"time":1235517171,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 71846F27FEFAE5CE3B85927A6D474DD70B4A80C8\nFile Size: 206.31 Mb\nYear: 1998\nLabel: Jade Tree\nCatalog #: JT1037 7-92258-1037-2-4\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\n\nJoan of Arc are an experimental indie rock band from Chicago, Illinois. They formed in 1995, following the break up of Cap'n Jazz.\n\nSinger Tim Kinsella has been the only permanent member of the group; he has also recorded as a solo artist.\n\nJoan of Arc are known for their use of electronics, samples, and multi-track recording in their songs; some songs on The Gap contained over 100 tracks.\n\nJoan of Arc's lyrics and cover art are often intentionally misleading, humorous, or confusing. For example, the album Live in Chicago 1999 is not a live album, but a reference to the fact that that the band lived in Chicago in the year 1999.\n\nMembers of Joan of Arc have been in many other bands including Friend/Enemy with Califone's Tim Rutili; American Football with Kinsella's brother Mike; Owls, a Cap'n Jazz reunion; Ghosts and Vodka; Everyoned, and most recently Make Believe.\n\nRed Blue Yellow broke up after their first show, threw away all of their old material, and started afresh- with new songs and a new name. Three months later, Joan of Arc had their first show at Autonomous Zone in Chicago. After two promising 7&quot; singles, the band recorded their debut album A Portable Model Of... on the Jade Tree label.\n\nA Portable Model Of... introduced JOA's signature sound: a fondness for stark acoustic songs combined with subtle electronics. The debut album also included some harder material and collaborations with former Cap'n Jazz guitarist and The Promise Ring singer Davey von Bohlen and Euphone's Ryan Rhapsys, who would later drum for Owls following the departure of Mike Kinsella.\n\nIn 1998, Joan of Arc released How Memory Works. The album included what would become a hallmark of Joan Of Arc's subsequent output: interludes of synthetic noises cut with vocal samples and off-beat instrumentation. As always, Kinsella's lyrics were cryptic and oblique, though the song 'This Life Cumulative' made reference to the media alienation of singer/songwriter Fiona Apple.\n\nFollowing the departure of Mike Kinsella, Erik Bocek, and the addition of Todd Mattei, Joan Of Arc found themselves thrust unwillingly into the spotlight by the sudden success of a Jade Tree retrospective by Kinsella's former band Cap'n Jazz. Despite being heralded as a pioneer of a diverse genre known as 'emo' (a term rejected by Kinsella), Joan of Arc's next album was a reaction to this unwelcome classification. The songs on the album were slower and contained more spacious arrangements thanks to a newly found fondness for studio trickery. The album's artwork depicted recreated scenes from Jean-Luc Godard's 1967 film Le Weekend. The release of Live in Chicago also marked the increasing media perception of Joan Of Arc as a 'difficult' band, an impression that would dog Kinsella in particular throughout the band's existence.\n\nNegative critical reaction to Joan of Arc would become especially apparent after the release of The Gap in 2000. Completely eschewing past convention, JOA created one long ebbing piece of music, with only occasionally recognizable songs. This increasingly progressive studio-heavy approach- mostly of clattering, incidental percussion and background noise- found some favor among band loyalists, but baffled the music press. As a result, growing tensions within the group, indifference from their label, and a poorly-received follow-up EP led to Joan Of Arc's breakup.\n\n\n\n\nHow Memory Works \n\n\nTracks: \n\n\n1.\t&quot;Honestly Now&quot; - 0:48 \n2.\t&quot;Gin &amp; Platonic&quot; - 3:32 \n3.\t&quot;To've Had Two Of&quot; - 3:07 \n4.\t&quot;This Life Cumulative&quot; - 3:41 \n5.\t&quot;A Pale Orange&quot; - 6:47 \n6.\t&quot;White Out&quot; - 3:50 \n7.\t&quot;So Open; Hooray!&quot; - 4:23 \n8.\t&quot;A Name&quot; - 3:08 \n9.\t&quot;Osmosis Doesn't Work&quot; - 3:33 \n10.\t&quot;God Bless America&quot; - 2:22 \n11.\t&quot;A Party Able Model Of&quot; - 2:52 \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:71846f27fefae5ce3b85927a6d474dd70b4a80c8","amp;dn":"Joan+of+Arc+-+How+Memory+Works+%281998%29+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71846f27fefae5ce3b85927a6d474dd70b4a80c8","infoHashBuffer":{"type":"Buffer","data":[113,132,111,39,254,250,229,206,59,133,146,122,109,71,77,215,11,74,128,200]},"announce":[],"urlList":[]}}