{"title":"Acharya S - Suns of God","uid":6525692,"size":33919036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7334a0e60027064fa2dcc0b08c14d82e4e47d531&amp;dn=Acharya+S+-+Suns+of+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"spkenny","files":1,"time":1310151089,"description":"Review\n&quot;Suns of God&quot; supplies vital knowledge for anyone claiming to be an authority on world religions.\n\nKenn Thomas -- Steamshovel Press\n\nA must-read for any human with the courage to search for literal truth as opposed to salves... -- American Anthropological Research Foundation\n\nAchieves a rare level of scholarship essentially proving the non-historicity of religious figures such as Krishna, Buddha and Christ. -- Tim Leedom\n\nAmidst the chaos of Bush's War on Terror, largely founded on religious intolerance, Acharya is the voice of reason. -- Paranoia Magazine/Joan D'Arc\nProduct Description\nPicking up where the bestselling and controversial The Christ Conspiracy leaves off, Suns of God leads the reader through an electrifying exploration of the origin and meaning of the world's religions and popular gods. Over the past several centuries, the Big Three spiritual leaders have been the Lords Christ, Krishna and Buddha, whose stories and teachings are curiously and confoundingly similar to each other. The tale of a miraculously born redeemer who overcomes heroic challenges, teaches ethics and morality, performs marvels and wonders, acquires disciples and is famed far and wide, to be persecuted, killed and reborn, is not unique but a global phenomenon recurring in a wide variety of cultures long before the Christian era.\n\nThese numerous godmen were not similar &quot;historical&quot; personages who &quot;walked the earth&quot; but anthropomorphizations of the central focus of the famous &quot;mysteries.&quot; A major element of the cryptic, international brotherhood, these mysteries extend back thousands of years and are found worldwide, reflecting an ancient tradition steeped in awe and intrigue. The reasons for this religious development, which has inspired the creation of entire cultures, are unveiled in this in-depth analysis containing fascinating and original research based on evidence both modern and ancient, captivating information kept secret and hidden for ages.\n\nSuns of God is possibly the most complete review of the history of religion from its inception ever composed in a single volume. ","torrent":{"xt":"urn:btih:7334a0e60027064fa2dcc0b08c14d82e4e47d531","amp;dn":"Acharya+S+-+Suns+of+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7334a0e60027064fa2dcc0b08c14d82e4e47d531","infoHashBuffer":{"type":"Buffer","data":[115,52,160,230,0,39,6,79,162,220,192,176,140,20,216,46,78,71,213,49]},"announce":[],"urlList":[]}}