{"title":"Joseph L. Mankiewicz - Suddenly, Last Summer - 1959 - USA","uid":4260616,"size":738586533,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7374c240fd4d6e8af1bc5878b1825bba1b9bdae7&amp;dn=Joseph+L.+Mankiewicz+-+Suddenly%2C+Last+Summer+-+1959+-+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mssantoro","files":13,"time":1214444777,"description":"Qualidade de V?deo: DVD Rip\nV?deo Codec: XvID\nV?deo Bitrate: 127 Kbps\n?udio Codec: MP3\n?udio Bitrate: 128\nResolu??o: 656 x 272\nFormato de Tela: Widescreen (16x9)\nFrame Rate: 23.976 FPS\nTamanho: 700 Mb\n\n\nThis screen version, by Joseph L Mankiewicz, of Tennessee Williams&amp;#039; play isn&amp;#039;t as highly thought of as it should be. It&amp;#039;s not a classic and on occasions it comes over as crude and stilted, but it also has many fine things going for it. Although he never really opens it out, Mankiewicz gives it a fluency that isn&amp;#039;t at all theatrical and although he often films scenes intimately and between only two characters, he ensures it is photographed and cut in a very cinematic fashion.\n\nUnfortunately, one of the two people on screen during these &amp;#039;cinematic&amp;#039; sequences is Montgomery Clift who is at his worst here. It was after his accident and he looks as if he&amp;#039;s in pain. When he walks it&amp;#039;s as if there is a board up his back and he talks as if out of the side of his mouth. Luckily, with him in these scenes is either Elizabeth Taylor or Katharine Hepburn or both and when they are on screen you don&amp;#039;t pay too much attention to Clift.\n\nDilys Powell said Elizabeth Taylor was born to play Tennessee Williams and she was right. Indeed this may be her best performance after &quot;Virginia Woolf&quot;. Catherine&amp;#039;s lines don&amp;#039;t have the kind of poetry in them that Violet Venable&amp;#039;s does but Taylor finds a poetry of her own in her readings. She builds on her long speech at the end and is very moving, even if Mankiewicz can&amp;#039;t resist &amp;#039;showing&amp;#039; us, in flashbacks, what Taylor is telling us, as if he doesn&amp;#039;t trust an audience to sit still and just listen to Taylor. (They would have to in the theatre).\n\nAs Violet, Hepburn has the showier part and she milks it for all it&amp;#039;s worth. It&amp;#039;s a great piece of acting because Violet never seems to be acting, though she tends to think of her life as a kind of performance, something she has passed on to her homosexual son, Sebastian. (If the old adage, &amp;#039;my mother made me a homosexual&amp;#039;, has any validity you don&amp;#039;t have to look any further than here). She enters from above, descending in her small baroque lift, and Hepburn can see the comic potential in such an entrance. Moments later, however, she is recounting how the sea-turtles were devoured by flesh-eating birds in the Galapogos, and you can see just how dangerously unstable this woman really is.\n\nAny film that has acting of this calibre automatically qualifies as worth seeking out, (you forgive the lame work of Clift and Gary Raymond and draw a blind over Mercedes McCambridge, though Albert Dekker is very fine), but this qualifies on other grounds; as one of the better Tennessee Williams adaptations, (he co-wrote it with Gore Vidal), as a flawed, dated but strangely fascinating example of how Hollywood viewed homosexuality at the time, (negatively, naturally, but any face, no matter how horribly distorted, so long as it was in the public gaze, was better than no face at all), and as a serious addition to the Joe Mankiewicz canon.","torrent":{"xt":"urn:btih:7374c240fd4d6e8af1bc5878b1825bba1b9bdae7","amp;dn":"Joseph+L.+Mankiewicz+-+Suddenly%2C+Last+Summer+-+1959+-+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7374c240fd4d6e8af1bc5878b1825bba1b9bdae7","infoHashBuffer":{"type":"Buffer","data":[115,116,194,64,253,77,110,138,241,188,88,120,177,130,91,186,27,155,218,231]},"announce":[],"urlList":[]}}