{"title":"Murder_Death_Kill-Fuck_With_Us_And_Find_Out-2010-FiH","uid":5443588,"size":61359485,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:74784e712919032b6675e7118f604d0fb719935e&amp;dn=Murder_Death_Kill-Fuck_With_Us_And_Find_Out-2010-FiH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UAZFIYAH","files":17,"time":1268949302,"description":"Artist .: Murder Death Kill\nAlbum ..: Fuck With Us And Find Out\nYear ...: 2010\n\nRipped .: 03/18/2010          Label ..: Mediaskare\nRetail .: 03/09/2010          Source .: CD\nGenre ..: Metal               Type ...: CD\nLang ...: English             Ripper .: TEAM FiH\n\nEncoder: LAME v3.97 -V 2 --vbr-new\nGrabber: Exact Audio Copy V0.99 beta 5\n\nTrack:              Track Titles:                 Length:\n\n01-  People Will Die                                 3:33\n02-  Bridge Burner                                   3:04\n03-  Suffocation                                     2:55\n04-  Kill Yourself                                   3:28\n05-  No More Lies                                    3:03\n06-  No More Sanctuary                               2:37\n07-  What Tragedy Is About                           3:05\n08-  Suspended Above                                 2:21\n09-  The Flood                                       3:08\n10-  The Guilty                                      2:47\n11-  Eye For An Eye                                  2:39\n12-  Ground Zero                                     2:48\n13-  Purple City Anthem                              1:04\n\nMurderDeathKill was spawned in the high desert of\nVictorville, California in late 2008 when some of the\nfounding members of the heavyweight hardcore heroes Blood\nStands Still decided to start a new project with the\nmission to be heavier, and more controversial than anything\nthat the world had ever seen.\n\nHardcore Veteran Pitbull Dan Banura quickly recruited his\nbrother/former band mate Art Banura to play drums. Now,\nwith this brutal backbone in place, MDK enlisted their long\ntime friends Aaron, and Sean Bennet to head up vocals. Once\nthe lineup was solidified, MDK wrote and recorded a demo\nand started jumping on shows with bands such as Suicide\nSilence, The Acacia Strain, and Impending Doom. Their\ncollective goal was to write music that was extremely heavy\nand in your face without going too far in the metal\ndirection. The dueling vocals, pummeling riffs, and precise\nrhythms as well as their insane live shows are what set\nthis band far apart from anything else in the genre. In\njust a short time after the bands inception, they already\nhad dozens of high profile shows under their belts.\n\nThe bands busy show schedule combined with their\nreputation for delivering one of the heaviest, most intense\nlive shows around quickly gained them attention, and\nrespect. In early 2009, MDK signed with hardcore super\nlabel Mediaskare Records, and immediately began working\non their full-length debut entitled Fuck With Us And Find\nOut, due out this October.\n\nMurderDeathKill has already completed tours with Life\nRuiner, Betrayal, American Me, Endwell, and Suffokate, and\nalso has an upcoming US tour slated with Gravemaker and\nDonnybrook next month. The band plans to continue touring\nnonstop on their forthcoming album, and push the limits as\nthey deliver their relentless brand of heavyweight\nhardcore. If you have yet to experience one of MDKs\ninfamous live shows, do yourself a favor and check them\nout.\n\nFor Fans Of: ON BROKEN WINGS, SHATTERED REALM, AND THE\nACACIA STRAIN\n\nEnjoy this fucking awesome album and support the band, buy\nthe cd!\n\n","torrent":{"xt":"urn:btih:74784e712919032b6675e7118f604d0fb719935e","amp;dn":"Murder_Death_Kill-Fuck_With_Us_And_Find_Out-2010-FiH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74784e712919032b6675e7118f604d0fb719935e","infoHashBuffer":{"type":"Buffer","data":[116,120,78,113,41,25,3,43,102,117,231,17,143,96,77,15,183,25,147,94]},"announce":[],"urlList":[]}}