{"title":"Lost Planet 2 [PC-DVD][Multi5][Spanish][www.consolasatope.com]","uid":5876225,"size":13356791030,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:74c9c5aa6f97e6e0636588272c440309c11f6aeb&amp;dn=Lost+Planet+2+%5BPC-DVD%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":353,"time":1286651246,"description":"Para Instalar el Juego debemos ejecutar el Archivo Setup.exe ya que no se trata de una ISO, sino de los archivos dentro de una carpetita.\nUna vez Instalado vamos a la carpeta TriViUm y copiamos los archivos (ojo con el Antivirus que lo detectara como virus, lo excluiomos y listo) y lo pegamos en el directorio de Instalacion del Juego.\n\nDescripcion:\nLost Planet 2 es un &quot;shooter&quot; de acciÃƒÂ³n en tercera persona poco habitual. A pesar de contar con una campaÃƒÂ±a individual, lo mÃƒÂ¡s atractivo serÃƒÂ¡ jugar hasta un mÃƒÂ¡ximo de cuatro usuarios en cooperativo online (dos a pantalla partida si lo hacemos en modo local) para completar objetivos recurrentemente dirigidos a avanzar por los entornos selvÃƒÂ¡ticos del planeta EDN III, acabando por el camino con los insectos mÃƒÂ¡s asquerosos y peligrosos que os podÃƒÂ¡is imaginar.\n\nTodo diseÃƒÂ±ado mediante misiones de corta duraciÃƒÂ³n (unos 10 minutos cada una) para que el juego en grupo y el concepto de colaboraciÃƒÂ³n que esconde el tÃƒÂ­tulo sea aÃƒÂºn mÃƒÂ¡s satisfactorio. Y esto siempre con la ayuda de un gran arsenal de armas, habilidades y entornos masivos que descubrir.\n\nAunque la propia Capcom lo desmienta, lo cierto es que el concepto de juego se asemeja al de Monster Hunter, ya que aparte de premiarse el trabajo en equipo vamos a gozar de un nivel de personalizaciÃƒÂ³n muy elevado. Tanto si estamos &quot;online&quot; como &quot;offline&quot;, Lost Planet 2 nos permite jugar con nuestro propio personaje, al que podremos determinar el sexo o diseÃƒÂ±o de cabeza, torso y piernas, realizando infinitas combinaciones hasta dar con el fantÃƒÂ¡stico, gran, ridÃƒÂ­culo u hortera guerrero que andÃƒÂ¡bamos buscando.","torrent":{"xt":"urn:btih:74c9c5aa6f97e6e0636588272c440309c11f6aeb","amp;dn":"Lost+Planet+2+%5BPC-DVD%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74c9c5aa6f97e6e0636588272c440309c11f6aeb","infoHashBuffer":{"type":"Buffer","data":[116,201,197,170,111,151,230,224,99,101,136,39,44,68,3,9,193,31,106,235]},"announce":[],"urlList":[]}}