{"title":"Buggles - Video Killed The Radio Star (Live)  (2nafish)","uid":5337600,"size":152092676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:74ce823f4854a0a948b9552ec73ffc55dedea7fa&amp;dn=Buggles+-+Video+Killed+The+Radio+Star+%28Live%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265368572,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Video Killed the Radio Star&quot; is a song by the British synthpop/New Wave group The Buggles, released as their debut single on the 7 September 1979 on Island Records. It celebrates the golden days of radio, describing a singer whose career is cut short by television. The song topped the music chart in several countries and has been covered by many recording artists. It was the first music video shown on MTV in North America at 00:01 on 1 August 1981.\n\nIn an interview, group member Trevor Horn has said that his lyrics were inspired by the J. G. Ballard short story The Sound-Sweep, in which the title character, a mute boy vacuuming up stray music in a world without it, comes upon an opera singer hiding in a sewer. He also felt &quot;an era was about to pass.&quot; The theme of the song is thus nostalgia, which is also echoed in the tone of the music. The lyrics refer to a period of technological change in the 1960s, the desire to remember the past and the disappointment that children of the current generation would not appreciate the past. In the 1950s and early 1960s, radio was an important medium for many, through which &quot;stars&quot; were created.\n\nThe music video for the song, directed by Russell Mulcahy, was the first to be shown on MTV when the music channel debuted at 00:01 on 1 August 1981. On 27 February 27 2000 it also became the millionth video to be aired on MTV. At 2:57 in the video, Hans Zimmer can be seen playing a keyboard. Debi Doss and Linda Jardim, who provided the female vocals for the song, can also be seen in the video.\n\nThe song was written by Trevor Horn, Geoff Downes and Bruce Woolley. According to an interview given by group member Trevor Horn on BBC Radio 2 Drivetime, Woolley was primarily responsible for the musical content, while Horn wrote most of the words. Woolley was responsible for the addition of the words 'put the blame on VTR'. The first version was recorded by Woolley &amp; the Camera Club (with Thomas Dolby on keyboards) for his album English Garden, which was a hit in Canada. The Buggles later recorded the song and it reached number one in the UK charts the week of 20 October 1979, the first-ever number one for the Island Records label. It also would top the Australian charts, and made the Billboard Hot 100 in the United States, debuting on 10 November 1979 and peaking at number 40.\n\nIt appears on the album The Age of Plastic, where it has an additional piano coda. The complicated arrangement and production of the song, which includes a chorus sung by a group of very high-pitched backup singers, foreshadows Horn's later career as a producer.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:74ce823f4854a0a948b9552ec73ffc55dedea7fa","amp;dn":"Buggles+-+Video+Killed+The+Radio+Star+%28Live%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74ce823f4854a0a948b9552ec73ffc55dedea7fa","infoHashBuffer":{"type":"Buffer","data":[116,206,130,63,72,84,160,169,72,185,85,46,199,63,252,85,222,222,167,250]},"announce":[],"urlList":[]}}