{"title":"Down To Earth - 16 April 2016 (gnv64)","uid":14347264,"size":19507968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:758184206f824da79f7f848185049a76568f23bb&amp;dn=Down+To+Earth+-+16+April+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1460986850,"description":"Down To Earth IN - 16 April 2016\r\nEnglish | 60 pages | True PDF | 18.6 mb \nhttp://www.downtoearth.org.in/\r\n\r\nDown to Earth is an Indian science and environment fortnightly, established by the Society for Environmental Communications in May 1992. The magazine informs people about environmental threats facing India and the world. The magazine's sphere of influence is not limited to India, readers across the world rely on Down to Earth for a view from South Asia on the critical issues of human existence.\r\n\r\nCONTENTS\r\n11 THE FORTNIGHT\r\nSo near...and yet so far - After four decades, conservationists made contact with the rare Sumatran rhino in the Indonesian island of Borneo. But it died due to unknown reasons\r\n16 Excluding the core - The new plastic waste management rules exclude the informal sector that manages\r\nmost of the plastic waste\r\n18 Weak foundation - The Parliamentary Standing Committee's recommendations can further dilute the already weak Compensatory Afforestation Fund Bill, 2015\r\n22 COVER STORY - Win the trophy. Can legalising the ivory trade stop poaching?\r\n37 SCIENCE - Lethal green mutant. A mutation in the genes of vegetarian populations could increase the risk of heart disease and colon cancer\r\n38 HEALTH - Sweet surprise. Indian scientists develop a new device capable of computing different diabetic tests within minutes\r\n40 SPACE - A new dawn. India's maiden solar mission, Aditya-I, to be launched in 2019-2020, will enhance the world's knowledge about the sun\r\n44 Human v Machine - Will artificial intelligence bring a boon or doom?\r\n46 WORLD EARTH DAY - Tree fall. The number of trees per person has declined\r\n48 GOOD NEWS - Loans for loos. Microfinance is helping poor people in Tamil Nadu to build toilets\r\n50 REVIEW - Co-evolution. A new book explores the role of culture in human evolution\r\n52 CLASSROOM - Inclusively smart? Do slum dwellers feature in the grand plan for smart cities?\r\n55 Monopoly v Competition - The Ericsson case highlights the uneasy interface between the competition policy and the patent law\r\n56 OPINION - Think in parallel. India must plan with a lateral mindset as extreme weather events are becoming the norm\r\n58 Learn from India, Dilma - The Brazilian president could take lessons from Narendra Modi on how to handle the crisis surrounding her leadership.\r\n \nhttps://s1.postimg.org/vtnt218rz/Down+To+Earth+-+16+April+2016.jpg","torrent":{"xt":"urn:btih:758184206f824da79f7f848185049a76568f23bb","amp;dn":"Down+To+Earth+-+16+April+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"758184206f824da79f7f848185049a76568f23bb","infoHashBuffer":{"type":"Buffer","data":[117,129,132,32,111,130,77,167,159,127,132,129,133,4,154,118,86,143,35,187]},"announce":[],"urlList":[]}}