{"title":"Danny Barnes...Rocket(2011)[FLAC]","uid":6907398,"size":313009584,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7597f6ac1c984bba504645ac10fc5ef758ba1276&amp;dn=Danny+Barnes...Rocket%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1324646621,"description":"[img]http://image.allmusic.com/00/amg/cov200/drq700/q768/q76800ozvcn.jpg[/img]\n [color=Orange]Rocket [2011] RED Distribution / 0103[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1\t Poison\t-Barnes\t4:39\n2\t Low\t-Barnes\t3:19\n3\t Fun\t-Barnes\t5:05\n4\t Angel\t-Barnes\t3:35\n5\t Soulcrusher\t-Barnes\t4:39\n6\t Bang a Gong (Get It On)\t-Bolan\t4:24\n7\t S.O.T.\t-Barnes\t3:14\n8\t Wine\t-Barnes\t5:07\n9\t Rich Boy Blues\t-Barnes\t4:14\n10\t Rocket\t-Barnes\t3:30\n11\t One\t-Barnes\t4:23\n12\t Safe with Me\t-Barnes\t3:34\n\nThose who have heard Danny Barnes' 2010 album Pizza Box may be forgiven if they initially assume that Rocket was recorded during the same sessions. Using almost the same studio team, Rocket features Barnes on his requisite banjo, Barnjo (a six-string solid-body electric banjo), various guitars, loops, voices, basses, keyboards, and assorted programming. He reunites with producer John Alagia and drummer Matt Chamberlain -- even Dave Matthews returns on backing vocals for the album's first single, a righteous cover of T. Rex's &quot;Bang a Gong (Get It On).&quot; The only new member of Rocket's ensemble is keyboardist and occasional bassist Zac Rae. There is a solid argument to be made for this, of course: &quot;If it ain't broke, don't fix it.&quot; With the exception of the woolly cover of the T. Rex tune, Barnes wrote all the material here using his trademark wiseacre, gallows sense of humor. That said, the other 11 songs here are all winners musically. Opener &quot;Poison,&quot; beginning with dubbed-in television or radio evangelist chatter, is the natural companion piece to &quot;Charlie&quot; on Pizza Box. It's the similarly narrated affair of a dope-abusing, alcoholic ex-con. It begins gently enough but kicks into bone-crunching riffery on the chorus. Barnes is as comfortable in the role of a rocker as he was a bluegrass musician in the Bad Livers. Check &quot;Soulcrusher, a strutting, swaggering lead-in to the T. Rex number. Likewise, &quot;Rich Boy Blues&quot; is a funkier, fuzzed-out space rocker with only Barnes' understated vocals holding the track on the rails. Some tracks that begin in American roots banjo traditions (e.g., &quot;Wine&quot;) eventually evolve as uptempo intense vampy rockers with singalong choruses adding to the party-til-you-puke ethos. The two closing numbers, &quot;One&quot; and &quot;Safe with Me,&quot; break that mold significantly. The former uses some bluegrass licks before transitioning into a spacy groover and the latter is a gorgeous trippy Americana love song with a lilting melody and poetic homespun lyrics. Ultimately, Rocket, like its predecessor, reveals not only that Barnes is a fine songwriter and instrumentalist but -- all these years on from the Bad Livers -- that he's matured into a musical tour de force.\n\ncd ripped by EAC\n\nPLEASE SEED\n\n","torrent":{"xt":"urn:btih:7597f6ac1c984bba504645ac10fc5ef758ba1276","amp;dn":"Danny+Barnes...Rocket%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7597f6ac1c984bba504645ac10fc5ef758ba1276","infoHashBuffer":{"type":"Buffer","data":[117,151,246,172,28,152,75,186,80,70,69,172,16,252,94,247,88,186,18,118]},"announce":[],"urlList":[]}}