{"title":"The Anthony Cumia Show 2015-03-30 MP4 MP3 combo","uid":11788029,"size":301110272,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7665b1525fc1211c141d99c63beb36561802f912&amp;dn=The+Anthony+Cumia+Show+2015-03-30+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mothergoose58","files":2,"time":1427825465,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 136 &quot;The Cumia Chronicles&quot; - TACS starts by keeping up with a car chase that's going on live, Ant mentions seeing Neil Diamond over the weekend, the wristband situation at Barclays Center, his excursion at the bank, and his appearance on Red Eye last Friday. Anthony also talks about taking the Jag for a wash, gets into a Jew discussion, we see &quot;Girls Gone Wild&quot; (aka spring break) on Hannity, an unbe-weave-able fight in the hood, some adorable children fighting, discuss race when it comes to Ferguson protests, the ridiculousness of justifying violence against cops, and what is now &quot;acceptable behavior&quot; in some communities. We then watch a sucker punch train video, a throwback clip from &quot;Computer Chronicles&quot;, hear from the callers, go through Monday's mail, learn about new drama between comedians Ari Shaffir and Damienne Merlina, and the show wraps with a MSNBC story on &quot;sexist coded language&quot; against Hillary Clinton.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:7665b1525fc1211c141d99c63beb36561802f912","amp;dn":"The+Anthony+Cumia+Show+2015-03-30+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7665b1525fc1211c141d99c63beb36561802f912","infoHashBuffer":{"type":"Buffer","data":[118,101,177,82,95,193,33,28,20,29,153,198,59,235,54,86,24,2,249,18]},"announce":[],"urlList":[]}}