{"title":"DVDRebuilder.0.93beta+.CCE.SP2.7.0.2.+.Video.+.Guide.Links","uid":3365635,"size":11692969,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:76fffba79cc66e68a513b39536ff98042565226e&amp;dn=DVDRebuilder.0.93beta%2B.CCE.SP2.7.0.2.%2B.Video.%2B.Guide.Links&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hAmMEr.pl","files":10,"time":1123235921,"description":"DVD REBUILDER v0.93\nDVD Rebuilder is designed to be used as a method of backing up DVDs. This program was built to bridge the gap between the incredibly easy but limited 'one-click' solutions and the incredibly complex but high-quality methods of DVD ripping and backup.Another advantage of DVD-RB when compared to older methods is that it doesn't require access to an expensive authoring package. DVD-RB includes its own reauthoring engine that reconstructs the DVD in a way compatible with its original design.\n---\nadditional description:\nWhat's new\n? Found and corrected a long-time vexing error that could cause &quot;Buffer Overflow...0003&quot; and &quot;Buffer Overflow...0004&quot;. This is very likely the root of some of the &quot;preprocessing&quot; errors that have been reported -- and was accentuated in DVD-RBs &quot;Movie and Menus Only&quot; mode. This one was truly difficult to pin down. My thanks to Carpo, t3rror, and Numer0bis for helping to nail this elusive error.\n? Fixed an error in which the TMAP tables were not being updated correctly for Interleaved and/or Angled sources. This may have caused errors in random access into those sections.\n? Corrected a source of possible &quot;Runtime Error 9&quot; that could happen when IFO and VOBs aren't in agreement about ILVU. This conflict may happen during PREPARE when certain types of preprocessing have been done).\n? Changed output directory format. Now in the designated output dirctory a subdirectory is created called &quot;DVDFILES&quot;. The AUDIO_TS and VIDEO_TS folders are created under that name. This is meant to help avoid confusion and assist in future enhancements by consolidating all files that should be written to the DVD within a single directory.\n-----------------------------------------------------------------------------------\nCinema.Craft.Encoder.V2.70.02.00-Crd\nCinema Craft Encoder is a fast, production level software MPEG-1/-2 encoder developed for the non-linear editor. AVI and QuickTime files are quickly compressed to high quality, MPEG-1 for CD-ROM or internet or MPEG-2 for DVD. Supports Constant Bitrate (CBR) and Variable Bitrate (VBR) encoding, inverse 3:2 pulldown and much more! Plug-in for Premiere.\n-----------------------------------------------------------------------------------\nVideo Guide\nStep by step instalation + configuration (DVD REBUILDER &amp; CCE) + encoding DVD9 to DVD5.\n-----------------------------------------------------------------------------------\nGuide\nGuides form doom9.org &amp; dvdguides.trilight.net","torrent":{"xt":"urn:btih:76fffba79cc66e68a513b39536ff98042565226e","amp;dn":"DVDRebuilder.0.93beta%2B.CCE.SP2.7.0.2.%2B.Video.%2B.Guide.Links","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76fffba79cc66e68a513b39536ff98042565226e","infoHashBuffer":{"type":"Buffer","data":[118,255,251,167,156,198,110,104,165,19,179,149,54,255,152,4,37,101,34,110]},"announce":[],"urlList":[]}}