{"title":"Technician Windows XP SP3 Retail with AMD, Intel, and nVidia SAT","uid":7759355,"size":1117203589,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:776e428539b542619e15ea90f61dce71e23456bf&amp;dn=Technician+Windows+XP+SP3+Retail+with+AMD%2C+Intel%2C+and+nVidia+SAT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"notapirate","files":1,"time":1351185534,"description":"This torrent provides both Windows XP Home and Windows XP Professional ISO files for use by technicians in reinstalling Windows XP with legitimate XP keys. The ISO files are inside a 7zip archive to save bandwidth, and the extractor can be downloaded freely from http://7-zip.org/ .....and it's one of the best free archive utilities of which I know.\n\nThese ISO files have been lightly tested, but I would appreciate feedback about how well they work or don't work, and on which hardware, so I can potentially improve these in the future. However, I don't have time to help noobs learn about Windows installation, so please don't ask.\n\nThis torrent does NOT include any keys or cracks, and I will not provide them. They do exist, but I am not a fan of piracy, and merely use this site to exchange tools for legitimate purposes. I am providing this for people like myself to use in performing legitimate work, not for pirates to use in stealing Microsoft's work. If that is your goal, you'll have to find keys and cracks elsewhere. (For the record, I also don't care if anyone thinks that I belong here. That comment has been made before as well.)\n\nThe initial seed will be slow, because I have a very limited upstream bandwidth, but if everyone seeds to 1, this will be resolved after a few days.\n\nTo all my technician friends, happy repairs!","torrent":{"xt":"urn:btih:776e428539b542619e15ea90f61dce71e23456bf","amp;dn":"Technician+Windows+XP+SP3+Retail+with+AMD%2C+Intel%2C+and+nVidia+SAT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"776e428539b542619e15ea90f61dce71e23456bf","infoHashBuffer":{"type":"Buffer","data":[119,110,66,133,57,181,66,97,158,21,234,144,246,29,206,113,226,52,86,191]},"announce":[],"urlList":[]}}