{"title":"Pink-Get The Party Started(2001)(DVD Rip)-Wushan.avi","uid":4900101,"size":121096910,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7907d8af463c02fc0ea316bb609690573693def1&amp;dn=Pink-Get+The+Party+Started%282001%29%28DVD+Rip%29-Wushan.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wushan","files":1,"time":1242571080,"description":"                               Get the Party Started\n                                   \n                                   Single by Pink\n\n                            from the album Missundaztood\n\n\n   Get the Party Started&quot; is a song by Pink, and was the first single from her second album, Missundaztood (2001). It became an international hit and reached the top ten in many countries.\n\n   The song was written by former 4 Non Blondes frontwoman Linda Perry. She said that the process of making the song was &quot;so unlike me&quot;; according to her, she was going through a &quot;weird phase&quot; during which she wanted to learn how to program drums.\n\n   It reached number four on the U.S. Billboard Hot 100 on December 18, 2001, becoming Pink's second biggest solo hit in the U.S. with &quot;Most Girls&quot; also reaching number four on the Billboard Hot 100 in 2000 and &quot;So What&quot; reaching number one in 2008.\n\n   &quot;Get the Party Started&quot; was certified gold in Australia, Austria, Germany, Sweden and Switzerland, and in Norway it received a platinum certification.\n\n   In the video Pink is showering and getting ready to go out, trying on different outfits. One of her friends picks her up, and they drive in a car bobbing their heads to the music. However, the car breaks down. They get out of the car and steal two skateboards from two boys, after which Pink falls off her skateboard because men in a car are whistling at her. The women arrive at the club but are refused entry by the bodyguard, so to get in they use a window washing platform to reach the top of the building. Inside the club the bartender is played by Linda Perry. Pink changes her clothes and starts to party....\n\n    The video was nominated at the 2002 MTV Video Music Awards for &quot;Best Pop Video&quot; and won the awards for &quot;Best Female Video&quot; and &quot;Best Dance Video&quot;.\n\n\n                           ***Get the Party Started.***\n\n\n                                     Enjoy!!!","torrent":{"xt":"urn:btih:7907d8af463c02fc0ea316bb609690573693def1","amp;dn":"Pink-Get+The+Party+Started%282001%29%28DVD+Rip%29-Wushan.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7907d8af463c02fc0ea316bb609690573693def1","infoHashBuffer":{"type":"Buffer","data":[121,7,216,175,70,60,2,252,14,163,22,187,96,150,144,87,54,147,222,241]},"announce":[],"urlList":[]}}