{"title":"[ExploitedCollegeGirls] Samantha XXX 480p UCLA December 12, 2015","uid":13512707,"size":850554231,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:79266477304fd8cfc50d6d947027e59f2cdf03f9&amp;dn=%5BExploitedCollegeGirls%5D+Samantha+XXX+480p+UCLA+December+12%2C+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1455301178,"description":"Size: 850554231 bytes (811.15 MiB), duration: 00:57:54, avg.bitrate: 1959 kb/s\r\nAudio: wmav2, 44100 Hz, stereo, 96 kb/s\r\nVideo: wmv3, yuv420p, 768x432, 1848 kb/s, 29.97 fps\r\n\r\n\r\nIf you aren't into big, bouncy, natural D cup titties on a leggy 21 year old nympho, Samantha is just not the girl for you. If she is, stay tuned as I welcome this foxy astronomy student from UCLA to the site. After looking back at previous girls I can say that she has, hands down, the best titties I've ever featured on the site. Samantha is an extremely sexual girl and it's refreshing as hell. When we are talking she checks all the boxes, she's like, &quot;oh yeah I love to get fucked, I masturbate every day, I know how to get myself off, I love banging girls&quot;; basically &quot;Yes, I'm a nympho.&quot; You can tell how sexual she is by the way her face lights up when I pull out the Rabbit, or after the first time she cums and she moans to me, &quot;I want you to fuck me.&quot; or when I'm fucking her face down and I fish hook her and she just grinds into it.\r\nAs we are talking I can barely concentrate on the conversation, knowing what's under the innocent dress she's selected so I have her pull the top off to show off her huge, almost perfect tits. Just wow. Since she's gone this far, I have her strip it off completely. She shows me her neon pink panties and remarks that she's managed to give herself the perfect shave and pulls her thong to the side to show me. I notice that her pussy is already wet before we've really even started. That is when you know a girl is going to be a dynamo on camera! I can't resist and when I see that bare, wet pussy I go right at it with my fingers and she jumps in to help, spreading her pussy lips and rubbing her clit while I finger her.\r\nAfter I give her one orgasm by toying and fingering with her pussy, she's begging me to fuck her, but before I do I want her to suck my cock. Now most often really hot girls aren't great at giving head, but this girl is different. She's got great technique. She can deep throat, plenty of licking and spit, and great hand action. Her head skills are as great as her tits. Once I'm hard, though, I want to get at that pussy.\r\nI have Samantha lay on her back and she throws her legs in the air for me like an invitation. She's still wet from the Rabbit and I slide my entire cock right in. Watching those titties bounce is magical, big 21 year old D cups jiggling with each thrust? It's scenes like this that make my job as rewarding as it is. She really knows how to fuck, the entire time her hips are bucking and she's got her hand between her legs rubbing her clit as I drill her. I flip her over and drill that booty doggy style and then I push her face down and pound her flat into the bed. When I finally get her into reverse cowgirl I can barely hold out much longer so I have her grab some floor for a monster facial.\r\nAll in all, this turned out to be a great session. It's not an orgasm marathon like with some girls, but it's great to get a girl in here with a perfect 10 body, who really knows how to fuck and isn't shy about pleasing herself","torrent":{"xt":"urn:btih:79266477304fd8cfc50d6d947027e59f2cdf03f9","amp;dn":"%5BExploitedCollegeGirls%5D+Samantha+XXX+480p+UCLA+December+12%2C+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79266477304fd8cfc50d6d947027e59f2cdf03f9","infoHashBuffer":{"type":"Buffer","data":[121,38,100,119,48,79,216,207,197,13,109,148,112,39,229,159,44,223,3,249]},"announce":[],"urlList":[]}}