{"title":"Writing Deep Scenes - Martha Alderson","uid":12969983,"size":749064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79c0435cb22c6ff1e7f72bae1f5d987cf8d9b37c&amp;dn=Writing+Deep+Scenes+-+Martha+Alderson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":2,"time":1449934680,"description":"Take a Deep Dive into Plot and Scene and Improve Your Writing\r\n\r\nWhether you're planning your first novel or have already written a first draft, you need to master the concepts of plot and scene to truly realize your story's potential. Writing Deep Scenes teaches you how to write strong, layered, and engaging scenes--the secret to memorable, page-turning plots. It's filled with practical tools for building layers and nuance into your scenes, employing the right scene types at the right junctures, and developing a profound understanding of how plot and scene intertwine.\r\n\r\nInside you'll learn:\r\n\r\nHow scenes are comprised of three key layers: action, emotion, and theme.\r\nHow to recognize each layer and weave them seamlessly into a scene.\r\nHow to develop an intricate relationship between the action and emotion in every scene.\r\nHow thematic imagery embedded in scenes increases a story's tension and contributes to the story's meaning.\r\nUsing contemporary examples from a variety of genres, Writing Deep Scenes provides an effective method for plotting at the scene level. Use these techniques and enrich your fiction and memoirs with page-turning suspense and pathos, and explore new depths in every story you write","torrent":{"xt":"urn:btih:79c0435cb22c6ff1e7f72bae1f5d987cf8d9b37c","amp;dn":"Writing+Deep+Scenes+-+Martha+Alderson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c0435cb22c6ff1e7f72bae1f5d987cf8d9b37c","infoHashBuffer":{"type":"Buffer","data":[121,192,67,92,178,44,111,241,231,247,43,174,31,93,152,124,248,217,179,124]},"announce":[],"urlList":[]}}