{"title":"*WARNING* GAY PORN : Brent Fucks Logan (CorbinFisher.com)","uid":3506688,"size":234381348,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:79d31aa30ed2439be30f342964ccaf7291f598e4&amp;dn=%2AWARNING%2A+GAY+PORN+%3A+Brent+Fucks+Logan+%28CorbinFisher.com%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mass21","files":1,"time":1153752911,"description":"\n=========================================================================\n\n\n\n..######......###....##....##....########...#######..########..##....##\n.##....##....##.##....##..##.....##.....##.##.....##.##.....##.###...##\n.##.........##...##....####......##.....##.##.....##.##.....##.####..##\n.##...####.##.....##....##.......########..##.....##.########..##.##.##\n.##....##..#########....##.......##........##.....##.##...##...##..####\n.##....##..##.....##....##.......##........##.....##.##....##..##...###\n..######...##.....##....##.......##.........#######..##.....##.##....##\n\n\n*** WARNING ***\n\nIf you dont like gay people OR gay porn.. why the fuck did you click this link? Go the fuck away...\n\n\n\n=========================================================================\n\n\n\n(((((((((( Brent Fucks Logan ))))))))))\n\n\nThe CF Education encompasses many things. Most of you are aware of the &quot;Introducing straight men to the idea and then pleasures of gay sex&quot;. They&amp;#039;ve never really even considered it until we presented the idea to them, and find themselves progressing through their education and thoroughly enjoying the sensations it brings. There&amp;#039;s an entirely different curriculum as well, though. Some guys arrive curious about sex with another man, but have not yet been fortunate enough to try it or able to do it. And so we offer up a way to do it and discover what has been in the back of their mind as something they&amp;#039;ve wanted to try, and see them blossom before our eyes on camera. It&amp;#039;s all just amazing to film and watch! \n\nBrent was one of those curious guys, who openly admitted when we started to shoot this scene that he&amp;#039;d thought about doing stuff with another guy but not yet had the opportunity to act on that. Well, you damn well know I was going to give him that opportunity! From the moment I first laid eyes on him I immediately and severely wanted to see him with another guy. Physically, he&amp;#039;s stunning! And that big dick of his was practically made to plunge in to another young stud&amp;#039;s ass! I&amp;#039;d have done all I could to arrange such a scene regardless, but that he&amp;#039;d contemplated fiddling about with another guy and was more than grateful for the opportunity to do so made it all so exciting! \n\nLogan&amp;#039;s really come to discover how great it feels to have a dick inside you. It&amp;#039;s a little secret some of us gay men have known for awhile, and it&amp;#039;s such a thrill to share that secret with straight studs. I must say... I think I live vicariously through Logan at times because whenever I see a new models&amp;#039; cock or convince a new model to try guy-guy sex for the first time, Logan&amp;#039;s one of the first partner candidates that pops in to my head. Every time he bottoms, he discovers new ways in which it feels good and, I think, continues to be blown away himself by the pleasure such an act is capable of delivering! \n\nSo with a new, curious model with a hot, angled 8-incher and a veteran CF instructor who appreciates intense pleasure when he feels it, pairing up Brent and Logan was such a natural step. And the action that followed was hot as all hell! \n\n==========================\n\nkeywords: Corbin Fisher Gay Porn Fuck Cum Suck Cock Dick","torrent":{"xt":"urn:btih:79d31aa30ed2439be30f342964ccaf7291f598e4","amp;dn":"%2AWARNING%2A+GAY+PORN+%3A+Brent+Fucks+Logan+%28CorbinFisher.com%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d31aa30ed2439be30f342964ccaf7291f598e4","infoHashBuffer":{"type":"Buffer","data":[121,211,26,163,14,210,67,155,227,15,52,41,100,204,175,114,145,245,152,228]},"announce":[],"urlList":[]}}