{"title":"Dump 'Em: How to Break Up with Anyone from Your Best Friend to ","uid":6238718,"size":13046654,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a9ba64afc3376ff88269328db6600049f01d58e&amp;dn=Dump+%5C%27Em%3A+How+to+Break+Up+with+Anyone+from+Your+Best+Friend+to+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":4,"time":1299973495,"description":" &lt;a href=&quot;http://img861.imageshack.us/img861/5240/manteshwer.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img861.imageshack.us/img861/5240/manteshwer.jpg&lt;/a&gt;\n\n\n\n\n\nDump 'Em: How to Break Up with Anyone from Your Best Friend to Your Hairdresser\n\n\nPublisher: Collins Living \nJODYNE L. SPEYER\nEnglish\n2009-04-01 \n304 Pages \nISBN: 0061646628 \nPDF \n12.3 MB\n\n\nThere's a fine line between house guest and house pest, your best friend and your worst enemy, and it's important to know when those relationships have passed the point of no return. These platonic relationships are just as significant, often taking up more time both literally and emotionally, than romantic ones. So what happens when the honeymoon is over and these relationships turn sour? We've been given an arsenal of advice to help navigate the romantic break up, and yet, no one has told us how to break up with those other people in our lives - until now. Delivering a mix of humour and prescriptive advice, Jodyne Speyer has arrived to put us out of our misery, and teach us how to speak up, once and for all.\n\n&quot;Dump 'Em&quot; will give us the tools we need to end all of our unwanted relationships, guiding us through every stage, from recognising the warning signs of when we should dump someone, to telling us just what to say (and what not to say) when the dumping gets tough, all the while teaching us to master the art of the break up. Each chapter uses clever sidebars filled with useful tips, facts and anecdotes, and will also feature 'personality types' for us to try out when ending a relationship. The chapters will also include expert advice for each situation; for example, Sarah Silverman will tell us exactly how to dump a member of your family, Kato Kaelin will discuss the best ways to go about dumping your houseguest, and Thomas Mesereau (who represented Michael Jackson, Robert Blake, among others) chimes in on how to dump your lawyer..................\n\n\n","torrent":{"xt":"urn:btih:7a9ba64afc3376ff88269328db6600049f01d58e","amp;dn":"Dump+%5C%27Em%3A+How+to+Break+Up+with+Anyone+from+Your+Best+Friend+to+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a9ba64afc3376ff88269328db6600049f01d58e","infoHashBuffer":{"type":"Buffer","data":[122,155,166,74,252,51,118,255,136,38,147,40,219,102,0,4,159,1,213,142]},"announce":[],"urlList":[]}}