{"title":"Halo.Reach.PROPER.PAL.RF.XBOX360-BMP","uid":5871358,"size":7839219270,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:7ac08e522c47b6088cfded2ac79bbeba8beac574&amp;dn=Halo.Reach.PROPER.PAL.RF.XBOX360-BMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Riskaka","files":4,"time":1286463561,"description":"\n\nIn &quot;Halo: Reach,&quot; players experience the fateful moments that forged the &quot;Halo&quot; legend. It's the story of Noble Team, a squad of heroic Spartan soldiers, and their final stand on planet Reach, humanity's last line of defense between the terrifying Covenant and Earth. This darker story is echoed by grittier visuals amid a backdrop of massive, awe-inspiring environments. Characters, enemies and environments are rendered in amazing detail by an all-new engine designed to deliver epic-scale encounters against the cunning and ruthless Covenant.\n\n    * Meet Noble Team. For the first time, players will fight alongside a squad of iconic Spartan soldiers, each with deadly talents as unique as their individual personalities and customized gear.\n    * An intense campaign. Live the events that set the stage for the &quot;Halo&quot; trilogy as the UNSC and Covenant clash at the height of their military power. New weapons and abilities complement the familiar &quot;Halo&quot; arsenal for the largest-scale battles ever witnessed in the &quot;Halo&quot; universe. Fiercely cunning artificial intelligence (AI) adds depth and complexity to each encounter, helping make every play-through a unique and epic experience.\n    * Stunning technical advancements. &quot;Halo: Reach&quot; takes a massive leap forward through all-new engine technology designed to take full advantage of next-generation graphics, audio, special effects, AI and animation while continuing to expand on the campaign, cooperative and multiplayer sandbox in a way that only &quot;Halo&quot; can.\n    * The definitive multiplayer experience. &quot;Halo: Reach&quot; builds on the success of its predecessors, setting a new standard for competitive gameplay, customization, variety and community integration.1\n    * Unparalleled feature suite. &quot;Halo: Reach&quot; expands on the industry-leading suite of features found in &quot;Halo 3,&quot; including four-player cooperative campaign play, split-screen support, saved films, screenshots and exciting new surprises that have yet to be revealed.\n\n","torrent":{"xt":"urn:btih:7ac08e522c47b6088cfded2ac79bbeba8beac574","amp;dn":"Halo.Reach.PROPER.PAL.RF.XBOX360-BMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac08e522c47b6088cfded2ac79bbeba8beac574","infoHashBuffer":{"type":"Buffer","data":[122,192,142,82,44,71,182,8,140,253,237,42,199,155,190,186,139,234,197,116]},"announce":[],"urlList":[]}}