{"title":"Dear Doctor John, Where's My Bible? - Herbert Evans","uid":11773447,"size":224075,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7acf58d7142482db88423e3b4f1850c817698990&amp;dn=Dear+Doctor+John%2C+Where%27s+My+Bible%3F+-+Herbert+Evans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168319,"description":"\nThis pamphlet is a reproduction of a written dispute between John R. Rice and a layman Christian because of an article in the December 15, 1972 Sword of the Lord. It is reproduced with the conviction that truly born again Bible believers, led by the Holy Spirit, have the ability to judge rightly, when Bible issues are brought before them. Only the original correspondence is duplicated and that without biased comments. You dear readers are the judges. The intent of the pamphlet is to expose the NASV, ASV, and RV (a rose by any other name) translations as corrupt translations and also to present a case for the Authorized Bible (King James) being the infallible Word of God. It is noteworthy that, to the date of printing, my last letter and telegram to Dr. Rice have not been answered.\n\n?It is always a great blessing to hear the same view?point from a cool, calculated, legal objective angle. --Dr. Peter S. Ruckman\n\n?It certainly is a superb way in which you have handled this whole situation. I don?t see how Dr. Rice has a leg to stand on . . . I never knew how quickly you can tie people in knots when it comes to the inerrant, infallibility of the Word of God.? --David Otis Fuller","torrent":{"xt":"urn:btih:7acf58d7142482db88423e3b4f1850c817698990","amp;dn":"Dear+Doctor+John%2C+Where%27s+My+Bible%3F+-+Herbert+Evans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7acf58d7142482db88423e3b4f1850c817698990","infoHashBuffer":{"type":"Buffer","data":[122,207,88,215,20,36,130,219,136,66,62,59,79,24,80,200,23,105,137,144]},"announce":[],"urlList":[]}}