{"title":"Gape Lovers #7  (2011)","uid":6917891,"size":15093528576,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7b80ed811566b126d96c4f0ec97f3d82c7aea5a4&amp;dn=Gape+Lovers+%237++%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":113,"time":1325096226,"description":" &lt;a href=&quot;http://sharezones.biz/view.php?filename=8621937KLKNSA.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://sharezones.biz/view.php?filename=8621937KLKNSA.jpg&lt;/a&gt;\n\n\nKagney Linn Karter, Anita Hengher , Hotkinkyjo, Brooklyn Lee, Asa Akira, Jessie Volt, Britney Stevens, Darla Crane, Sean Michaels, Roxy Raye , Jayda Diamonde\n\n\nCalling fans of filthy butt sex and sick rim jobs: Anal artist Jay Sin has outdone himself with the insane asshole antics in the double-disc &quot;Gape Lovers 7.&quot; It's subtitled, &quot;The Roses Are Blooming,&quot; a reference to the graphic, prolapsing bungholes his flexible ass sluts display by way of enormous toys, tongues and four or more fingers at a time. First, skinny beauty Hotkinkyjo and curvy Anita Hengher - both huge anal gapers - fart at will, &quot;exhaling&quot; percussively from their whistling, cavernous assholes, the sound amplified with a microphone in a crazy display of rectal beat-boxing! Next, foxy blonde Jessie Volt and tattooed Asian ass whore Asa Akira open each other up with a wide dildo and some gooey, slobbery analingus. Two blondes, Latina Brooklyn Lee and stacked Kagney Linn Karter, have a &quot;no boys allowed&quot; butthole-slurping session. Mature, busty redhead Darla Crane shows off the class work of her &quot;A&quot; student, Britney Stevens, using toys and golf balls and licking Britney's protruding colon. They go to work on Professor Sean Michaels, each sucking his black cock ass-to-mouth while he cornholes the other. Finally, baby-faced anal acrobats Roxy Raye and Jayda Diamonde use monster dildos to turn each other's asshole literally inside out. The lewd ladies actually push their blossoming, red intestines against one another's in a bizarre scene that might be a medical first. Roxy expels a messy milk enema with her spreading guts, and Jayda licks the fleshy anal fondue! &quot;Gape Lovers 7&quot; is a feast for the rectally extreme!","torrent":{"xt":"urn:btih:7b80ed811566b126d96c4f0ec97f3d82c7aea5a4","amp;dn":"Gape+Lovers+%237++%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b80ed811566b126d96c4f0ec97f3d82c7aea5a4","infoHashBuffer":{"type":"Buffer","data":[123,128,237,129,21,102,177,38,217,108,79,14,201,127,61,130,199,174,165,164]},"announce":[],"urlList":[]}}