{"title":"penn foster locksmith.rar","uid":3983868,"size":20107354,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7cc2415e46b8ef3ca1404481cfd71e9c6cc37cdf&amp;dn=penn+foster+locksmith.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"techguy41","files":1,"time":1200699640,"description":"# Instruction Set 1\n\n    * Learning Strategies\n          o The advantages of learning at home; types of study materials; types of examinations; accessing and using the features of our website; determining what kind of learner you are; establishing a study schedule; using study tips; preparing for and taking examinations.\n    * Locksmithing: An Expanding Career Field\n          o Definition of locksmithing and the security industry; how the locksmith can help fight crime; employment opportunities; qualifications for professional locksmiths.\n\n\n# Instruction Set 2\n\n    * Introduction to Locks and Keys\n          o Basic types of lock mechanisms; basic key types and their parts; typical locksmithing tasks; standard and specialized tools used by locksmiths.\n    * Key Identification\n          o Basic types of keys and their parts; how keys are duplicated; distinctive key characteristics; how to compare an original key to a blank; how to find key blanks in a key catalog.\n    * Practical Exercise: Identifying Keys\n    * Lock Mechanisms\n          o Construction and operation of warded locks, lever locks, disk tumbler locks, and pin tumbler locks; padlock construction and operation; how combination locks work.\n    * Supplement: Locksmithing Glossary\n    * Learning Aids:\n          o Assorted key blanks\n          o Lever Tumbler lock\n          o Disk Tumbler lock\n          o PapaizÃ‚Â® Cutaway Padlock\n\n\n# Instruction Set 3\n\n    * Residential Locks\n          o The mortise lock and the rib lock; operation of key-in-knob locks and tubular deadbolts; installation steps for key-in-knob locks, deadbolts, rim locks, and other door locks.\n    * Keymaking and Rekeying\n          o Key duplication by hand and by machine; how to duplicate cylinder keys, flat keys, and bit keys; rekeying locks.\n    * Practical Exercises:\n          o Duplicating a key by hand\n          o Rekeying the KwiksetÃ‚Â® door lock\n    * Supplement: Using Tools Safely\n    * Learning Aids:\n          o Files\n          o Bench vise\n          o KwiksetÃ‚Â® door lock\n          o KwiksetÃ‚Â® pinning kit\n\n\n# Instruction Set 4\n\n    * Opening Locks Without Keys\n          o Various methods of opening locks without keys; lockpicking techniques; reading a lock; impressioning keys; forcing a lock open using emergency techniques.\n    * Home and Business Security\n          o Security in retail and industrial settings; &quot;target hardening&quot; techniques; improving security in home and business settings; performing a security analysis.\n    * Practical Exercises:\n          o Impressioning a Key for a Mortise Cylinder\n          o Shimming Open and Rekeying the Mortise Cylinder\n    * Learning Aids:\n          o Lockpicks\n          o Tension wrench\n          o Mortise cylinder\n          o Shims\n          o Screwdriver set\n\n# Instruction Set 5\n\n    * Auto Locks\n          o Basic auto lock mechanisms; replacing lock cylinders in doors, ignitions, and trunks; troubleshooting of and servicing of auto lock cylinders; electronic security devices for auto protection.\n    * Safes and Vaults\n          o Basic safe construction; combination lock theory; basic safe maintenance and repair techniques; changing safe combinations; making keys for safe deposit boxes.\n    * Panic Hardware and Electric Locks\n          o Basic types of panic hardware devices; installing panic hardware; repairing and troubleshooting panic hardware; basic electricity for locksmiths; installation of electric locks.\n    * Learning Aid: Master combination padlock \n\n\n# Instruction Set 6\n\n    * Electronic Security\n          o Basic types of alarm systems; alarm components; designing an alarm system for a customers use; troubleshooting and programming an alarm system.\n    * Starting a Small Business\n          o Creating a business plan; obtaining finances; obtaining needed insurance; necessary permits and licenses; finding a location; setting up your shop; purchasing office equipment and supplies; keeping business records.\n    * Working as a Professional Locksmith\n          o Determining what services to offer and what to charge; evaluating your competition and targeting your customers; setting an advertising budget; legal issues and locksmithing ethics; bonding and licensing; how to look and act like a professional.\n    * Supplement: Starting a Mobile Business \n\n","torrent":{"xt":"urn:btih:7cc2415e46b8ef3ca1404481cfd71e9c6cc37cdf","amp;dn":"penn+foster+locksmith.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cc2415e46b8ef3ca1404481cfd71e9c6cc37cdf","infoHashBuffer":{"type":"Buffer","data":[124,194,65,94,70,184,239,60,161,64,68,129,207,215,30,156,108,195,124,223]},"announce":[],"urlList":[]}}