{"title":"[2002] Understanding Marijuana - A New Look at the Scientific Ev","uid":9502462,"size":1082791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7db5c421d9682e81d01b80d16544cf157f07e107&amp;dn=%5B2002%5D+Understanding+Marijuana+-+A+New+Look+at+the+Scientific+Ev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"seering","files":1,"time":1390249949,"description":"Marijuana is the world's most popular illicit drug, with hundreds of millions of regular users worldwide. One in three Americans has smoked pot at least once. The Drug Enforcement Agency estimates that Americans smoke five million pounds of marijuana each year. And yet marijuana remains largely misunderstood by both its advocates and its detractors.\n\nTo some, marijuana is an insidious &quot;stepping-stone&quot; drug, enticing the inexperienced and paving the way to the inevitable abuse of harder drugs. To others, medical marijuana is an organic means of easing the discomfort or stimulating the appetite of the gravely ill. Others still view marijuana, like alcohol, as a largely harmless indulgence, dangerous only when used immoderately. All sides of the debate have appropriated the scientific evidence on marijuana to satisfy their claims. What then are we to make of these conflicting portrayals of a drug with historical origins dating back to 8,000 B.C.? \n\nUnderstanding Marijuana examines the biological, psychological, and societal impact of this controversial substance. What are the effects, for mind and body, of long-term use? Are smokers of marijuana more likely than non-users to abuse cocaine and heroine? What effect has the increasing potency of marijuana in recent years had on users and on use? Does our current legal policy toward marijuana make sense? Earleywine separates science from opinion to show how marijuana defies easy dichotomies. Tracing the medical and political debates surrounding marijuana in a balanced, objective fashion, this book will be the definitive primer on our most controversial and widely used illicit substance.","torrent":{"xt":"urn:btih:7db5c421d9682e81d01b80d16544cf157f07e107","amp;dn":"%5B2002%5D+Understanding+Marijuana+-+A+New+Look+at+the+Scientific+Ev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db5c421d9682e81d01b80d16544cf157f07e107","infoHashBuffer":{"type":"Buffer","data":[125,181,196,33,217,104,46,129,208,27,128,209,101,68,207,21,127,7,225,7]},"announce":[],"urlList":[]}}