{"title":"Johanna Juhola - Fantasiatango 2010","uid":6877955,"size":334070444,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e17ab1b2df627b0605f15c2be42b2ff0c8ee341&amp;dn=Johanna+Juhola+-+Fantasiatango+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1323528224,"description":"Tens of millions of TV viewers saw Johanna Juhola play the song Fantasiatango as an opener for Eurovision song contest 2007 in Helsinki. Fantasiatango is also title of Johannas second solo album released in February 2010 and it describes very well the style of the music, which is completely composed by Johanna herself.\n\nBesides Tango Nuevo, electronica plays a big role in Johanna's music because the two latest albums Fantasiatango and Tango Roto Live, have been produced and mixed by internationally acclaimed music producer Tuomas Norvio, who has also worked with f. ex. Wimme and Rinneradio. Tuomas has done all the album programming and he also plays live electronics in Johanna Juhola Reaktori. The other musicians are a double bass queen Sara Puljula and a harmonium innovator Milla Viljamaa.\nReaktori offers a mix of ingredients from these four exuberant musicians. Juhola is in charge of the compositions, but the players' characteristics can be heard in the arrangements. The mood shifts from chamber musical folk tones to offbeat electronic music or from a celebration of naivism to virtuosic excitement.\nThe other band playing Johannas music is Johanna Juhola Trio with an virtuoso guitarist Roope Aarnio and a sound designer Hannu Oskala who is effecting Roopes and Johannas sounds and playing samples.\n\nMany of Johannas songs have originally been composed for theatre, so they are certain kind of short stories. About limping man, who created an unique tango dancing style, about the last of the coyotes, the stressful modern communication speed, jealousy and about band mates with whom is possible to make musical dreams come true.\n\nJuhola shows that accordion isn't only just an old-fashioned instrument. She surfs fluently from modern folk music to tango, classical, jazz and even pop and combines time-tied musical phenomena into her own, forward-oriented style. (womex.com)\n\n- - -\n\nThanks to this naughty innovator, the tango's lifespan has been extended by at least another century.\n(Ton Maas, Ode Magazine kevÃƒÂ¤t 2011)\n\nJohanna Juhola has been called one of the most interesting innovators of accordion music in Finland.\n(Saara Pakarinen, Me Naiset magazine, March 2010)\n\nThe music reminds me of Edward Scissorhands, amusement parks, Buenos Aires tango halls, dark conifer forests and Pippi Longstocking in a toy store. With enough skill rules can be broken imaginatively.\n(Risto Haapsamo, Kaleva 25.2.2010.)\n\n- - -\n\nJohanna Juhola - Fantasiatango 2010\n(Texicalli Records)\n\n 1. Ontuvan jalan tango (Limping foot tango)\n 2. Viimeinen kojootti (The last of the coyotes)\n 3. Fantasiatango (Fantasy tango)\n 4. KeskikesÃƒÂ¤n karkelo (A midsummer's feast)\n 5. Ullakon asukkaat (Attic inhabitants)\n 6. Carlos\n 7. Tango-san\n 8. Downshifting\n 9. Happihumppa (Oxygen humppa)\n10. Tango 4\n11. Matkailu avartaa (Travel broadens the mind)\n","torrent":{"xt":"urn:btih:7e17ab1b2df627b0605f15c2be42b2ff0c8ee341","amp;dn":"Johanna+Juhola+-+Fantasiatango+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e17ab1b2df627b0605f15c2be42b2ff0c8ee341","infoHashBuffer":{"type":"Buffer","data":[126,23,171,27,45,246,39,176,96,95,21,194,190,66,178,255,12,142,227,65]},"announce":[],"urlList":[]}}