{"title":"Hitchcock Collection - Family Plot (1976) (MULTI) 2Lions-Team","uid":5638663,"size":4682970806,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7e1ede1be08dc77fc7e2fc7cf0a8093027343c4d&amp;dn=Hitchcock+Collection+-+Family+Plot+%281976%29+%28MULTI%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1276990915,"description":"Hitchcock Collection - Family Plot (1976)       \n\n \nVerenigde Staten\nMisdaad / Komedie\n120 minuten\n\ngeregisseerd door Alfred Hitchcock\nmet Karen Black, Bruce Dern en Barbara Harris\n\nNep-medium Blanche wordt door een rijke, oude dame ingehuurd om haar ter adoptie afgestane neefje te vinden. De dame heeft gewetenswroeging gekregen en wil het verdwenen familielid opnemen in haar testament. Blanche wordt bijgestaan door haar vriendje en taxichauffeur George die in zijn vrije tijd detective speelt. Ondertussen ontvoert een ander stel met succes rijke en bekende mensen, die in ruil voor bijzondere juwelen hun vrijheid terugkrijgen. Het duurt niet lang tot de paden en de verhalen van beide koppels elkaar kruisen. Hitchcock's laatste film.\n\n \nEnglish\n\nThe trickster Madam Blanche Tyler lures the elder millionaire Julia Rainbird that believes she is a spiritualist. After a sÃƒÂ©ance, she discovers that Julia is tormented by her past, when she forced her sister and single mother Harriet to deliver her baby for adoption to avoid a family scandal. Julia promises the small fortune of ten thousand-dollar to Blanche if she finds her nephew and heir of her fortune using her phony powers. Blanche asks her boyfriend George Lumley, who is an unemployed actor working as cab driver, to investigate the whereabouts of Julia's nephew. Meanwhile, the greedy jeweler and collector Arthur Adamson kidnaps wealthy people with his girlfriend Fran to increase his collection of diamonds with the ransom. When George concludes that Arthur Adamson might be the heir of Julia Rainbird, the reckless Blanche gets in trouble with the kidnappers. \n\n \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nAudio : English, German,\nSusbs : English, Dutch, German, Swedish, Danish, Norwegian, Finnish\nMenu : Yes\nCover : Yes\n \nGenre : Misdaad\nMysterie\nThriller \n\nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/1125&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/1125&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0074512&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0074512&lt;/a&gt;\n\n*****************************************\n\nBrought to you by \nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!","torrent":{"xt":"urn:btih:7e1ede1be08dc77fc7e2fc7cf0a8093027343c4d","amp;dn":"Hitchcock+Collection+-+Family+Plot+%281976%29+%28MULTI%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e1ede1be08dc77fc7e2fc7cf0a8093027343c4d","infoHashBuffer":{"type":"Buffer","data":[126,30,222,27,224,141,199,127,199,226,252,124,240,168,9,48,39,52,60,77]},"announce":[],"urlList":[]}}