{"title":"Twisted by Knives by Charlotte Shelby (If I did it William Desmo","uid":9483012,"size":37427738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e2e5d747929c0e68b3020a63acc209617afc44e&amp;dn=Twisted+by+Knives+by+Charlotte+Shelby+%28If+I+did+it+William+Desmo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1389836255,"description":"In 1922 popular silent film director William Desmond Taylor was murdered.  Allegations ran that maybe two pretty starlets were involved (Mabel Normand, Mary Miles Minter) or his butler Peavy.  To this day it remains one of the most perplexing unsolved murders and mysteries.  It was a major story in the 1920s and dragged on well into the 1940s.  No one was ever charged with his murder and it remains officially unsolved.\n\nIn the 1940s, using the alias Pearl Miles Riley, Mary Miles Minter's mother, Charlotte Shelby wrote as one film historian put it &quot;Her own OJ If I did it.&quot;  When asked why he said he suspected she needed the money and thought it would help her as she was already elderly.\n\nLike OJ her own If I did it (Twisted by Knaves) was poorly written, had spelling errors and was so clumsy in trying to be fiction it basically amounted to a confession.  But for many years no one knew the document existed.  Charlotte died in 1957 and Mary died in the 1980s, never fully giving her story though it was thought many in Hollywood (including her) knew Charlotte had killed Desmond because he and Mary planned to marry, ruining her meal ticket.\n\nOne couple had a possession of the full manuscript and were obsessed with the Taylor case.  In their version (last seen in the 1970s) Charlotte admitted to killing Taylor in great detail.  Unfortunately this version (the only currently available version) is 'missing that one key page'.\n\nBetween helpful annotations and writings of its adapter, Douglas Bell, is Charlotte's manuscript.  This will be the definitive book on the William Desmond Taylor case, and very well may have solved the mystery of who the murderer was.","torrent":{"xt":"urn:btih:7e2e5d747929c0e68b3020a63acc209617afc44e","amp;dn":"Twisted+by+Knives+by+Charlotte+Shelby+%28If+I+did+it+William+Desmo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e2e5d747929c0e68b3020a63acc209617afc44e","infoHashBuffer":{"type":"Buffer","data":[126,46,93,116,121,41,192,230,139,48,32,166,58,204,32,150,23,175,196,78]},"announce":[],"urlList":[]}}