{"title":"Chip - April 2007","uid":3671299,"size":24912424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e9d33481d29764c3353f519768a8d5eb522087a&amp;dn=Chip+-+April+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hedkandi1","files":3,"time":1177339308,"description":"Verruim je blikveld \n\nRaak je regelmatig het overzicht over je werkzaamheden kwijt omdat het scherm van je 17-inch monitor met allerlei vensters gevuld is? Door een tweede 17-inch monitor op de videokaart aan te sluiten, verdubbel je het werkoppervlak. Wij laten zien hoe je de twee schermen aansluit en correct instelt.\n\n\n\n\n\nTest: videomontagesoftware \n\nDe nieuwe videoprogramma&amp;#039;s moeten allerlei formaten en opslagmedia ondersteunen en toch eenvoudig bedienbaar blijven. Zelfs iemand die zijn videocamera sporadisch uit de tas haalt, moet ermee kunnen werken. In deze test kijken we of de geteste programma&amp;#039;s aan de gestelde voorwaarden voldoen.\n\n\n\n\n\nTools voor je usb-stick\n\nMaak van een normale usb-stick een multifunctionele tool. Een dure U3-stick is helemaal niet nodig. Het is heel gemakkelijk: neem een usb-stick, pak een van de CHIP-pakketten hierop uit en je hebt een geniale tool voor elke Windows-pc.\n\n\n\n\n\nDigitale tv &amp;#039;uit de lucht&amp;#039;\n\nHet vertrouwde analoge tv-systeem is inmiddels meer dan vijftig jaar oud. Maar na verschillende verbeteringen, zoals de kleurentelevisie, zijn de mogelijkheden wel zo&amp;#039;n beetje uitgeput. Vandaar dat de analoge etheruitzendingen vorig jaar zijn gestopt. Als je het tv-signaal &amp;#039;uit de lucht&amp;#039; wilt gebruiken wordt het echt tijd voor iets nieuws.\n\n\n\n\n\nVolledige inhoudsopgave\n\n\n\n\n\nActueel\n\n8 Nieuws De laatste ontwikkelingen op het gebied van hardware, software en internet.\n\n16 CHIP-radar In CHIP radar zie je welke audiocodec de beste is en dus de toekomst heeft.\n\n20 Windows Vista Is jouw systeem klaar voor het nieuwe besturingssysteem?\n\n24 Op de CHIP-cd Op de CHIP-cd staat de beste en handigste software.\n\n26 Website-tips\n\n116 CSI: Internet In deze eerste aflevering van CSI: Internet zijn de experts van CHIP een hacker op het spoor die niet eens een beveiligingslek nodig heeft.\n\n\n\n\n\nTest &amp; techniek\n\n28 DVB-T op je pc Analoge etheruitzendingen zijn vorig jaar gestopt. Als je het tv-signaal &amp;#039;uit de lucht&amp;#039; wilt gebruiken wordt het echt tijd voor iets nieuws.\n\n32 De kwaliteit van HDTV De eerste spelers voor Blu-ray en HD-DVD staan eindelijk in de winkel en zelfs HDTV is inmiddels volwassen. Loont het om over te stappen?\n\n40 Verruim je blikveld Met een dual-desktopsysteem werk je overzichtelijker en zien spellen er realistischer uit.\n\n42 Breedband internettarieven Welke provider biedt de meeste bandbreedte voor het minste geld? CHIP zoekt het uit.\n\n62 CHIP-guide voor CPU&amp;#039;s en GPU&amp;#039;s Intel introduceert een nieuwe cpu met vier kernen.\n\n68 DirectX 10: realistische 3D in Vista DirectX 10 belooft een kwantumsprong voorwaarts op het gebied van grafische details en snelheid.\n\n70 Swarm computing Zwermen krijgen voor elkaar wat een individueel dier nooit zou kunnen. De technologie maakt dankbaar gebruik van dit slimme natuurverschijnsel.\n\n76 Videomontagesoftware getest CHIP test montageprogramma&amp;#039;s tot honderd euro.\n\n82 Test: 20 inch tft&amp;#039;s 20-inch-breedbeeldmonitoren bieden 35 procent meer beeldinformatie dan klassieke 19-inch-modellen. CHIP heeft ze getest.\n\n86 Rechtstreeks naar het beste navigatiesysteem CHIP test alle belangrijke merken navigatiesystemen en helpt je om een goede beslissing te nemen als je er een wilt aanschaffen.\n\n90 Toplijsten De beste hardware in overzichtelijke tabellen.\n\n\n\n\n\nPraktijk\n\n94 Freeware Deluxe Onze maandelijkse selectie uit het grote aanbod van de beste gratis software.\n\n98 Tools voor je usb-stick Maak van een normale usb-stick een multifunctionele tool. Een dure U3-stick is helemaal niet nodig.\n\n102 Films opslaan met DivX Author Met DivX Author zet je meerdere films inclusief ondertitels, geluidssporen en menu&amp;#039;s in een DivX-bestand dat je op dvd kunt branden.\n\n106 Tune je wlan-router Met onze tuningtips maak je van je draadloze router een renpaard.\n\n112 Veiligheid: Vista versus XP CHIP vergelijkt de besturingssystemen op hun veiligheid.\n\n118 Tips &amp; trucs Voor Windows, toepassingen, digitale fotografie, internet en hardware.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7e9d33481d29764c3353f519768a8d5eb522087a","amp;dn":"Chip+-+April+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e9d33481d29764c3353f519768a8d5eb522087a","infoHashBuffer":{"type":"Buffer","data":[126,157,51,72,29,41,118,76,51,83,245,25,118,138,141,94,181,34,8,122]},"announce":[],"urlList":[]}}