{"title":"Psy (eng subs) [1992] Wladyslaw Pasikowski","uid":5739525,"size":733826186,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ed5271daa6e2b0838e4794d00ef145e3ee45029&amp;dn=Psy+%28eng+subs%29+%5B1992%5D+Wladyslaw+Pasikowski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1280950111,"description":" &lt;a href=&quot;http://bayimg.com/HAOLeaaCB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/HAOLeaaCB&lt;/a&gt;\n\nPsy (1992) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0105185/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0105185/&lt;/a&gt;\n\nPsy is a Polish crime thriller directed by Wladyslaw Pasikowski. The film was released on November 20, 1992.\n\n Boguslaw Linda ...  Franz Maurer \n Marek Kondrat ...  Olo \n Cezary Pazura ...  Nowy \n Janusz Gajos ...  Gross \n Agnieszka JaskÃƒÂ³lka ...  Angela \n Zbigniew Zapasiewicz ...  Wencel \n Zbigniew Bielski ...  Kaniewski \n Tomasz Dedek ...  Wawro \n Ryszard Fischbach ...  Dziadek \n Marek Frackowiak ...  Kazek \n Tadeusz SzymkÃƒÂ³w ...  Jerzyk \n Jerzy Bonczak ...  Chemik \n Maciej Kozlowski ...  Baranski \n Andrzej Musial ...  Ochocki \n Wojciech Magnuski ...  Jaworski \n\n\n&quot;Psy&quot; translates from Polish into dogs. The English title is &quot;Pigs.&quot; Both titles are intended as slang references to the police.\n\nIn 1990 a group of former Communist Security Service officers after a verification get hired by the police. Franciszek &quot;Franz&quot; Maruer is one of them. His friend, Olgier &quot;Olo&quot; Zwirski, is not. Franz leads a new group of cops from crime unit on an operation against an international crime group. The operation goes wrong when they're attacked by thugs, who - as Franz believes - are also old Security Service officers, like them. He doesn't know which side is Olo on yet.\n\nWhat is 'Dogs' about? 'About a dog's world, about the fact that freedom also engenders filth and stupidity while destroying ideals. Everything has been debased, sullied in mud, thrown into the cesspool,' wrote a reviewer. Such extreme critical reactions were elicited by the film's subject matter and its portrayal of the world as fundamentally castrated of positives and saturated with cynicism, moral dirt and cruelty. A world that is simultaneously hardly abstract, and in fact present in the here and now (i.e. in Poland in 1989), one that is additionally portrayed in an iconoclastic and provocative manner, derisive of all things sacred, be they related to nation or religion. Behind this faÃƒÂ§ade of scoffing and anti-martyrological blasphemies, there was something more - a morality tale, a painful diagnosis of contemporary Poland. Was this 'cinema of immoral anxiety'? Opinions were divided. Only viewers succeeded in 'expressing themselves' clearly, demonstrating their fascination by lining up in front of the box office and rendering 'Dogs' a commercial hit.\n\nPolish cinema went through a relatively quick and much needed transition in the late 80s that mirrored political changes. As Poland became a democratic country the state let go of its monopoly of the film industry and censorship was lifted. This not only gave freedom to Polish movie making but also allowed foreign films to be screened. These new film policies were well received among new audiences who were too young to remember the solidarity movements and became tired of watching movies about it. In a new market economy for film audiences started to choose what they wanted to watch. This meant classic Polish films struggled to capture audiences as foreign Hollywood-like films gained popularity. As some feared the end of Polish cinema others saw it as a chance to catch up with the rest of Europe and the world. It is through the Americanization of a very Polish story that Pigs expresses controversial and previously restricted topics. Issues of political instability with a lack of a real national hero are raised. Inequalities and corruption in the state ranging from a social to personal level are also looked at. Finally large scale criminal activity is recognized as a reality, presented through taboo subtopics of violence, vulgar language and drugs.\n\nPolish Film Festival \n1992  Won Best Actor Boguslaw Linda \n1992  Won Best Director Wladyslaw Pasikowski \n1992  Won Best Editing Zbigniew Nicinski Wanda Zeman \n1992  Won Best Score Michal Lorenc \n1992  Won Best Supporting Actress Agnieszka JaskÃƒÂ³lka \n \n","torrent":{"xt":"urn:btih:7ed5271daa6e2b0838e4794d00ef145e3ee45029","amp;dn":"Psy+%28eng+subs%29+%5B1992%5D+Wladyslaw+Pasikowski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ed5271daa6e2b0838e4794d00ef145e3ee45029","infoHashBuffer":{"type":"Buffer","data":[126,213,39,29,170,110,43,8,56,228,121,77,0,239,20,94,62,228,80,41]},"announce":[],"urlList":[]}}