{"title":"Charles Esdaile - Napoleon's Wars [96] Unabridged","uid":7727875,"size":1134080846,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7fad614305ba532e59a19c745cf811ef8b5501f3&amp;dn=Charles+Esdaile+-+Napoleon%27s+Wars+%5B96%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"rambam1776","files":-1,"time":1350264303,"description":"Charles Esdaile - Napoleon's Wars: An International History, 1803-1815\n\nRead by Simon Prebble; 96 kbps, Unabridged, 20 CDs\n\nOverview\nNo military figure in history has been quite as polarizing as Napoleon Bonaparte. Was he a monster, driven by an endless, ruinous quest for military glory? Or a social and political visionary brought down by petty, reactionary kings of Europe? In the most definitive account to date, respected historian Charles Esdaile argues that the chief motivating factor for Napoleon was his insatiable desire for fame. More than a myth-busting portrait of Napoleon, however, this volume offers a panoramic view of the armed conflicts that spread so quickly out of revolutionary France to countries as remote as Sweden and Egypt. Napoleon's Wars seeks to answer the question, What was it that made the countries of Europe fight one another for so long and with such devastating results? Esdaile portrays the European battles as the consequence of rulers who were willing to take the immense risks of either fighting or supporting Napoleon-risks that resulted in the extinction of entire countries. This is history writing equal to its subject-grand and ambitious.\n\nLibrary Journal\n\nIn direct contrast to Gen. Michel Franceschi and Ben Weider's Wars Against Napoleon: Debunking the Myth of the Napoleonic Wars, which claimed that Napoleon was a pacifistic victim of circumstances, comes a book that makes no attempt to hide his insatiable lust for military glory and, thus, power. Yet Esdaile (history, Univ. of Liverpool; The Peninsular War) does offer a distinct approach by writing a history of these wars that is not simply Francocentric but reflects the full European dimension of the conflicts. So the reader gets not only fresh information on such disparate actions as the Serbian revolt of 1804 and the Eastern and Ottoman fronts but a better understanding of the time period as a whole and Napoleon's historical place in it. Esdaile argues that the Napoleon we see today is the product of a very efficient propaganda machine begun on St. Helena by the emperor himself. Using contemporary sources describing the little Corsican, his resulting myth-busting portrait rings true. Placed within the author's panoramic view of the wars that spread so quickly across the European continent, it's a study that makes a compelling read. Recommended for all libraries.\n\nMeet the Author\nCharles Esdaile is one of Britain's foremost Napoleonic historians. He is professor in history at the University of Liverpool and the author of The Peninsular War: A New History and Spain in the Liberal Age, among other books.","torrent":{"xt":"urn:btih:7fad614305ba532e59a19c745cf811ef8b5501f3","amp;dn":"Charles+Esdaile+-+Napoleon%27s+Wars+%5B96%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fad614305ba532e59a19c745cf811ef8b5501f3","infoHashBuffer":{"type":"Buffer","data":[127,173,97,67,5,186,83,46,89,161,156,116,92,248,17,239,139,85,1,243]},"announce":[],"urlList":[]}}