{"title":"Indiana Jones Collection [BBN][h33t]","uid":4031752,"size":1531615068,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8001c1a3c41835e16e84bbe6a3243ba012085d26&amp;dn=Indiana+Jones+Collection+%5BBBN%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seedYAbastid","files":87,"time":1203202230,"description":"[IMG]http://img166.imageshack.us/img166/135/h33tpresentsss3.gif[/IMG]\n\n[color=dodgerblue][b]Torrent Includes[/b][/color]\n\n[b]Indiana Jones and the Raiders of the Lost Ark[/b] \n\n[b]Indiana Jones and the Temple of Doom[/b] \n\n[b]Marvel Super Special[/b] \n\n[b]Indiana Jones and the Last Crusade[/b] \n\n[b]Further Adventures of Indiana Jones 1-34 (Marvel)[/b]\n[IMG]http://img255.imageshack.us/img255/558/zzzjd9.png[/IMG]\n\n[b]Indiana Jones &amp; The Golden Fleece[/b]\n[IMG]http://img150.imageshack.us/img150/3831/golden1fp4.jpg[/IMG]\n[quote]Writer: Pat McGreal, Dave Rawson\nCover Artist: Russell Walks\nPenciller: Ken Hooper\n\nThis all-new adventure has Indy in the middle of an archeological dig during the World War II German invasion of Greece where he stumbles across an ancient order of mystics who are seeking the fabled Fleece once used by Jason to bring power and prosperity to an empire. When things begin to get dicey, Jones is rescued by Omphale, the strong-willed daughter of a Greek cargo pilot, and by the time Indy figures out what&amp;#039;s going on, he&amp;#039;s got the Turkish secret police, the ancient sect, and the entire German army out to get him and his findings! This action adventure gives our hero one of the most harrowing experiences of his life as he is forced to attempt his escape on... a bicycle!? The plane ride to Istanbul has got to be easier than this![/quote]\n\n[b]Indiana Jones And The Arms Of Gold[/b] \n[IMG]http://img209.imageshack.us/img209/6272/armscj1.jpg[/IMG]\n[quote]Writer: Lee Marrs\nArtist: Leo Duranona\n\nOur intrepid archaeologist finds himself South America-bound in this exciting new tale of the adventures of Indiana Jones. A priceless ancient treasure, part of the Chimu Taya Arms of Gold, is delivered to Professor Francisca Uribe Del Arco, a charming if mysterious colleague of Indy&amp;#039;s, leading the two to embark on a voyage by sea to Buenos Aires. Romance may be in the air, but so is trouble, as Indy and Francisca soon discover![/quote]\n\n[b]Indiana Jones and the Fate of Atlantis[/b] \n[IMG]http://img147.imageshack.us/img147/2802/atlantispq9.jpg[/IMG]\n[quote]Writer: William Messner-Loebs\nCover Artist: Dave Dorman\nPenciller: Dan Barry\n\nThere isn&amp;#039;t a man, woman, or child walking this earth who hasn&amp;#039;t heard of Indiana Jones, the greatest adventurer of all time. Dark Horse Comics has assembled a top-notch team of talent to custom-fit this enigmatic character into an all-new, four-issue comic book series that&amp;#039;s as chock-full of characterization as it is excitement! It all begins when a mysterious stranger shows up as Barnett College with a n ancient key, and Dr. Jones puts down his grade book to go in search of his former archaeological colleague, Sophia Hapgood. Now a trendy psychic, &quot;Madame Sophia&quot; is doing very well for herself by fleecing people out of their hard-earned money. Toss in a tiny minotaur-like statuette, sprinkle in a few overzealous Nazis, and cue the music! This series is brought to life by the excellent writing skills of William Messner-Loebs (Jonny Quest, Epicurus the Sage), with veteran storyteller Dan (Flash Gordon) Barry providing the pencil art, and one of today&amp;#039;s top inkers Karl (World&amp;#039;s Finest) Kesel providing finishes.[/quote]\n\n[b]Indiana Jones and the Iron Phoenix[/b] \n[IMG]http://img147.imageshack.us/img147/9987/phoenix1zz2.jpg[/IMG]\n[quote]Writer: Lee Marrs\nArtist: Leo Duranona\n\n1947 post-war Germany. Indy is braving the political turmoil and treacherous rubble of Berlin to find the Key of Solomon, a scroll detailing the whereabouts of the legendary Philosopher&amp;#039;s Stone, fabled to have the power to turn lead to gold and bring the dead to life. Indy sets off for the stone, dodging Soviet bureaucrats and Nazis -- all of them hunting the same prize! Will the Third Reich rise again?[/quote]\n\n[b]Indiana Jones and the Sargasso Pirates[/b] \n[IMG]http://img172.imageshack.us/img172/9940/sargassotj0.jpg[/IMG]\n[quote]Writer: Karl Kesel\nCover Artist: Alex Ross\nPenciller: Karl Kesel, Paul Guinan\n\nIndiana Jones sails the high seas in search of a lost Viking ship! Having signed on with a band of pirates, Indy has placed his life in the hands of his old nemesis, Captain Lawton, who blames Indy for the loss of his leg to a shark years earlier. But sharks are the least of anyone&amp;#039;s worries when the vessel becomes entangled in the mythical graveyard of ships -- the Sargasso Sea![/quote]\n\n[b]Indiana Jones and the Spear of Destiny[/b] \n[IMG]http://img172.imageshack.us/img172/6821/spearqm2.jpg[/IMG]\n[quote]Writer: Elaine Lee\nCover Artist: Hugh Fleming\nPenciller: Will Simpson\n\nIn the heart of 1945 Ireland, Indiana Jones and his father, Doctor Henry Jones, discover a terrible secret that could destroy all of civilization. The Spear of Destiny -- which pierced the side of Christ Himself -- has been captured by Nazi spies and will be subjugated to their evil desires if they find the tree rooted from the original thorn. In the hands of one man, the spear killed Christ. In the hands of the Nazis, it would destroy the world. Only the Joneses stand between them and total world domination.[/quote]\n\n[b]Indiana Jones and the Shrine of the Sea Devil[/b] \n[IMG]http://img263.imageshack.us/img263/1507/shrineie4.jpg[/IMG]\n[quote]Writer: Gary Gianni\nArtist: Gary Gianni\n\nThe legend of the Sea Devil has been passed down for centuries, but Indy&amp;#039;s tired of legend and longing for the facts! He sets out to the South Pacific on a harrowing search for the shrine of the Sea Devil in an adventure that&amp;#039;s sure to become legend itself. Reprinting the hard-to-find serial from Dark Horse Comics #s 3-6 featuring the visuals of acclaimed Shadow artist Gary Gianni, this collector&amp;#039;s edition will be a must-have item for any Indiana Jones completist.[/quote]\n\n[b]Indiana Jones Thunder in the Orient[/b] \n[IMG]http://img504.imageshack.us/img504/8884/thunderwe3.jpg[/IMG]\n[quote]Writer: Dan Barry\nArtist: Dan Barry\n\nDateline: 1938. Indiana Jones is on a dig at the ruins of Bas Shamra, north of Tripoli. After he receives cryptic instructions from his old friend, Marcus Brody, Indy is soon on a plane to Nepal, destined to meet a mysterious woman from his past. Indy discovers a treasure that could either unite 500 million people... or destroy the world! Written and illustrated by Dan Barry, this series introduces a new sidekick for Indy, and is one of the most relentlessly paced Indy adventures ever devised. Indiana Jones: Thunder in the Orient precedes the events of immensely popular Indiana Jones: The Fate of Atlantis, and features a knockout cover by fan-favorite Dave Dorman![/quote]\n\n[b]Young Indiana Jones Chronicles[/b] \n[IMG]http://img150.imageshack.us/img150/2725/youngzt5.jpg[/IMG]\n[quote]Writer/Artist: Dan Barry\n\nHenry Jones Jr. embarks on a voyage around the world with his parents and his new tutor, Miss Seymour. While Henry Jones, Sr. lectures at some of the world&amp;#039;s greatest universities, young Henry learns the lessons that will one day make him the adventurer Indiana Jones. In this issue, he meets Lawrence of Arabia by the pyramids of Egypt and faces one of the great questions of life: if many people have many beliefs, which religion is the true one?[/quote]\n\n\n\n[color=dodgerblue][b]BIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D[/b][/color]","torrent":{"xt":"urn:btih:8001c1a3c41835e16e84bbe6a3243ba012085d26","amp;dn":"Indiana+Jones+Collection+%5BBBN%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8001c1a3c41835e16e84bbe6a3243ba012085d26","infoHashBuffer":{"type":"Buffer","data":[128,1,193,163,196,24,53,225,110,132,187,230,163,36,59,160,18,8,93,38]},"announce":[],"urlList":[]}}