{"title":"The Baja Marimba Band - Best of the Baja Marimba Band (2001) [Fu","uid":7635464,"size":85356698,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81aa647911833de254991e2c1655055cc2c1d1f8&amp;dn=The+Baja+Marimba+Band+-+Best+of+the+Baja+Marimba+Band+%282001%29+%5BFu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lydbokami","files":-1,"time":1347632456,"description":"The Baja Marimba band possessed an uncanny ability to fuse marimba with Dixieland, jazz and pop with the aid and direction of the late Julius Wechter. Despite the fact that 1960s music was driven by rock and roll songs, the Baja Marimba Band scored coup after coup with their lush, creative instrumental recordings that appealed to the adults who wanted record albums that they themselves could enjoy. This CD displays the multifaceted talents of The Baja Marimba Band.\n\nThe CD begins with &quot;Along Comes Mary.&quot; The arrangement would be called &quot;easy listening today;&quot; but it was nothing less than chic when it was released. &quot;Comin' In The Back Door&quot; starts off with a pop feel to it and then unexpectedly fuses into Dixieland only to switch back to easy listening with a female choir all over again. The effect stuns you and makes you want more.\n\n&quot;Georgy Girl&quot; boasts a pop flavor to it that is infectiously catchy yet this number also has a touch of marimba added in just for fun. Other pop influenced instrumentals on this CD include &quot;Sounds Of Silence&quot; with an excellent arrangement for the flute; and &quot;Do You Know The Way To San Jose&quot; highlights the xylophone and other instruments to add a touch of a jazz-Mexican-Caribbean influence. Moreover, &quot;Somewhere My Love&quot; includes the xylophone to fuse pop with a Latin influence and &quot;Those Were The Days&quot; uses horns and percussion to once again join pop with marimba. How creative!\n\nThe tracks on the CD switch gears often to sing the praises of the band members who were remarkably facile at performing complex arrangements. &quot;Juarez&quot; gets the jazz treatment added to this Latin number for an incredible effect. The arrangement for &quot;Acapulco 1822&quot; employs both Dixieland and marimba to bat this one right out of the park! The piano playing on this track is stupendous, too. &quot;Baja Nights&quot; has an unmistakable Mexican-Caribbean feel to it. There is also the distinct pop number entitled &quot;Fowl Play;&quot; listeners will delight in the rendition of this number. Although &quot;Fowl Play&quot; falls under the pop music category, The Baja Marimba Band performs this number with a bit of Mexican and Dixieland flavors to enhance its beauty.\n\n&quot;Sunrise Sunset&quot; and &quot;Fiddler On The Roof&quot; are two surprises on this CD. Both numbers come from the show and movie &quot;Fiddler On The Roof&quot; which has such a Jewish slant that you would never expect them on this CD! Nevertheless, The Baja Marimba Band performs these numbers with remarkable sensitivity and passion. &quot;Sunrise, Sunset&quot; starts off as pop and then bounces back and forth between a jazz arrangement and the original pop rendition. Great! &quot;Fiddler On The Roof&quot; keeps the beat of the original number but the band superimposes a Mexican arrangement over the much more traditional pop melody. It works very well. (Amazon)","torrent":{"xt":"urn:btih:81aa647911833de254991e2c1655055cc2c1d1f8","amp;dn":"The+Baja+Marimba+Band+-+Best+of+the+Baja+Marimba+Band+%282001%29+%5BFu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81aa647911833de254991e2c1655055cc2c1d1f8","infoHashBuffer":{"type":"Buffer","data":[129,170,100,121,17,131,61,226,84,153,30,44,22,85,5,92,194,193,209,248]},"announce":[],"urlList":[]}}