{"title":"Collide - H.M. Ward.epub","uid":9039619,"size":503999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83310adf76d2b9a7f12d3d13b070ed860d400faa&amp;dn=Collide+-+H.M.+Ward.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1381593111,"description":"When Mari accidentally overhears that Trystan is in love, she can't believe it. He's pining over some girl that doesn't know he's alive. The confident swagger and endless stream of girls is a facade. It conceals his loneliness and hides how messed up he's really become trying to flee from a life that's battered him to his core.\nTrystan tries to figure out how to make it clear how much he loves Mari, but every insincere kiss and every broken promise haunts him, because she knows them all. Now, Trystan has to prove to the one girl he's actually fallen in love with that she's not just another conquest.\nMari has no idea who Trystan loves, but she can tell that whoever it is has captured his heart entirely. Soon Mari sees the man behind the mask, the guy that Trystan tries so hard to hide. Everything about him is appealing, and too hard to resist.\nIn a moment of desperation, Trystan uploads a love song he wrote for Mari, but before he can show it to her, the video goes viral. Everyone wants to know who he is, and the only thing shielding him is an anonymous account name and some thick shadows hiding his face. Tyrstan realizes that the consequences of revealing his identity will be disastrous. Everything he's tried so hard to hide will be exposed. It's a secret that is impossible to keep and the only girl who he wanted to hear it will never believe him.\nThe Secret Life of Trystan Scott is an addicting romance with lots of tension and steamy kisses. The story is told in 20,000 word segments. Each book is another episode, building on the previous. The books in the TRYSTAN SCOTT series will get hotter as it progresses and cross from YA into New Adult by the end of the series.\nGenre: Young Adult, Romance, Music","torrent":{"xt":"urn:btih:83310adf76d2b9a7f12d3d13b070ed860d400faa","amp;dn":"Collide+-+H.M.+Ward.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83310adf76d2b9a7f12d3d13b070ed860d400faa","infoHashBuffer":{"type":"Buffer","data":[131,49,10,223,118,210,185,167,241,45,61,19,176,112,237,134,13,64,15,170]},"announce":[],"urlList":[]}}