{"title":"[PDF] [2010] Roman Passions A History of Pleasure in Imperial Ro","uid":6450432,"size":3709588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83d638be202e7e682a1ea9e0d8ea0febd18723db&amp;dn=%5BPDF%5D+%5B2010%5D+Roman+Passions+A+History+of+Pleasure+in+Imperial+Ro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307406590,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\n&quot;What's not to like about a guidebook through the consumerist wonderland of ancient Rome, a breezy tour of conspicuous living, lavish dining, mass spectacle, and, of course, sex? ... The book provides general readers with an engaging introduction to early Roman social history. Summing up: Highly recommended.&quot; - Choice\n\n&quot;It is all here: emperors' luxurious lifestyles, magnificent urban architecture, grand country villas, baths, sex, food, drink, the theatre, games (especially violent ones) and collecting and displaying rarities ... Commendably detailed.&quot; - Peter Jones, BBC History Magazine\n\n&quot;A detailed exposition of the world of late Roman culture.&quot; - Times Higher Education\n\nImmerse yourself in the sensual delights of Rome in all their guises. By the time of the emperors, the Romans had created the world's first global empire, and plundered the provinces for produce to be eaten, planted or displayed as novelties. At the same time the aesthetics of the city of Rome was being transferred to the provinces, establishing towns with public buildings, baths and the Latin language.\n\nWith these attributes of civilisation came other trappings of Roman culture: lavish entertainments, elaborate dinner parties and vice. The world of pleasure became a defining feature of the Romans, and this book explores how they pursued sensual delights - from steamy bathhouses to stately country villas; the excesses of the festivals to the rich culture of music, dance and song and sex, as both unrestrained and puritanical.","torrent":{"xt":"urn:btih:83d638be202e7e682a1ea9e0d8ea0febd18723db","amp;dn":"%5BPDF%5D+%5B2010%5D+Roman+Passions+A+History+of+Pleasure+in+Imperial+Ro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83d638be202e7e682a1ea9e0d8ea0febd18723db","infoHashBuffer":{"type":"Buffer","data":[131,214,56,190,32,46,126,104,42,30,169,224,216,234,15,235,209,135,35,219]},"announce":[],"urlList":[]}}