{"title":"AC comics pack 3","uid":3942911,"size":932870554,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8518973dc28e192f41171f1e013a666893cf9cbd&amp;dn=AC+comics+pack+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"citaltras","files":94,"time":1198270365,"description":"Part three of the series of AC comics \n\n\n\nAC Comics is a comic book publishing company started by Bill Black. It was founded as Paragon Publications in 1969, and was briefly known as Americomics in 1982, before becoming AC in 1984. It was one of the initial quartet of independent color comics companies who pioneered the direct sales phenomenon in the early 1980s, targeting specialty comic book shops rather than newsstands or other venues.\n\nToday, AC Comics specializes in reprints of Golden Age comics from now-defunct companies whose properties lapsed into public domain and were not reprinted elsewhere. It also publishes a number of Modern Age adventures starring the Golden Age superheroes that appeared in those stories. The most famous of those titles is Femforce, which features the adventures of an all-female superhero team, one of the first teams of this nature in the comics industry.\n\nBased on their focus on Golden Age reprints and stories inspired by that style, AC has developed a reputation for straight-forward, fun, and action-packed superhero tales which often avoid the darker themes of many modern comics. AC artists often make use of a style known as &quot;good girl art,&quot; made popular in the Golden Age era, which combines attractive, clean linework with elements of cheesecake and humor. In addition to superheroes, AC has attempted to preserve other comic book genres inspired by the series of the past, such as Westerns and jungle adventure.\n\nFollowing the popularity of size-changing Femforce members Garganta and Tara, AC made the giantess concept a recurring theme in their comics. Tapping into this cult following, AC has released stories and anthologies specifically catered to fans of giant women, as well as DVD releases which embrace this theme in the tongue-in-cheek style of 1950s science fiction B-movies. An ongoing giantess feature known as Gargantarama has even been added to the company&amp;#039;s Femforce title.\n\n(From wikipedia)\n\nEnjoy and seed","torrent":{"xt":"urn:btih:8518973dc28e192f41171f1e013a666893cf9cbd","amp;dn":"AC+comics+pack+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8518973dc28e192f41171f1e013a666893cf9cbd","infoHashBuffer":{"type":"Buffer","data":[133,24,151,61,194,142,25,47,65,23,31,30,1,58,102,104,147,207,156,189]},"announce":[],"urlList":[]}}