{"title":"BAD PLANET 01-06 (2005-2008) (Image Comics) Complete plus Bonus","uid":8203015,"size":151997233,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8657ff3712ababbf7cb0c120f87371de50c8edd4&amp;dn=BAD+PLANET+01-06+%282005-2008%29+%28Image+Comics%29+Complete+plus+Bonus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1362062649,"description":"This fills a request for elmacho74. I've thrown in the other Thomas Jane comics project, Alien Pig Farm. (Thanks to blackcanary who upped it here on TPB.) All credit to the original scanners and uploaders. Please seed and share!  --STFmaryville\n\n------\n\nBad Planet 1-6\n\nThe story begins as an ancient meteorite containing destructive alien organisms crashing down on modern Earth. Another alien, a single warrior, appears on Earth to help prevent its destruction at the hands of the malevolent invaders ...\n\nCo-creator/co-writer Thomas Jane was &quot;hopped up on Vicodin&quot; while recovering from a car accident when he had a series of fever dreams that contained &quot;horrible alien death-spiders.&quot; From those dreams, he formed the idea for the comic book series Bad Planet.\n\nJane befriended comic book artist Tim Bradstreet while making the promotional posters for the Punisher film and pitched the idea to him. Bradstreet suggested he approach Bradstreet's long-time friend, Eisner Award-nominated Steve Niles with the concept. Eventually the three met at a 2004 comic convention in Los Angeles. Niles, famous for his vampire series 30 Days of Night, quickly jumped on the idea and agreed to write Bad Planet. Jane again asked Bradstreet for advice about the interior artwork in the comic. Bradstreet had wanted an opportunity to work with Lewis LaRosa after seeing his work on the Punisher MAX series, for which Bradstreet did covers.\n\nThe team had originally conceived the series as being twelve parts, but it was later changed to six parts. Jane explained that this was because they split the series in half so the team could have a break in the project.\n\nThe second issue was cover dated January 2006 but then the series stalled due to LaRosa's illness and subsequent exit from the comics industry. It wasn't until mid-2007 that the third issue was released. James Daly took over for issue #4 (November 2007) and issue #5 (April 2008) featured art from Daly, Bradstreet and Dave Kendall.\n\n------\n\nAlien Pig Farm 3000 (digital trade)\nEnglish\nCBZ\n96 Pages\nPublisher: Image / Raw Studios\nPublication Date:  July 28, 2010\n\nStory by Todd Farmer and Thomas Jane\nWritten by Todd Farmer, Thomas Jane, and Steve Niles\nArt by Don Marquez\nColored by Grant Goleash\nLettered by Marshall Dillon and Jason Hanley\nCover by Mark Schultz\n\nWe know what happens when aliens attack the White House and we've got a pretty good idea of what happens when they attack Sigourney Weaver, but what happens when a race of pig-eating, flesh-gnarling sonsofbitches attack a Kentucky moonshining town? Well. You best put your feet up, sit a spell and kiss yer sister on the mouth 'cuz you about to find out. It's gonna be up to Johnny Ray to kick some green-skinned butt AND keep his moronic brother Elvis out of trouble, while protecting the sister he loves ... probably more than he should. It's aliens, rednecks and incest!! Brought to you by the good ol' boys at RAW STUDIOS!\n\n","torrent":{"xt":"urn:btih:8657ff3712ababbf7cb0c120f87371de50c8edd4","amp;dn":"BAD+PLANET+01-06+%282005-2008%29+%28Image+Comics%29+Complete+plus+Bonus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8657ff3712ababbf7cb0c120f87371de50c8edd4","infoHashBuffer":{"type":"Buffer","data":[134,87,255,55,18,171,171,191,124,176,193,32,248,115,113,222,80,200,237,212]},"announce":[],"urlList":[]}}