{"title":"Quest For Love (1971, Joan Collins, Tom Bell) DVD-Rip.","uid":5086459,"size":4206785233,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:870ba05056a681131e2bab60efa9f66be1fb874d&amp;dn=Quest+For+Love+%281971%2C+Joan+Collins%2C+Tom+Bell%29+DVD-Rip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SAI_Archives","files":15,"time":1252713996,"description":"Quest for Love (1971, Joan Collins, Tom Bell)\n\nAfter a scientific experiment goes horribly wrong during a demonstration, a scientist finds himself trapped in an alternate reality that bears some similarities to our own, but also has some striking differences. In this other reality the Second World War had never occurred, mankind had not yet traveled into Space and Mt. Everest had not yet been conquered, just to name a few things. Also in this other reality he is no longer a scientist but rather a well known author. He also finds that he is married to a beautiful woman who he instantly falls in love with but who his alternate self never cared for. He has some difficulty convincing anyone that he is not actually who they think he is. With the help of a physics professor who believes his story, he finally manages to convince his 'wife' that he is not the man she knew before. After a personal tragedy in this alternate world, he finds himself back in his own world and desperately trying to locate the woman he fell in love with in the other world. Little does she know, however, that her life depends on him finding her.\n\n\nSource:\nDVD sold in Europe which from appearances was mastered from the British PAL Format VHS release.\n\nQuality:\nVideo: Excellent, except for some very slight horizontal stuttering which often appears in PAL to NTSC conversions.\nAudio: Excellent.\n\nCreating a DVD:\nPlace the AUDIO_TS and VIDEO_TS folders in the root directory and record using your favorite &quot;burner&quot; software.  Make sure the file standard selected &quot;UDF&quot; ","torrent":{"xt":"urn:btih:870ba05056a681131e2bab60efa9f66be1fb874d","amp;dn":"Quest+For+Love+%281971%2C+Joan+Collins%2C+Tom+Bell%29+DVD-Rip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870ba05056a681131e2bab60efa9f66be1fb874d","infoHashBuffer":{"type":"Buffer","data":[135,11,160,80,86,166,129,19,30,43,171,96,239,169,246,107,225,251,135,77]},"announce":[],"urlList":[]}}