{"title":"Hot Rackets (1979) - Classic Porn XXX","uid":9649412,"size":1199459983,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:888bf8d358f02952964700b1ed80c344998222ee&amp;dn=Hot+Rackets+%281979%29+-+Classic+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1393050637,"description":"Hot Rackets (1979)\n\nCOVERS AND SCREENS FOUND HERE:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&lt;/a&gt;\n\nIs it true that tennis players do it with deeper strokes? You'll find the answer in Hot Rackets - certainly the most fascinating, expensively made, and the most delightful motion picture ever made for a sex-loving, fun-loving audience! Herb and Liz Adler, an indecently rich couple, are members of an exclusive tennis club whose members indulge themselves in more than a workout on the courts. We learn that the club is totally dedicated to providing for the sexual needs and fulfilling the sexual fantasies of its members! \n\n    Scene 1. Cris Cassidy, Jon Martin\n    Scene 2. Rhonda Jo Petty, Mike Ranger\n    Scene 3. Candida Royalle, Ray Wells\n    Scene 4. Candida Royalle\n    Scene 5. Cris Cassidy, Turk Lyon\n    Scene 6. Laurien Dominique, John Raymond\n    Scene 7. Candida Royalle, Laurien Dominique\n    Scene 8. Cris Cassidy, Turk Lyon\n    Scene 9. Cris Cassidy, Rock Steadie\n    Scene 10. Desiree Cousteau, Mike Ranger\n    Scene 11. Desiree Cousteau, Jon Martin\n    Scene 12. Candida Royalle, Laurien Dominique, Mike Ranger\n    Scene 13. Connie Peterson, Laurien Dominique, Don Fernando, Mike Ranger\n    Scene 14. Yvonne Green, John Raymond\n    Scene 15. Rhonda Jo Petty, Jon Martin\n\nDistributor\n    Metro\nDirector\n    Robert McCallum\n\nMinutes\n    78\n \nActresses:\n    Candida Royalle [Facial]\n    Cris Cassidy (as Chris Cassidy) [Facial]\n    Connie Peterson\n    Desiree Cousteau (as Desiree Clearbranch)\n    Laurien Dominique (as Laurien Domineque) [Facial]\n    Yvonne Green (as Mimi Zuber)\n    Rhonda Jo Petty (as Rhonda Petty) [Shaved]\n\nActors:\n    Don Fernando\n    Rock Steadie (as Fred Runyan)\n    John Raymond\n    Jon Martin\n    Mike Ranger (as Mike Fairmont)\n    Ray Wells\n    Turk Lyon\n\nDirected by Robert McCallum\n1979\nRuntime: 1 hour 20 minutes 38 seconds\n\nTruly a classic adult film. That it is a product of the seventies is clear from the opening credits where the screen is broken into four parts with a tennis ball in the middle. Over the tennis ball are displayed the names of the cast and primary crew, and the four screens play various clips from the film whetting the viewers appetite and preparing them for what is about to come.\n\nIt all starts when Herb Adler (John Martin) wakes up and rolls over to his nude wife, Liz (Candida Royalle). He begins to grope her and tries to arouse her, but she will have none of it. Through an angry exchange on Herb's part, we find out that this is their usual behavior. Herb claims she is frigid. She does not deny this, and Herb storms off to get a shower.\n\nIn the shower, the maid Sally (Chris Cassidy) expresses her sympathy for Herb. Herb, still bitter about Liz's rejection, asks her, &quot;Aren't you supposed to be making the bed?&quot; She coyly answers, &quot;I'd rather be making you.&quot; A beat later he replies, &quot;That's not a bad idea.&quot; Seconds later she is giving him a blowjob.\n\nHerb is off to the &quot;Tennis Club&quot; as Liz complains that he plays too much tennis. He ignores her and leaves, and she calls up Mona Simms (Rhonda Petty), a friend of hers to vent.\n\nMona is in the middle of having her pussy shaved by her husband Bill when she answers the phone. (Side Note: She has the only shaved pussy in the film as, true to seventies porn, everyone else has natural bush. The maid Sally even has armpit hair!) She explains to Liz that the Tennis Club is really much more than just tennis. Sex is what makes it so popular.\n\nThey hang up. Liz is upset, so, of course she masturbates. Carl, her butler (Turk Lyon), interrupts her shortly after she begins. She tells him to ready the car because she wants to go to the Tennis Club.\n\nThe film cuts back Mona and Bill who has finished shaving her pussy, and they proceed to have sex. The scene is hot and loaded with close ups. He comes on her stomach and then is off to the Tennis Club himself.\n\nAt the club, Liz meets the bartender (Ray Wells) who tells her that the key to enjoying herself is fantasy. She has a fantasy about giving him a blowjob in a hot, dreamlike scene before leaving. Then at home that night, Liz masturbates to a sexy radio program. She is starting to open up sexually.\n\nThe next day after dropping off Liz at the club, Carl the butler and Sally the maid have a hot session that starts in the entrance of the mansion and leads to the upstairs den. The both receive oral and proceed to have sex. Sally snatch is unshaved and covered in blond hair. Even her armpits are hairy, though they really don't look bad.\n\nAt the club, Liz wanders around and fantasizes that the male tennis players are nude. She laughs as she watches a nude match take place.\n\nIn the locker room, Liz walks in on Kelly (Laurien Domineque) giving one of the members a blow job. Liz watches as Kelly finishes, and then Kelly introduces herself as staff. She gets Liz some clothes and starts to help her change them but Kelly then explains that she services women of the club also. Kelly and Liz slowly get into it but Liz's husband Herb knocks on the door. Liz panics. Kelly tells her not to worry. She sits on her face hiding her as Herb enters. Kelly tells Herb she's busy in a private session with a new member. Herb comments that the new member has a great 'bod' and leaves. Liz really gets into then and they proceed to ravish one another.\n\nThat is only half of the film, because I don't want to ruin it for you. Needless to say, the second half is just as hot (if not hotter) and includes everything from a blind man getting laid to a hot three way with Candida, Laurien, and Mike Fairmont where Mike doesn't realize Candida is even there until it is almost over. If that isn't enough, there is also a wonderful orgy where a couple actually parachutes in from a plane to join in on the fun.\n\nAll of the actors are average looking by today's standards and have natural bodies. There is not one silicone appendage anywhere. They remind me of people I see everyday at the mall or the post office.\n\nThey worked hard on the story and it shows, but not at the expense of the sex which is raw and hot. There is a lot of comedy interspersed throughout and I laughed about as much at this film as I did at &quot;Scary Movie.&quot; Examples: The radio that wakes them up at the beginning of the film has a DJ telling the news which includes a revelation that &quot;traces of meat were found today in McDonald's hamburgers to much surprise.&quot; Also when the blind potter is blown by Chris Cassidy he screams as he comes, &quot;I can see!&quot;\n\nDefinitely a must have for lovers of classic films or anyone who want to be entertained as they are turned on. The video and audio quality is impressive for such an old film, though obviously not perfect. It appears to be uncut.\n\nCOVERS AND SCREENS FOUND HERE:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&lt;/a&gt;\n","torrent":{"xt":"urn:btih:888bf8d358f02952964700b1ed80c344998222ee","amp;dn":"Hot+Rackets+%281979%29+-+Classic+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888bf8d358f02952964700b1ed80c344998222ee","infoHashBuffer":{"type":"Buffer","data":[136,139,248,211,88,240,41,82,150,71,0,177,237,128,195,68,153,130,34,238]},"announce":[],"urlList":[]}}