{"title":"Mr. Bean - It''s Bean 20 years DVD 3 (11 subs) 2lions-Team","uid":5896444,"size":4510047512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8969a83313b81c96a685fcb83d61be72c01d927f&amp;dn=Mr.+Bean+-+It%5C%27%5C%27s+Bean+20+years+DVD+3+%2811+subs%29+2lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Thomas1234555","files":40,"time":1287513103,"description":"Geregisseerd\nSue Vertue\n\nActeurs\nRowan Atkinson\n\nGenre\nKomedie\n\nSpeelduur\n170\n\nAfleveringen\nMr. Bean slaat weer toe: Mr. Bean schiet een man ter hulp die een hartaanval krijgt, maar het resultaat is rampzalig. Zijn pogingen om een brief te posten mislukken jammerlijk, maar na verschillende tegenslagen vertrekt hij, gelukkig en wel met het vliegtuig op vakantie.\n\nVrolijk kerstfeest Mr. Bean: De kerstdagen zijn weer in het land en een dolenthousiaste Mr. Bean richt uiteraard zijn gebruikelijke chaos aan. Het farceren van de kalkoen draait uit op een regelrechte farce en zijn vriendin, Irma, kijkt uit naar een heel speciaal kerstgeschenk.\n\nMr. Bean in kamer 426: Mr. Bean verrast zichzelf op een weekendje in een hotel. Helaas komt hij tot de vaststelling dat het de kamer aan enkele elementaire voorzieningen ontbreekt. Een varkentje dat hij uiteraard op zijn ingenieuze manier weet te wassen. Tot plots blijkt dat hij zichzelf heeft buitengesloten.\n\nPas op de baby, Mr. Bean:\nMr. Bean is dolblij dat hij eindelijk op de kermis beland, maar voor hij het goed en wel beseft, moet hij plots voor een baby\\'tje zorgen. Hoe kan hij erop toezien dat de baby niets overkomt zonder dat zijn eigen kermisplezier daarbij in het gedrang komt?\n\nMr. Bean als doe-het-zelver: Mr. Bean verliest op oudejaarsavond middernacht uit het oog, maar hij stuit de volgende dag gelukkig op een koopje in de uitverkoop. Hij bedenkt een hoogst ongewone transportmethode om zijn aankoop te vervoeren. Thuis ontketent hij de doe- het- zelver in zichzelf.\n\nMenu: Ja\nExtra\\'s: Ja\nTaal: Engels\nOndertiteling: Deens - Duits - Engels - Frans - IJslands - Italiaans - Nederlands -Noors - Pools - Portugees - Zweeds\nBeeld: 16.9\nAudio: Dolby Digital 2.0 , Engels\nCover: Ja!\n\nVeel plezier ermee!\nDe volgende komt er binnenkort aan!\n*****************************************\n\nBrought to you by\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons NIEUWE forum\n\nNEW NEW ***** http://2lions-site.nl ***** NEW NEW\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live \n","torrent":{"xt":"urn:btih:8969a83313b81c96a685fcb83d61be72c01d927f","amp;dn":"Mr.+Bean+-+It%5C%27%5C%27s+Bean+20+years+DVD+3+%2811+subs%29+2lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8969a83313b81c96a685fcb83d61be72c01d927f","infoHashBuffer":{"type":"Buffer","data":[137,105,168,51,19,184,28,150,166,133,252,184,61,97,190,114,192,29,146,127]},"announce":[],"urlList":[]}}