{"title":"Secret City Saga (Complete)","uid":7758599,"size":158101291,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8a44e562cf5208d3230a265747419f96a99b7fb0&amp;dn=Secret+City+Saga+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":16,"time":1351166299,"description":"Secret City Saga is a concept and collection of various comic book titles created by the great and influential writer/artist, Jack Kirby.  These books were published by the short-lived Topps Comics, an off-shoot of the popular Topps Trading Card company.  Beginning in April, 1993, the Secret City Saga books is comprised of three four-issue mini-series (Jack Kirby's Secret City Saga; Satan's Six; TeenAgents) and three one-shot specials (Captain Glory; Nightglider; and Bombast,) which were all preceded by the one-shot promotional giveaway, Jack Kirby's Secret City Saga 0.\n\nThe concept itself saw Topps lease Kirby's name alongside the characters, and saw the line referred to as, &quot;The Kirbyverse.&quot;  All the characters resided in the same shared universe, and the deal also presented the final time that Kirby had complete creative control over any of the many properties that he had created in his illustrious career.  It was initially seen as a creative and financial failure.  The line consisted of leftover concepts Kirby had developed years prior, and generated low sales and minimal reader interest, finding a niche only with hard-core Kirby fans.\n\nThis humble torrent comprises ALL issues listed above.\n\nEnjoy, and please seed.\n\n","torrent":{"xt":"urn:btih:8a44e562cf5208d3230a265747419f96a99b7fb0","amp;dn":"Secret+City+Saga+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a44e562cf5208d3230a265747419f96a99b7fb0","infoHashBuffer":{"type":"Buffer","data":[138,68,229,98,207,82,8,211,35,10,38,87,71,65,159,150,169,155,127,176]},"announce":[],"urlList":[]}}