{"title":"98.6 Degrees: the art of keeping you ass alive","uid":8222983,"size":5958735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a8ca96cf61d12e1fdd281db2d5580834748d341&amp;dn=98.6+Degrees%3A+the+art+of+keeping+you+ass+alive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenmeunseen","files":1,"time":1362518058,"description":"Cody Lundin, director of the Aboriginal Living Skills School in Prescott, Arizona, shares his own brand of wilderness wisdom in this highly anticipated new book on commonsense, modern survival skills for the back country,the backyard, or the highway. This is the ultimate book on how to stay alive-based on the principal of keeping the body's core temperature at a lively 98.6 degrees.\n\nIn his entertaining and informative style, Cody stresses that a human can live without food for weeks and without water for about three days or so. But if the body's core temperature dips much below or above the 98.6 degree mark, a person can literally die within hours. It is a concept that many don't take seriously or even consider, but knowing what to do to maintain a safe core temperature when lost in a blizzard or in the desert could save your life. Lundin delivers the message with wit, rebellious humor, and plenty of back country expertise.\n\n\nHope you enjoy this book and remember if you like it this buy a copy\n\nPlease seed!!!","torrent":{"xt":"urn:btih:8a8ca96cf61d12e1fdd281db2d5580834748d341","amp;dn":"98.6+Degrees%3A+the+art+of+keeping+you+ass+alive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8ca96cf61d12e1fdd281db2d5580834748d341","infoHashBuffer":{"type":"Buffer","data":[138,140,169,108,246,29,18,225,253,210,129,219,45,85,128,131,71,72,211,65]},"announce":[],"urlList":[]}}