{"title":"The FLEXBRAIN Method (6 CDs + workbook)","uid":8868096,"size":336287258,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8ae49f921b6f4b9356a9a712943cf6504503e5b4&amp;dn=The+FLEXBRAIN+Method+%286+CDs+%2B+workbook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"leopardog","files":124,"time":1377979676,"description":"\nThe Flexbrain Method by Nightingale Learning Systems\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/190603012X/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/190603012X/4353-20&lt;/a&gt;\n\nStrengthen your brain, increase your intelligence, and prevent mental decline with just five minutes of &quot;brain flexing&quot; a day! Based on the very latest research into brain function, memory retention, and neurological health, The FlexBrain Method is a thoroughly interactive, &quot;brains-on&quot; audio program designed to substantially improve your brain functioning right now and to keep your brain on an upward track of growth, expansion, and strength for the rest of your life. Each session of The FlexBrain Method weaves together fascinating information on how your mind works, with built-in exercises to keep your brain stimulated and engaged at a deep level and with quick &quot;neurobic workouts&quot; designed to optimize specific brain functions in just a few minutes. You'll learn how to improve your memory, increase your mental agility and more, by making simple yet carefully targeted changes to the way you do ordinary, everyday things, such as brush your teeth, set your alarm clock, start your car, write your to-do list, and even sit in a restaurant. And that's not all! In the 12 sessions of The FlexBrain Method, you will discover:\n\nIf your diet is dooming you to brain deterioration later in life The single best and worst things you can do for your brain\nAn easy way to reduce your risk of dying from heart disease by 40%\nHow to become WHO you think about\n5 supplements proven to increase neural connections in the brain\nThe secret to building muscle strength without ever moving a muscle\nA do-anywhere exercise that acts as a natural tranquilizer\nWhy you don't ever have to experience stress again\nFoods that are proven to increase your ability to focus and concentrate\nAnd so much more!","torrent":{"xt":"urn:btih:8ae49f921b6f4b9356a9a712943cf6504503e5b4","amp;dn":"The+FLEXBRAIN+Method+%286+CDs+%2B+workbook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ae49f921b6f4b9356a9a712943cf6504503e5b4","infoHashBuffer":{"type":"Buffer","data":[138,228,159,146,27,111,75,147,86,169,167,18,148,60,246,80,69,3,229,180]},"announce":[],"urlList":[]}}