{"title":"The Far Country (1954) Xvid 1cd - Western - Eng-Fr-Sp Subs -  Ja","uid":10927365,"size":769173747,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8b5e953918e1373628d39f70aee3ff54126d7978&amp;dn=The+Far+Country+%281954%29+Xvid+1cd+-+Western+-+Eng-Fr-Sp+Subs+-++Ja&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1409374007,"description":"The Far Country (1954) Xvid 1cd - Western - Eng-Fr-Sp Subs -  James Stewart, Ruth Roman [DDR]\n\nThe Far Country is a 1954 American Western Technicolor romance film directed by Anthony Mann and starring James Stewart, Ruth Roman, and Walter Brennan. \nWritten by Borden Chase, the film is about a self-minded adventurer who locks horns with a crooked lawman while driving cattle to Dawson.\nIt is one of the few Westerns, along with The Spoilers, North to Alaska, to be set (not filmed) in Alaska. \nThis is the fourth Western film collaboration between Anthony Mann and James Stewart.\n\n    CAST:-\n    James Stewart as Jeff Webster\n    Ruth Roman as Ronda Castle\n    Walter Brennan as Ben Tatum\n    Corinne Calvet as Renee Vallon\n    John McIntire as Judge Gannon\n    Jay C. Flippen as Marshal Rube Morris\n    Harry Morgan as Ketchum\n    Steve Brodie as Ives\n    Connie Gilchrist as Hominy\n    Robert J. Wilke as Madden\n    Chubby Johnson as Dusty\n    Royal Dano as Luke\n    Jack Elam as Newberry\n    Kathleen Freeman as Grits\n    Connie Van as Molasses\n\nDirected by Anthony Mann\nProduced by Aaron Rosenberg\nWritten by Borden Chase\nMusic by Milton Rosen, Henry Mancini\nRunning time 97 minutes\n\nSYNOPSIS:- The Far Country (1954)\nIn 1896, Jeff Webster (James Stewart) hears of the Klondike gold rush and he and friend Ben Tatum (Walter Brennan) decide to drive a herd of cattle to Dawson City. On the way, he annoys self-appointed Skagway judge Gannon (John McIntire) by interrupting a hanging, so the &quot;lawman&quot; confiscates his herd. Jeff and Ben steal the animals back and take off with Gannon and his men in hot pursuit. After crossing the border into Canada, Jeff uses a few well-placed warning shots to persuade Gannon's gang to give up the chase, but the judge promises a hot reception when Jeff returns.\n\nWhen Jeff gets to Dawson, he finds widespread (though relatively peaceful) lawlessness, and ignores it as none of his business. He auctions off his herd to new arrival Ronda Castle (Ruth Roman), a tramp and one of Gannon's business associates, when she outbids Hominy (Connie Gilchrist), Grits (Kathleen Freeman) and Molasses (Connie Van), co-owners of the local hash house. Both Ronda and French-Canadian gamine Renee Vallon (Corinne Calvet) are strongly attracted to Jeff.\n\nRonda sets up a saloon in partnership with Gannon and begins cheating the miners out of their claims. Gannon and his gunmen show up to grab their share (and then some), making Dawson much more dangerous. Jeff stays out of it, instead planning to sneak out by river while Gannon is otherwise occupied. However, Gannon is tipped off when Ben buys extra coffee for the long trip; his men kill Ben and wound Jeff, finally forcing him to take sides.\n\nJeff calls Gannon out to settle the dispute man to man, but the villain arranges an ambush. Ronda rushes out to warn Jeff and is fatally shot in the back. Jeff kills Gannon in the ensuing gunfight and the rest of his gang surrender to the fed-up longtime residents.\n\nHistorical background\n\nThe character of Gannon may be loosely based on that of Soapy Smith, a confidence artist and gang leader who ran the town of Skagway during the Alaska Gold Rush. He was killed in a gunfight, although not as shown in th e movie.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate:896 kbps\nVideo Resolution: 640x352\nVideo Aspect Ratio: 1.818:1\nFrames Per Second: 23.976\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 102kb/s VBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 1:36:44\nSubtitles: English, Espanol, Francais\nRipped by: [DDR]\nDuration: 1:36:44 ","torrent":{"xt":"urn:btih:8b5e953918e1373628d39f70aee3ff54126d7978","amp;dn":"The+Far+Country+%281954%29+Xvid+1cd+-+Western+-+Eng-Fr-Sp+Subs+-++Ja","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5e953918e1373628d39f70aee3ff54126d7978","infoHashBuffer":{"type":"Buffer","data":[139,94,149,57,24,225,55,54,40,211,159,112,174,227,255,84,18,109,121,120]},"announce":[],"urlList":[]}}