{"title":"Preston Sturges - Sullivan's Travels (1941)","uid":5287679,"size":2474674671,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c86e5d390d32198506ec2cb7399ccc287a23f12&amp;dn=Preston+Sturges+-+Sullivan%5C%27s+Travels+%281941%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"lord_terabyte","files":-1,"time":1263775905,"description":"Preston Sturges - Sullivan's Travels (1941)\n\nEnglish dual audio with commentary\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0034240&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0034240&lt;/a&gt;\n\nThis film stars the then 19 years old Veronica Lake!\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51BH8JMVQ1L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51BH8JMVQ1L.jpg&lt;/a&gt;\n\nSullivan's Travels is a curious but effective mixture of grim tragedy, slapstick of the Key- stone brand and smart, trigger-fast comedy.\n\nIt is written and directed by Preston Sturges, who springs a flock of surprises as he flits from slapstick to stark drama, from high comedy to a sequence of the Devil's Island prison type of stuff, into romantic spells, some philosophy and, in effect, all over the place without warning.\n\nHe ties it all together neatly, however, and keeps his audience on the go and on edge. Sturges' dialog is trenchant, has drive, possesses crispness and gets the laughs where that is desired.\n\nHollywood director Joel McCrea, anxious to produce Oh, Brother, Where Art Thou?, an epic of hard times and troubles, disguises himself as a hobo and goes out to look for troubles, finding plenty for himself. He picks up Veronica Lake on the way and they travel the rails together, she in boy's clothes.\n\nA fine cast has been assembled around McCrea and Lake. Latter supplies the sex appeal and does a good acting job. McCrea, in the lap of luxury as a Hollywood director one minute, and a bum the next, turns in a swell performance.\n\n-------\n\nSullivan's Travels is really a wonderful film, it has great writing and direction and it does a fantastic job of mixing intellectuality with comedy.\n\nJoel McCrea is John L. Sullivan, a rich Hollywood director who wants to venture away from comedies and make a serious picture about poverty in America based off of O Brother, Where Art Thou. Problem is though that his producers don't think he has it in him to make a good picture about poverty. They tell him he hasn't had a moment of trouble in his life, and they're right so Sullivan decides to embark on an adventure across the country disguising himself as a transient in order to learn the life of the less fortunate.\n\nThe following day Sullivan heads out, but unfortunately the studio heads have decided to follow him in a giant land yacht documenting his adventure. He is finally able to shake them, and ends up hitching a ride in the back of a semi-truck.\n\nMuch to Sullivan's dismay, he wakes up the following morning in the back of the truck back in Hollywood. He makes his way into a diner to grab some breakfast, and that is where we meet The Girl, played by the lovely Veronica Lake. She buys him some food, and he offers to give her a ride back home in his &quot;friends&quot; car. Problem is, he forgets to tell anyone he's taking out his car and it's reported stolen so before too long they are pulled over and arrested. In order to get himself out of jail, he has not choice but to reveal his real identity to the girl.\n\nAt first she's hostile towards Sullivan for having tricked her, but she quickly grows to like him and insists on joining him for his experiment. Of course Sullivan is against her accompaniment, he tells her to either stay at his house or go home but she is very persistent and ends up joining him anyways. Along the voyage it seems that every time they get into any trouble his people keep coming to the rescue, whether he wants it or not (and believe it or not sometimes he wants it), so he really doesn't get any tough experience at all... not yet at least.\n\nSullivan's Travels is probably one of the best comedies I have ever seen. It's able to not only show us the world of the less fortunate, but it is able to show us how they are able to get by day to day and their simple pleasures in life that the rich can't understand.\n\nPreston Sturges' writing is absolutely magnificent; he is able to give us just the right doses of comedy and just the right amount of seriousness. His direction is also incredible; he gets the maximum performances out of the bit players and just the right amount of hopelessness from the actors portraying the poor. Joel McCrea and Veronica Lake also give outstanding performances, all-in-all Sullivan's Travels is really a masterpiece. Definitely worth checking out.\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard01-17.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard01-17.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard02-16.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard02-16.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard03-17.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard03-17.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard04-17.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard04-17.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard05-15.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard05-15.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard06-10.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard06-10.png&lt;/a&gt;\n\n-------my rip-----\n\nCriterion extras:\n\ncommentary track\n\ntrailer\n\nPreston Sturges: The Rise and Fall of an American Dreamer 76 minute documentary by Kenneth Bowser for the PBS's &quot;American Masters&quot; series\n\nInterview with Preston Sturges' widow Sandy Sturges\n\n3 audio recordings by Preston Sturges presented as 1 mp3:\nInterviewed by Hedda Hopper\nReciting &quot;If I were King&quot;\nSinging &quot;My Love&quot;\n\n~~~~~~ Sullivan's Travels.avi ~~~~~~\n\n\n\nFile Size (in bytes):...........................1,162,166,272\n\n\n\n--- Video Information ---\n\nVideo Codec Name:...............................XviD ISO MPEG-4\n\nDuration (hh:mm:ss):............................1:30:37\n\nFrame Count:....................................130335\n\nFrame Width (pixels):...........................592\n\nFrame Height (pixels):..........................448\n\nAspect Ratio:...................................1.321\n\nFrames Per Second:..............................23.976\n\nVideo Bitrate (kbps):...........................1440\n\n......MPEG-4......B-VOP........................\n\nQuality Factor (bits/pixel)/frame:..............0.226&quot;\n\n\n\n--- Audio Information ---\n\nAudio Codec:....................................0x0055 MPEG-1 Layer 3\n\nAudio Sample Rate (Hz):.........................48000\n\nAudio Bitrate(kbps):............................128\n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR\n\nAudio Channel Count:............................2\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE ","torrent":{"xt":"urn:btih:8c86e5d390d32198506ec2cb7399ccc287a23f12","amp;dn":"Preston+Sturges+-+Sullivan%5C%27s+Travels+%281941%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c86e5d390d32198506ec2cb7399ccc287a23f12","infoHashBuffer":{"type":"Buffer","data":[140,134,229,211,144,211,33,152,80,110,194,203,115,153,204,194,135,162,63,18]},"announce":[],"urlList":[]}}