{"title":"Highway to Heaven - S01E05 - Song of the Wild West","uid":4290305,"size":367115850,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8ca294a616d6d2d076fb4b409ccd0771ccc8222f&amp;dn=Highway+to+Heaven+-+S01E05+-+Song+of+the+Wild+West&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alliedforces","files":3,"time":1215877543,"description":" 5. Song of the Wild West   \nCommunity Score\n8.4 Great\nFirst aired: 10/17/1984\n\nThe guys&amp;#039; latest assignment is reunite a broken family. Evelyn Higgins left her husband Tim and baby daughter \nSarah in search of a career in music and Tim never forgave her for it, even going as far as telling their daughter \nthat her mother has died. Evelyn had a fairly successful career after changing her name to Patsy Maynard, but \nguilt and sorrow over her past life have led her to become a lush and a has-been who can only get gigs playing \nsmall honkey-tonk bars. She is set to play one such place right outside her old hometown and her daughter eagerly \ncomes to see her, having no idea that the singer is her mother. Sarah shares her mother&amp;#039;s love of music and wants \nto be a professional country singer, against the wishes of her father who fears losing his daughter the same way he\n lost his wife. Jonathan and Mark go to work in the bar/casino where Patsy sings. Through a little investigative work, \nMark discovers that the owner of the place is a crook who is rigging every game. Jonathan finds out that the former \nowner lost the place in one of Nick&amp;#039;s crooked games and died of a broken heart, while his wife Trudy stayed on as \ncook because she had nowhere else to go.\n\nWriter: Mary Ann Kasica, Michael Scheff\nDirector: Victor French\nGuest star: Chip Johnson (Harry Harris), Jerry Hardin (Tim Higgins), Clifton James (Nick Claybourne), Joan Kjar \n(Trudy Swenson), Ronee Blakley (Patsy Maynard), J.S. Young (Man), Michele Greene (Sara Higgins) ","torrent":{"xt":"urn:btih:8ca294a616d6d2d076fb4b409ccd0771ccc8222f","amp;dn":"Highway+to+Heaven+-+S01E05+-+Song+of+the+Wild+West","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca294a616d6d2d076fb4b409ccd0771ccc8222f","infoHashBuffer":{"type":"Buffer","data":[140,162,148,166,22,214,210,208,118,251,75,64,156,205,7,113,204,200,34,47]},"announce":[],"urlList":[]}}