{"title":"The Snipes (ex Cock Sparrer, Rezillos, Guttersnipes, Carpettes)","uid":4456710,"size":52214609,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8d11e072dba27b79f17b14cc46dfd38334bd9ac1&amp;dn=The+Snipes+%28ex+Cock+Sparrer%2C+Rezillos%2C+Guttersnipes%2C+Carpettes%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kronen","files":7,"time":1224517344,"description":"Latest tracks from &amp;#039;The Snipes&amp;#039;\n\nGlasgows Finest Music Maestros\n\nfor more details\n\nThe Snipes were formed in May 2007 when ex-Cock Sparrer &amp; Guttersnipes guitarist Shug O&amp;#039;Neill, was dragged kicking and screaming out of retirement by ex-Revillos bass player Mekon. The pair were introduced by Alex from Ex Cathedra and were amazed that two esteemed Punk Rock musicians should finally meet up in Barrhead (Glasgow) of all places! Following the fifth and final Guttersnipes album and subsequent European tour, Shug retired to chill out, get stoned and take up gardening! Mekon soon put him straight. Following a Japanese tour with the Revillos Mekon also took to a sabbatical to start a family but was now itching to play some more musical mayhem. The line-up was completed by the recruitment of ex-Carpettes drummer Jim Cosgrove. Although the initial idea was to have some fun and do the band for a laugh, the trio soon realised what a potent mix the Guttersnipes, Cock Sparrer, Revillos and Carpettes could be. Shug started writing new songs and gigs in Glasgow, Paisley, Kilmarnock and Barrhead established the Snipes as top quality Punk band. A potent blend of &quot;Oi&quot; &quot;Surf Rock&quot; and even a pinch of &quot;Glam&quot; have got chilly Jockoland jumping up and down. The band has now been taken up by the &quot;McWilliams Muzik Management Group (Bad Boy Promotions)&quot; and is currently recording their first album. The album should hopefully be released by Xmas (brillyant prezzie, by the way!). Onwards and upwards, Punk Rock is back, BIG STYLE! Skol, Prost, Nastrovy &amp; Cheers.","torrent":{"xt":"urn:btih:8d11e072dba27b79f17b14cc46dfd38334bd9ac1","amp;dn":"The+Snipes+%28ex+Cock+Sparrer%2C+Rezillos%2C+Guttersnipes%2C+Carpettes%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d11e072dba27b79f17b14cc46dfd38334bd9ac1","infoHashBuffer":{"type":"Buffer","data":[141,17,224,114,219,162,123,121,241,123,20,204,70,223,211,131,52,189,154,193]},"announce":[],"urlList":[]}}