{"title":"ROMULUS, MY FATHER . NVEE.divx","uid":8283137,"size":1257401494,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8dc999f15a28b0962104a5c92aacf9246baa713b&amp;dn=ROMULUS%2C+MY+FATHER+.+NVEE.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".NVEE","files":1,"time":1363885877,"description":"Plot\n\n\nRomulus Gaita fled his Romanian hometown of Markovac in 1935 at the age of 13. He found work as a blacksmith's apprentice until he was 17, after which he moved to Germany and eventually emigrated to Australia on an assisted passage in 1950 at the age of 28, with his young wife Christine and their four-year-old son Raimond soon after the end of World War II. Romulus and his family were transferred to Bonegilla Migrant Reception and Training Centre, a camp near Wodonga. Romulus was then sent to Baringhup on the Loddon River, where he met two Romanian brothers Pantelimon (known as Hora) and Dumitru (known as Mitru).\nThe Gaitas later moved to a farmhouse called Frogmore where they lived for the next ten years, and where Raimond spent much of his childhood.\nChristine did not stay at Frogmore to take on the responsibility as a wife and mother. She had an affair with Mitru and moved to Melbourne to be with him. Together they had two daughters. Mitru committed suicide before the birth of the second child, and Christine later also committed suicide. Both daughters were adopted. Raimond observes in retrospect that Christine likely had a mental illness.\nAfter some attempts at farming, Romulus established a business supplying wrought iron furniture, popular at the time, and using some of the skills he brought from his native country.\nRomulus also suffered from mental illness, requiring admission to a psychiatric hospital. While Romulus was unable to care for Raimond, Hora came to live with Raimond and cared for him.\nRomulus later largely recovered from his mental illness, and saw Raimond live to adulthood and pursue his chosen career. Romulus later suffered heart problems and eventually died of a blood clot.\n\n\n\nPLEASE SEED !!!","torrent":{"xt":"urn:btih:8dc999f15a28b0962104a5c92aacf9246baa713b","amp;dn":"ROMULUS%2C+MY+FATHER+.+NVEE.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc999f15a28b0962104a5c92aacf9246baa713b","infoHashBuffer":{"type":"Buffer","data":[141,201,153,241,90,40,176,150,33,4,165,201,42,172,249,36,107,170,113,59]},"announce":[],"urlList":[]}}