{"title":"World Fascism: A Historical Encyclopedia","uid":11719173,"size":17783589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ecf2fdfacebcbe2a0eaf0cb7ec6d716e618a982&amp;dn=World+Fascism%3A+A+Historical+Encyclopedia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424733635,"description":"From the followers of Hajj Amin Al-Husseini, the Arab leader who met with Adolf Hitler in November 1942 to the murderous death squads of the Croatian Ustasha to certain members of the British Establishment, fascism's heady brew of extreme nationalism and revolutionary violence has attracted followers from across all religions, races, and classes. Now widely reviled, fascism became an immensely powerful political force in Western Europe throughout the 1930s and into the 1940s. How did civilized nations like Italy, Germany, Austria, and others succumb to an ideology now regarded by the political mainstream as barbarous and beyond the pale?\n\nWorld Fascism: A Historical Encyclopedia covers all the key personalities and movements throughout the history of fascism and brings to light some of the ideology's lesser-known aspects, from Hindu extremists in India to the influential role of certain women in fascist movements. How did an ideology which was openly boastful of its belief in violence come to seduce the elites of some of the most civilized nations on earth? What can explain fascism's enduring appeal?","torrent":{"xt":"urn:btih:8ecf2fdfacebcbe2a0eaf0cb7ec6d716e618a982","amp;dn":"World+Fascism%3A+A+Historical+Encyclopedia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ecf2fdfacebcbe2a0eaf0cb7ec6d716e618a982","infoHashBuffer":{"type":"Buffer","data":[142,207,47,223,172,235,203,226,160,234,240,203,126,198,215,22,230,24,169,130]},"announce":[],"urlList":[]}}