{"title":"Corbin Fisher - - - Best Buds 2 ((MictrmbL))","uid":4964354,"size":205657675,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:8fc7517a4d6e2a21141c2b0b2b3541123732247f&amp;dn=Corbin+Fisher+-+-+-+Best+Buds+2+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mictrmbl","files":50,"time":1245456173,"description":"From the vaults of Corbin Fisher:\n\n\nThis is one we've all been waiting to see for a long, long time now! But beyond it being a long-awaited treat for all of us viewers, it's also a long-awaited and incredible moment for TJ and Ben - two best buds who, for the very first time ever, touch, kiss, lick, suck, and get one another off with intense, full contact! This goes way beyond jerking off next to one another like we've seen before! We see two hot young college studs who've been best buds for years and shared so much taking things to a whole new level as they get each other off!\n\nThe image of one hot young college stud with his best buddy's cock in his mouth is too hot to describe, and seeing these guys have at one another and stroke, kiss and suck their friend is enough to make you almost pass out!\n\nThe way these guys interact as this video kicks off is priceless, and it is obvious there's a great deal of nervousness, anxiety and tension as things start up. I can only imagine what was going through Ben and TJ's heads as they thought about what they were about to do!\n\nBut something else that makes this video priceless are some of the things the guys told me after it was filmed. Ben admitted that he'd thought about doing what the guys do in this video long before either of them ever arrived here at CFU. When I asked him why he'd never tried anything or why, after being best buds for so long and being so close, nothing had ever happened, Ben thought about it for awhile and said, &quot;Well... if either of us was ever horny, we'd just go out and find chicks together. We'd find girls to fuck. We'd never do anything together.&quot; But as they each arrived here at CFU and each progressed through their CF Educations, getting into some hot and heavy hardcore action with some of CF's other studs, they each realized it was only a matter of time before I asked them to try doing stuff together for us. One at a time, TJ and Ben both confessed that as they each came to that realization on their own, they were both freaked out as well as intrigued by it - and possibly even looking forward to the day I'd ask them to get it on with one another!\n\nWell... here it is! A monumental video not only for us, but also for TJ and Ben as their friendship hits a whole new level and we see them kiss, stroke, touch, rub, feel, and suck one another to a pair of killer best bud climaxes!","torrent":{"xt":"urn:btih:8fc7517a4d6e2a21141c2b0b2b3541123732247f","amp;dn":"Corbin+Fisher+-+-+-+Best+Buds+2+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fc7517a4d6e2a21141c2b0b2b3541123732247f","infoHashBuffer":{"type":"Buffer","data":[143,199,81,122,77,110,42,33,20,28,43,11,43,53,65,18,55,50,36,127]},"announce":[],"urlList":[]}}