{"title":"Kruptos.2.Professional.v3.0.0.15.Incl.Keygen-Lz0","uid":6579208,"size":7026848,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:902827a0b08dc104f160b5e022090e7617748386&amp;dn=Kruptos.2.Professional.v3.0.0.15.Incl.Keygen-Lz0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1312342273,"description":"Kruptos 2 Professional v3.0.0.15\n\nKruptos 2 Professional is a powerful and easy to use file encryption program that stops unwanted people from looking at files stored on your computer including Photos, Movies, Music and documents. Kruptos 2 Professional makes it easy to secure your sensitive files. There are no complex options or settings. Once insalled, all you need is a good password and a few clicks! Kruptos 2 Professional includes a comprehensive set of security tools which help improve your file security.\n\n\nFeatures and Benefits:\n\nWorks with any file,\nEncrypts any number of files and folders including: photos, movies, music and sensitive documents.\n\nSecurely delete your files\nThoroughly delete and remove files and all their traces from your computer in a secure way so they cannot be recovered by common undelete tools.\n\nMicrosoft Windows integration\nFile encryption is easy when using Microsoft Windows Explorer right-click menus. You can secure your files in as little as two clicks\n\nDouble-click intergration\nMakes it easy to open, edit and save encrypted files - Kruptos 2 Professioanl will automatically re-encrypts your file when you're finished editing.\n\nCreate self-extracting packages\nCreate self-decrypting versions of your files. This allows you to send an encrypted file to someone who does not have the software. All they need is the password!\n\nEasy to use\nKruptos 2 Professional has been designed with ease of use in mind; there are no complex options or settings. You can encrypt your files in as little as 2 clicks.\n\nPeace of mind\nUses proven and unbroken file encryption algorithms, no hidden back doors or secret keys. Your encrypted files can only be accessed with your password.\n\nKruptos 2 Professional uses the Blowfish algorithm in CBC mode for file encryption. SHA256 is used for key generation which is stretched and salted.\nFile Encryption for Windows\n\nRequirements\nMicrosoft Windows 2000, XP, Vista or Windows 7\n\nMicrosoft 64 bit Windows 7 and 64 bit Vista\n\nHome Page - http://www.kruptos2.co.uk/\n\n\n","torrent":{"xt":"urn:btih:902827a0b08dc104f160b5e022090e7617748386","amp;dn":"Kruptos.2.Professional.v3.0.0.15.Incl.Keygen-Lz0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"902827a0b08dc104f160b5e022090e7617748386","infoHashBuffer":{"type":"Buffer","data":[144,40,39,160,176,141,193,4,241,96,181,224,34,9,14,118,23,116,131,134]},"announce":[],"urlList":[]}}