{"title":"Famous Fantastic Mysteries - complete run","uid":10409220,"size":8011249270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91991a739c411c2bbb06f4f10ad7b06699e5d460&amp;dn=Famous+Fantastic+Mysteries+-+complete+run&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Gorgon776","files":94,"time":1403504955,"description":"A magazine founded to reprint fantasy and sf material from the old Frank A. Munsey magazines (Argosy, All-Story, etc.). It became popular in its initial year. Some novels were serialised in the early issues, until the companion Fantastic Novels was started and began publishing complete novels. (The latter, however, had only 5 issues at that time and was combined back into FFM). The covers were only coloured story listings until Feb 1940, when paintings by F. Paul and V. Finlay began. After FFM was bought by Popular Pubs, in 1943 the fiction policy changed to the reprinting of novels that had previously appeared only in book form. Some quite good works were presented; these are covered below. From Aug 1947 to Apr 1950 there was a section &quot;Masters of Fantasy&quot; (drawings and a short appreciation) by N. Austin. The magazine became &quot;streamlined&quot; from Jan 1951 - smaller in size and with no advertisements - but soon returned to its older format. Lawrence was the principal artist; in conjunction with Fantastic Novels, portfolios of work by Lawrence and V. Finlay were published. Popular's FFM also had Fantastic Novels (2nd series) as a companion for a period, as well as A. Merritt's Fantasy and Super Science Stories' (2nd series). The Munsey FFM was used as a source for the fiction in the Canadian Super Science (Feb 1945 - Dec 1945).\n\nThis torrent is part of the SF collection, and contains all 81 issues published. Please help seed this torrent.\n\nThe &quot;Torrent&quot; folder contains torrent files for the previously released parts of the collection. Read the &quot;Read Me (Important).txt) file for more information about the scans and where to find them.\n\nFilenames have been harmonized with Carlo's list (2014-05-18 version).","torrent":{"xt":"urn:btih:91991a739c411c2bbb06f4f10ad7b06699e5d460","amp;dn":"Famous+Fantastic+Mysteries+-+complete+run","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91991a739c411c2bbb06f4f10ad7b06699e5d460","infoHashBuffer":{"type":"Buffer","data":[145,153,26,115,156,65,28,43,187,6,244,241,10,215,176,102,153,229,212,96]},"announce":[],"urlList":[]}}