{"title":"Anna.Nicole.2011.720p.BRRip.XviD.AC3.5 1-eXceSs","uid":6812929,"size":2429526590,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:91d61ed104ccb5e354857ab02ed272b6acc1b891&amp;dn=Anna.Nicole.2011.720p.BRRip.XviD.AC3.5+1-eXceSs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1321095712,"description":"Anna.Nicole.2011.720p.BRRip.XviD.AC3.5 1-eXceSs\n\nA young Playboy model, an octogenarian billionaire husband, intrusive media fascination and a tragically early death. This is a roller-coaster of a real contemporary life for a blockbuster of a contemporary opera by the acclaimed opera composer Mark-Anthony Turnage (Greek and The Silver Tassie) and librettist Richard Thomas (Jerry Springer: the Opera). The story of Anna Nicole Smith is under the brilliant and idiosyncratic direction of Richard Jones and the baton of Antonio Pappano, Music Director of The Royal Opera, to make this a major event of the Royal Opera Season.Sex, extreme language and drug abuse are part of the opera  after all, they were ingredients in a life that went from the dubious glamour of the sex symbol, through long and vicious legal struggles to a fatal overdose. How Anna Nicole was treated and how she was viewed is as much a reflection of the society that hounded her as of her own feelings and ambitions  Eva-Maria Westbroek creates what is a challenging and complex central role. This new opera is provocative in its themes, exciting in its bravura style and thrilling with its sheer contemporary nerve. Anna Nicole Smiths life made the news  you can bet this world premiere will too.\n\nsharedump.org","torrent":{"xt":"urn:btih:91d61ed104ccb5e354857ab02ed272b6acc1b891","amp;dn":"Anna.Nicole.2011.720p.BRRip.XviD.AC3.5+1-eXceSs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d61ed104ccb5e354857ab02ed272b6acc1b891","infoHashBuffer":{"type":"Buffer","data":[145,214,30,209,4,204,181,227,84,133,122,176,46,210,114,182,172,193,184,145]},"announce":[],"urlList":[]}}