{"title":"Head-Save_Me_From_Myself-2008-PMS","uid":4387078,"size":111600483,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:91f48d7ff92d7ad10ab0c24b75128ddbf7d31b37&amp;dn=Head-Save_Me_From_Myself-2008-PMS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ramshire","files":17,"time":1220973513,"description":"Brian &amp;#039;Head&amp;#039; Welch left his band Korn in 2005 to dedicate his life to Christianity. After releasing a book, Head finally released his debut album of the same name, &quot;Save Me From Myself.&quot; Vocals, Guitars and Keys by Head. Drums by Josh Freese (Nine Inch Nails, Devo, The Vandals). Bass by Tony Levin (King Crimson, Peter Gabriel). \n\nNote: Album formally known as &amp;#039;It&amp;#039;s Time To See Religion Die&amp;#039;\n\nIncludes album art.\n\nTrack listing:\n\n1 L.O.V.E  - 6:31\n2 Flush - 4:26\n3 Loyalty - 5:07\n4 Re-Bel - 5:40\n5 Home - 6:52\n6 Save Me From Myself - 5:44\n7 Die Religion Die - 5:34\n8 Adonai - 5:19\n9 Money - 4:43\n10 Shake - 4:48\n11 Washed By Blood - 9:34\n\nFiles:\n\n00-head-save_me_from_myself-2008.m3u\t239 Bytes\n00-head-save_me_from_myself-2008.nfo\t1.1 KB\n00-head-save_me_from_myself-2008.sfv\t349 Bytes\n00-head-save_me_from_myself-back-2008.jpg\t1.1 MB\n00-head-save_me_from_myself-front-2008.jpg\t1.9 MB\n01-head-l.o.v.e..mp3\t10.3 MB\n02-head-flush.mp3\t7 MB\n03-head-loyalty.mp3\t8.4 MB\n04-head-re-bel.mp3\t9 MB\n05-head-home.mp3\t10.6 MB\n06-head-save_me_from_myself.mp3\t9.4 MB\n07-head-die_religion_die.mp3\t9.3 MB\n08-head-adonai.mp3\t9.4 MB\n09-head-money.mp3\t8 MB\n10-head-shake.mp3\t7.3 MB\n11-head-washed_by_blood.mp3\t15 MB\n\nwww.brianheadwelch.net\nwww.headfreaks.com\nwww.drivenmusicgroup.net\n\nWildy&amp;#039;s World - Music Review\n\n\nBrian &quot;Head&quot; Welch rocketed to stardom as the guitarist for Korn. Head helped to craft the signature sound that helped Korn sell 30 million albums through 2005, when he departed the multi-platinum band for personal reasons. Faced with single fatherhood, Head decided it was time to clean up his act, quit the wild drug-filled lifestyle he&amp;#039;d lived with Korn, but continue to make music. Imbued with his faith and a positive message, Save Me From Myself is the musical catharsis of all these life changes. Head talks about his experiences in these songs, drawing a positive message from his former lifestyle, the transformation he underwent and his belief in a higher power. Korn fans will be thrilled to know that for all of the changes, Head&amp;#039;s signature guitar sound has not softened in any way. He still rocks out with the best of them.\n\nSave Me From Myself is a mea culpa of sorts, both admitting wrong and asking Head&amp;#039;s higher power for forgiveness and salvation. The lead single, Flush is about ridding one&amp;#039;s life of all bad things, bad influences and bad decisions/behavior. Song is very explicit in describing, in general terms, the decline Head saw in himself at one time (&quot;Life is boring / simple story / Get drunk - throw up / sleep all day / I am something I&amp;#039;m not nothing / I can&amp;#039;t let myself decay&quot;). Save Me From Myself is very strong willed and positive. Head mentions, in abstract, some of the mistakes he&amp;#039;s made while resolving not to do so again; all the while counseling his listeners to avoid his mistakes.\n\nThat said, Save Me From Myself is not preachy. Head sticks to his positive message through most of the album, focusing instead on his own failings and the steps he needs to take to be penitent. One of the musical effects that I love about this album is the stark contrasts in harmonics on certain songs (Save Me From Myself, Loyalty). The primary sound is from guitar/bass and keys. These two parts are made to coexist but never quite meld. Based on several listens I&amp;#039;ve come to the conclusion this is intentional. There is a sonic dissonance that seems to parallel the cognitive dissonance that exists between where Head is and where he was.\n\nSave Me From Myself is a top notch album. I highly recommend it, regardless your relgion or philosophy, if you love great heavy rock, this album is for you.\t\t","torrent":{"xt":"urn:btih:91f48d7ff92d7ad10ab0c24b75128ddbf7d31b37","amp;dn":"Head-Save_Me_From_Myself-2008-PMS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91f48d7ff92d7ad10ab0c24b75128ddbf7d31b37","infoHashBuffer":{"type":"Buffer","data":[145,244,141,127,249,45,122,209,10,176,194,75,117,18,141,219,247,211,27,55]},"announce":[],"urlList":[]}}