{"title":"The Magnesium Miracle","uid":11060486,"size":1328472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92bbd5b0facd6d0a2a27898c73f3cff34e715ca5&amp;dn=The+Magnesium+Miracle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ShadowRaven66669","files":1,"time":1411164293,"description":"More than seventy-five years ago, medical scientists declared magnesium to be an essential nutrient, indispensable to life. When this mineral is part of your diet, you are guarding against and helping to alleviate health threats such as heart disease, stroke, osteoporosis, diabetes, depression, arthritis, and asthma. But while research continues to reaffirm magnesium's irreplaceable contribution to good health, many Americans remain dangerously deficient.\n\nIn The Miracle of Magnesium, Dr. Carolyn Dean, an authority on this mineral who has used it with dramatic success in her own practice, explains the vital role that magnesium plays in the control of many serious ailments from painful muscle spasms and bladder problems to traumatic brain injury and complications of pregnancy and childbirth. Inside you will discover\n\n? How diets and lifestyles can create a dangerous magnesium deficiency\n? Which magnesium-rich foods keep your vital organs healthy and which to avoid\n? Why other nutrients, including calcium, need magnesium to become potent\n? What vitamins and minerals work with magnesium to treat specific ailments\n? Why prescription medicines, such as birth control pills, can deplete magnesium\n? Which magnesium supplements are best for you\n\nWhether you need help with a serious health problem or merely want to protect the good health you already enjoy, The Miracle of Magnesium will answer all your questions. It may even save your life. ","torrent":{"xt":"urn:btih:92bbd5b0facd6d0a2a27898c73f3cff34e715ca5","amp;dn":"The+Magnesium+Miracle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92bbd5b0facd6d0a2a27898c73f3cff34e715ca5","infoHashBuffer":{"type":"Buffer","data":[146,187,213,176,250,205,109,10,42,39,137,140,115,243,207,243,78,113,92,165]},"announce":[],"urlList":[]}}