{"title":"Coast to Coast AM March 29 2013","uid":8328705,"size":57394749,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:92c94a61a78262477c56eef4a2a53cc7caab0fc9&amp;dn=Coast+to+Coast+AM+March+29+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1364840278,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-29-13\nHost: \tJohn B. Wells\nGuests: \tOpen Lines, Vince Mazur\n\nFilling in for George, John B. Wells welcomed Vince Mazur, president and founder of Mazur Instruments, for a discussion on his company's radiation detection equipment. Mazur said he developed handheld Geiger counters so consumers and hobbyists could be aware of radiation levels in the things around them. &quot;If you don't have some sort of instrument... you're completely a hundred percent certain that you have no idea what's in your environment,&quot; he cautioned. Mazur shared a report about elevator buttons in France that were made from recycled metal containing nuclear waste, as well as a story about radioactive metal tissue boxes sold by a major home goods chain. A week spent near one of these 'hot' tissue boxes was equivalent to getting a chest x-ray, he revealed.\n\nMazur provided advice on selecting a personal Geiger counter, noting the importance the sensing tube. Lower cost tubes only detect gamma and x-rays, not alpha and beta radiation, he explained. Another key capability is always-on-monitoring similar to a smoke detector, Mazur added. He reported on radioactive energy pendants that some people are buying for supposed health benefits (a hypothesis called radiation hormesis). The pendants have been found to contain thorium-232 and uranium-238, Mazur said, pointing out how wearing one for three months exceeds the 5000 mR/year occupational limit for a nuclear power plant worker. He also spoke about using Geiger counters to validate certain antiques, testing water filters for radiation, and how one of his company's instruments was used to show a family that it was safe for them to move back into their house.\n\n-------------------------------------------------\n\nOpen Lines followed in the latter half of the program. Several callers shared their thoughts on topics such as gun control and politics. Gary from Houston, Texas, railed against the political forces that ordinary citizens are up against in the battle for domestic control of America. He identified Valerie Jarrett, a Senior Advisor to the President Obama, as the one who actually sets the nation's foreign policy. He also blamed government unions for ramming through the Patient Protection and Affordable Care Act (Obamacare), and called for more liberty and less equality. Mary in Tennessee told John about a frightening experience she had walking to her car after a night class. Mary described hearing a non-human guttural sound that was unlike any animal she could recognize. She said the terrifying snarl sent chills through her body and drew her attention to an area of campus where she saw a dark shape move quickly through some trees.\nWebsite(s):\n\n    mazurinstruments.com\n\n","torrent":{"xt":"urn:btih:92c94a61a78262477c56eef4a2a53cc7caab0fc9","amp;dn":"Coast+to+Coast+AM+March+29+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c94a61a78262477c56eef4a2a53cc7caab0fc9","infoHashBuffer":{"type":"Buffer","data":[146,201,74,97,167,130,98,71,124,86,238,244,162,165,60,199,202,171,15,201]},"announce":[],"urlList":[]}}