{"title":"Warmaster - The End Of Humanity (2013)","uid":11651591,"size":108716394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94671168ffccb524f40bd7435b1c8158638eaa4d&amp;dn=Warmaster+-+The+End+Of+Humanity+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"analogkid6103","files":11,"time":1417883664,"description":"01-Massive kill capacity\n02-Nuclear warfare\n03-Deadly artillery\n04-Dead factory\n05-The target\n06-Lies to deny\n07-Barbarians\n08-Poison dwarfs\n09-Ancient anthem\n10-Madestrijder voor volk en vaderland\n11-Destroyer of worlds\n\nLabel: Dead Beat Media\n\n\nPretty damn obvious where this one's coming from. War-themed death metal wholly derivative of mid-period Bolt Thrower, Asphyx, and maybe a dash of Hail Of Bullets (might as well toss 'em in here, as well), and you have the Netherlands' Warmaster in a nutshell. You could just hear it: lots of old school fueled heavy riffs, a great deal of crunch delivered by the dropping of the proverbial two-ton weight, gruff vocals delivering soliloquies to all things war related, etc. You'll immediately write this one off as an easy &quot;7&quot; based on this description alone (as I've done), but there's enough promise here for you to take notice of, and for me to write about (albeit, briefly), for that matter.\n\nNaturally, it's all about the riffs and the sheer density of the music, and, for the most part, Warmaster succeeds in this all important department. Gigantic riffs abound on The End Of Humanity, and the bass is a noticeably thick presence within the bottom end. At times, the riffs are world class, so much so that I've felt compelled enough to write about it, rather than just tweeting the album as an enjoyable knockoff treading the ground laid down years ago by much more formidable bands.\n\nTake a gander at the riffs on songs such as &quot;Death Factory.&quot; Yeah, you've heard it all before, but death metal in this particular style is just so goddamn enjoyable, you can't help but have a smile creep across your face as your neck snaps. Simple music for complicated times; I see this kind of death metal as comfort food, regardless of the artists' intent with serious themes.\n\nNot all is good, though; hence, the lower score. Compared to giants in the genre, Warmaster doesn't compare very favorably. The drums are poorly mixed, being very nearly buried under an avalanche of riffs and bass. The drums should really snap, sort of like the last two albums from Asphyx, but they don't, drastically reducing the album's impact. Vocalist Corne Bijlemeer is merely adequate, growling and grunting his way through the material in a sufficient manner, but he simply cannot stack up to the gigantic riffing.\n\nWhat does the future hold for Warmaster? Nothing except being forgotten as a barely second tier band and not much else unless the mixing problems are addressed and a suitable vocalist to match the music's intent is found. But, there's more than a nugget of promise here.\n\n\n\nGenre:\tDeath\nBitrate:\t320 k\nSize:\t103.68 MB\nShow/Hide Files: \t\n11 files","torrent":{"xt":"urn:btih:94671168ffccb524f40bd7435b1c8158638eaa4d","amp;dn":"Warmaster+-+The+End+Of+Humanity+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94671168ffccb524f40bd7435b1c8158638eaa4d","infoHashBuffer":{"type":"Buffer","data":[148,103,17,104,255,204,181,36,244,11,215,67,91,28,129,88,99,142,170,77]},"announce":[],"urlList":[]}}