{"title":"Violent Femmes - The Blind Leading The Naked (1986) (FLAC.EAC.LO","uid":6089218,"size":240290628,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:95636526db3b12bb08a08a9e556b0bd7b3b62c99&amp;dn=Violent+Femmes+-+The+Blind+Leading+The+Naked+%281986%29+%28FLAC.EAC.LO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stainpeter","files":17,"time":1294473663,"description":"Violent Femmes - The Blind Leading The Naked (1986) (FLAC.EAC.LOG)\n\nORIGINAL POST BY:  0.429ftneil 1 year ago\n\nFollowing the darkly eclectic masterpiece 'Hallowed Ground' was always going to be tough but two years later the Femmes re-emerged with their most uplifting and joyful album full of scathing wit, infectious unbeat danceable songs, and more than a nod to the rock 'n' roll spirit of the Rolling Stones. 'The Blind Leading The Naked' was produced by Talking Heads Jerry Harrison and does contain a more polished alt-pop sheen reminiscent of the Heads but as always with Gordon Gano's beautifully skewed vision to the fore. This is the Femmes at their most upbeat and life-affirming with the sound evolving from the stripped down trio into full on rock and pop replete with sax's and rollicking guitars with Brian Ritchie excelling in his multi-instrumentalist role (and gaining his first lead vocal). From the opening 29 second savagery of 'Old Mother Reagan' to 'I Held Her In My Arms' - one of THE greatest songs of the 80's - the gorgeous sentiment of 'Good Friend', the barrel-house gospel call-and-response of 'Faith' , and a truly genius cover of T-Rex's 'Children of The Revolution', this is the Femmes kicking up a joyous racket but still with a dark heart beating on the likes of 'No Killing' and 'Cold Canyon'.\n\nNow long out of print this is the album that confirmed the Femmes as alt-rock's leading exponents of left-field pop brilliance following their incredible debut and the dark beauty of 'Hallowed Ground', they were no &quot;two-album-and-out-flash-in-the-pan&quot;, these guys were here to stay and their influence on the likes of the Pixies and Throwing Muses meant alternative rock would flourish into the 90's and beyond.\n\nRipped using EAC &gt; FLAC 8\nArtwork scanned and tarted up using photoshop\n\nPlease seed this puppy out folks as I only have limited bandwidth/hard drive capacity and I'm aiming to up more Femmes asap (3, Birds Sing, Rock, Viva Wisconsin etc...)\n\nPeace y'all","torrent":{"xt":"urn:btih:95636526db3b12bb08a08a9e556b0bd7b3b62c99","amp;dn":"Violent+Femmes+-+The+Blind+Leading+The+Naked+%281986%29+%28FLAC.EAC.LO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95636526db3b12bb08a08a9e556b0bd7b3b62c99","infoHashBuffer":{"type":"Buffer","data":[149,99,101,38,219,59,18,187,8,160,138,158,85,107,11,215,179,182,44,153]},"announce":[],"urlList":[]}}