{"title":"Yoga Target Zone with Sara Ivanhoe 2 DVD Set x264 aac [MP4]","uid":11810055,"size":2887393436,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9581a99eea8ac519be1e1adbd9f03835c4ba961c&amp;dn=Yoga+Target+Zone+with+Sara+Ivanhoe+2+DVD+Set+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"MANTESH","files":7,"time":1428738274,"description":"\n\n2 disc set includes: Power Weight Loss, Power Tone with Weights, Core Power, Lower Body Power, Power Sweat and a bonus routine: On the Ball Yoga.\n\nTotal body yoga for every day of the week! No time to work out? Sara has developed these fun and powerful yoga routines that target all those pesky trouble spots! If you have 20 minutes a day, you can have that sleek yoga body in no time. Choose between 6 routines throughout the week and mix it up while you burn calories, strengthen your muscles and feel fantastic.\n\nPower Weight Loss: Burn twice the calories in half the time with this heart pumping routine and have a blast.\n\nPower Tone with Weights: Kick it up a notch with hand weights to target and build a powerful upper body.\n\nCore Power: Target your core and build flat and powerful ads with this focused routine. Perfect for all fitness levels.\n\nLower Body Power: Follow Sara's upbeat pace and detailed instruction while you stretch, twist and tone using yoga breathing techniques to provide balance and energy.\n\nPower Sweat: Detox your body and boost your strength and vitality.\n\nBonus - On the Ball Yoga: Ultimate fusion of yoga and ball work that targets your core and provides a powerful mind and body connection","torrent":{"xt":"urn:btih:9581a99eea8ac519be1e1adbd9f03835c4ba961c","amp;dn":"Yoga+Target+Zone+with+Sara+Ivanhoe+2+DVD+Set+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9581a99eea8ac519be1e1adbd9f03835c4ba961c","infoHashBuffer":{"type":"Buffer","data":[149,129,169,158,234,138,197,25,190,30,26,219,217,240,56,53,196,186,150,28]},"announce":[],"urlList":[]}}