{"title":"PrettyDirty - Piper Perri (Good Little Girl Part Three) NEW 06 J","uid":15228418,"size":606450090,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9657e0084f0376529b6725b4c1d82eeb4af03f52&amp;dn=PrettyDirty+-+Piper+Perri+%28Good+Little+Girl+Part+Three%29+NEW+06+J&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1467794496,"description":"Bookworm has noticed a lot of changes since Charity showed up. And even though having Charity as her new big sister, she's a tad jealous of the way Mr. Chase looks at Charity the way he used to look at her Momma. Charity, being the master scheme specialist she is, intends on rustling some leaves. She devises a plan to get Bookworm laid by her stepdad's business partner, Roger. He turns out to be the perfect bait too! He's a dumb guy with his brain on his dick, and the perfect potential pawn for her scheme of reciprocal jealousy. Bookworm gets her schoolgirl makeover and goes to seduce her first boy ever, and Roger takes the bait! Bookworm asks him to give her the sex talk, and with a little coaxing Bookworm convinces Roger to let her touch his penis. He is clearly uncomfortable, but her sweet charm and her good little schoolgirl outfit, he can't resist, kissing her and playing with her tiny body as she stuffs his massive cock into her mouth. Unable to resist what's already begun, he peels off her teen panties and sticks his tongue into her warm and sweet shaved pussy. As Bookworm begs roger to take it easy, roger continues to tear her tiny teen virgin pussy with his massive thick cock, splitting her in two, all while Charity takes video evidence on her phone to use for later!\r\nCategories Blonde, Hardcore, Natural Tits, Small Tits, Teen, 69, Pussy Licking, Petite, Family Roleplay, Feature, Pussy to mouth, Blowjob, Deepthroat, Cumshot, Big Dick, Ass\r\n \nhttp://imgdone.com/viewer.php?file=29499378969667505918.jpg\r\n \nhttp://imgdone.com/viewer.php?file=35613637114442133670.jpg","torrent":{"xt":"urn:btih:9657e0084f0376529b6725b4c1d82eeb4af03f52","amp;dn":"PrettyDirty+-+Piper+Perri+%28Good+Little+Girl+Part+Three%29+NEW+06+J","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9657e0084f0376529b6725b4c1d82eeb4af03f52","infoHashBuffer":{"type":"Buffer","data":[150,87,224,8,79,3,118,82,155,103,37,180,193,216,46,235,74,240,63,82]},"announce":[],"urlList":[]}}