{"title":"The Economist 23-29nov.pdf","uid":9236740,"size":106889815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96e0b6519e742f6552473cc006c5635067e4f537&amp;dn=The+Economist+23-29nov.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1385190562,"description":"The Economist is an English-language weekly news and international affairs publication owned by The Economist Newspaper Ltd. and edited in offices in London.[2][3] Continuous publication began under founder James Wilson in September 1843. For historical reasons The Economist refers to itself as a newspaper, but each print edition appears on small glossy paper like a news magazine, and its YouTube channel is called EconomistMagazine.[4] In 2006, its average weekly circulation was reported to be 1.5 million, about half of which were sold in the United States.[5]\n\nThe publication belongs to The Economist Group, half of which is owned by Pearson PLC via the Financial Times. A group of independent shareholders, including many members of the staff and the Rothschild banking family of England,[6] owns the rest. A board of trustees formally appoints the editor, who cannot be removed without its permission. About two-thirds of the 75 staff journalists are based in London, although The Economist has a global emphasis and scope.[7]\n\nThe Economist claims that it &quot;is not a chronicle of economics&quot;.[8] Rather, it aims &quot;to take part in a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress&quot;.[9] It takes an editorial stance of classical and economic liberalism which is supportive of free trade, globalisation, free immigration and socially liberal causes (such as supporting legal recognition for same-sex marriage).\n\nIt targets highly educated readers and claims an audience containing many influential executives and policy-makers.[10][third-party source needed] Some of The Economist readers consume both elite and mass media. The newspaper's CEO described this recent global change, which was first noticed in the 1990s and accelerated in the beginning of the 21st century, as a &quot;new age of Mass Intelligence\n","torrent":{"xt":"urn:btih:96e0b6519e742f6552473cc006c5635067e4f537","amp;dn":"The+Economist+23-29nov.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96e0b6519e742f6552473cc006c5635067e4f537","infoHashBuffer":{"type":"Buffer","data":[150,224,182,81,158,116,47,101,82,71,60,192,6,197,99,80,103,228,245,55]},"announce":[],"urlList":[]}}