{"title":"Sal Mineo - The Complete Epic Recordings (2002)","uid":8691966,"size":369702843,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:971e5acbb86af2d0a2106dca85cba62fdab0235b&amp;dn=Sal+Mineo+-+The+Complete+Epic+Recordings+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":34,"time":1373899963,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nSal Mineo - The Complete Epic Recordings (2002)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41V70HPTFWL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41V70HPTFWL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Linda Seida):\n\nSal Mineo already had a solid acting career when he started putting out records. Before he released his first single, he had appeared in several major productions on Broadway and in films. When he turned to rock &amp; roll, his first efforts were equally successful. In 1957 he released a pair of singles, &quot;Start Movin' (In My Direction)&quot; and &quot;Lasting Love.&quot; The former broke into the Top Ten and remained in the Top 40 for more than three months, while the latter hit number 27. Mineo proceeded to release an album through Epic in the U.S. and Philips in Great Britain. His other singles included &quot;You Shouldn't Do That,&quot; &quot;Little Pigeon,&quot; &quot;Love Affair,&quot; and &quot;Party Time.&quot; He began as a child actor, making his debut with Eli Wallach and Maureen Stapleton in the 1951 Broadway production of The Rose Tattoo. The following year he joined the cast of The King and I, playing a prince to Yul Brynner's king. The work kept coming, taking him into films in 1955 with roles in The Private War of Major Benson and Six Bridges to Cross. That same year Mineo stepped into what was perhaps his most memorable movie, Rebel Without a Cause, alongside James Dean. Eventually he appeared in more than 30 movies and garnered a pair of Oscar nominations. His awards included an Emmy and a Golden Globe, and he also worked in television. By the late '60s, the quality of the roles that came his way diminished, and his last was in 1971 as a primate in Escape From the Planet of the Apes. With music and movies behind him, Mineo turned to directing. He took Fortune and Men's Eyes to Broadway in 1969, and achieved similar success with the production in Los Angeles. He was slated to appear in Hollywood in another play, P.S. Your Cat Is Dead, when an assailant stabbed him to death near his home in 1976. His attacker later received a life sentence. Mineo's early years were troubled. His Sicilian father, Sal Mineo Sr., was a casket maker in the Bronx. His mother, Josephine, made the eight-year-old Sal Jr. take dancing lessons after he'd been kicked out of elementary school. Her attempts to keep her troubled son out of further scrapes failed and Mineo, a gang member, was caught in a robbery two years later. Given a choice between acting school and reform school, he chose what he undoubtedly saw as the lesser of two evils. With two years he landed on Broadway.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/sal-mineo-p36125/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/sal-mineo-p36125/biography&lt;/a&gt;\n\nAll Music Album Review (by Gregory McIntosh):\n\nGenerous enough to make this set the best collection of Sal Mineo's work available, The Complete Epic Recordings is a hefty 27-track document of Mineo's time spent at Epic Records. It contains, as the title informs, everything Mineo recorded for the label starting with his most well-known cut, &quot;Start Movin' (In My Direction),&quot; on through his lesser recognized material as well as two previously unreleased tracks, &quot;Dino&quot; and &quot;Part of a Fool.&quot;\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-complete-epic-recordings-r581635&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-complete-epic-recordings-r581635&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000063CNW&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000063CNW&lt;/a&gt;\n\nTrack List:\n\n01. Start Movin' (In My Direction)\n02. Love Affair\n03. Lasting Love\n04. You Shouldn't Do That\n05. Dino\n06. The Words That I Whisper\n07. Too Young\n08. Party Time\n09. Secret Doorway\n10. Deep Devotion\n11. Now And For Always\n12. Blue-Eyed Baby\n13. My Bride\n14. Down By The Riverside\n15. Oh Marie\n16. Tattoo\n17. Baby Face\n18. Not Tomorrow But Tonight\n19. Little Pigeon\n20. Seven Steps To Love\n21. Cuttin' In\n22. A Couple Of Crazy Kids\n23. Souvenirs Of Summertime\n24. Make Believe Baby\n25. Young As We Are\n26. Part Of A Fool\n27. I'll Never Be Myself Again\n","torrent":{"xt":"urn:btih:971e5acbb86af2d0a2106dca85cba62fdab0235b","amp;dn":"Sal+Mineo+-+The+Complete+Epic+Recordings+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971e5acbb86af2d0a2106dca85cba62fdab0235b","infoHashBuffer":{"type":"Buffer","data":[151,30,90,203,184,106,242,208,162,16,109,202,133,203,166,47,218,176,35,91]},"announce":[],"urlList":[]}}