{"title":"Ten Wheel Drive With Genya Ravan-The Best Of(1995)[EAC-FLAC][TWR","uid":4744965,"size":593131590,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:973151fb9810076e5c4a06c7f2e05e69e2b9b183&amp;dn=Ten+Wheel+Drive+With+Genya+Ravan-The+Best+Of%281995%29%5BEAC-FLAC%5D%5BTWR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":29,"time":1235842542,"description":"&quot;Ten Wheel Drive was a highly influential rock/jazz group not afraid to push the envelope while exploring various musical styles. Though musicians came and went, including the original lead vocalist, by the time the fourth album was released, the records have stood the test of time, influencing the successful Bette Midler breakthrough film The Rose, inspiring women with the drive and ambition to front their own group in a once male-dominated industry, getting sold on auction sites like Ebay to be discovered by new generations of music lovers. The original lead vocalist and founding member, Genya Ravan, spoke with AMG concerning how she formed the band: &quot;I went to see Billy Fields, he was going to manage me. He had a friend in New Jersey that befriended two guys that were writers and they were looking for someone to sing their songs. Billy asked me if I wanted to hear them, I said 'OK' since I was always looking for material, so I met with Mike Zager and Aram Schefrin at a dinky little piano studio in Times Square. They played &quot;Polar Bear Rug&quot; and &quot;I Am a Want Ad&quot; and got me interested even though I thought they sounded more like show tunes, I was also an actress, so I liked it. At this time, I had an R&amp;B band and they came to hear me in some sleazy bar and they liked what they heard and saw. They did not have a band nor musicians in mind, I knew some good jazz players, so (we) got the musicians and started to audition and rehearse.&quot;\n\nWhen asked how the idea took shape, Ravan replied: &quot;When I heard Blood, Sweat &amp; Tears -- (the) first record with Al Kooper ( Child Is Father to the Man), my fave. I said, oh I want a horn band. It was 1969, we started to rehearse at the Bitter End, Sid Bernstein joined in the management with Billy Fields. It was a very exciting time, we played the Atlanta Pop Fest. Every great band that lived played that gig, that gig is what broke our band (and) we were an instant success.&quot; On the material, Ravan said she &quot;seldom wrote with Ten Wheel Drive...Aram was a brilliant lyricist, Mike and Aram were easy to work with, so I wrote some, it made me feel good, because the ones I wrote turned out to be the most soulful, like &quot;Pulse,&quot; &quot;Tightrope.&quot; I came into my writing more during the Urban Desire and ...and I Mean It! recordings.&quot; Those were the albums that came out on 20th Century Records at the end of the '80s, apart from Ten Wheel Drive.\n\nThe group signed with Polydor when Sid Bernstein brought Jerry Schoenbaum to the band's rehearsal and to one of their gigs at the Bitter End. The vocalist noted: &quot;Jerry flipped. Signed us immediately.&quot; There were artistic consequences to having phenoms like bassist Bill Takas and drummer Leon Rix moving on to LaBelle and Buzzy Linhart, Rix recording with Bette Midler as well. Over the span of four albums, guitarist Aram Schefrin and keyboard player Mike Zager (no relation to Zager &amp; Evans of &quot;In the Year 2525&quot; fame, though because of the point in time, there was some confusion in rock circles) worked with more than a dozen and a half different players. When Ravan was asked about this, she replied: &quot;It turned out to be good for us, fresh blood, it was creative, I love changes like that. I did not like the canning of musicians, but I was the one that had to do it. New blood is always exciting, You know how laid-back jazzers can be, they get excited for the first five minutes.&quot; The band played Carnegie Hall on Ravan's birthday and she cites the Central Park gig for WNEW when the Nightbird disc jockey Allison Steele hosted it, as well as the Atlanta Pop Festival as just two of the highlights of their brief but important career. Steele would later co-write the liner notes to Bill Levenson's 1995 16-track compilation on Polygram, The Best of Ten Wheel Drive With Genya Ravan. With all the excitement the band generated live, there was, unfortunately, no full concert performance on video or record. &quot;One of the last gigs we did was a show at Carnegie Hall with a symphony,&quot; Ravan said. &quot;Mike and Aram were geniuses. This was their forte -- they wrote this rock opera of &quot;Little Big Horn&quot; and it was brilliant, Polydor did not want to record it, I swear 'til this day, had it been recorded, Ten Wheel Drive would have gone down in history, it was one of the reasons I was disillusioned into leaving the label, it made me want to quit the business.&quot; There were no unreleased gems recorded and left in the vaults, Ravan stating that everything happened all too fast. And then she left the group she founded: &quot;Things started to get complicated. The music was not the main thing anymore, it was too expensive to have that many people involved. We had accountants, lawyers, roadies, and of course the group, we could not tour Europe because it was to expensive to get there and stay there. I just felt like there would be no future for me with the band anymore, also some personal stuff went down, that made it awkward. It just felt like it had hit the end for me.&quot; Ravan recorded a solo album in 1972 for Columbia Records with Schefrin and Zager co-producing. They enlisted the Rascals vocalist Annie Sutton to sing on the self-titled 1974 Capitol release that featured Hall &amp; Oates on backing vocals, but it wasn't the same. The band created essential music and has a revered place in rock history. Schefrin practices law in Rhode Island, having produced other records after the final breakup of Ten Wheel Drive; Zager does soundtrack work; and Ravan continues to record.&quot; (allmusic.com)\n\n&quot;A collection of most of their best songs from the 3 albums that TEN WHEEL DRIVE Featuring GENYA RAVAN released between 1969 - 1971. These songs sound so clear &amp; fresh on CD. The voice of Genya Ravan fronting a jazz/rock band with a heavy dose of r&amp;b and blues influences is amazing to hear now all these many years later.\n\nTIGHTROPE is just power at it's zenith, with Genya's high octane vocals &amp; the bands fusion of rock with horns. Wait until you hear the end of this song! That's POWERFUL music. MORNING MUCH BETTER is a short blast of energy that was a Top 100 hit in 1970. Labelle covered it soon after on their 1971 debut album. SHOOTIN' THE BREEZE is a beatiful song &amp; gentle performance by Genya that should have been a single, and a big hit. One of their best, understated songs. Likewise, I HAD HIM DOWN is another softer song that features a winsome sound that showed another side of this band. There's no shortage of great music &amp; powerful performances on this CD! HOW LONG BEFORE I'M GONE has so many influences &amp; changes in it, it's a non-stop tour-de-force. True, PULSE from their 2nd album should have been on it, but other than that no complaints.\n\nThis band should have been as big as the other ' horn' bands of the late 60's/early 70's , like Blood Sweat &amp; Tears or Chicago. The sound is rich, powerful, riveting. Genya Ravan would record many more albums as a solo artist, and cover a lot of ground on her later works. Here, hear her roar at the height of her vocal powers backed by an astounding band of musicians. Timeless music, great vocalist.&quot; (gassygoon, amazon.com)\n\n\n\nEAC Read mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nFull Artwork\n\n\nTrack List:\n\n1. Tightrope\n2. Lapidary\n3. Eye of the Needle\n4. Candy Man Blues\n5. Ain't Gonna Happen\n6. House in Central Park\n7. Morning Much Better\n8. Brief Replies\n9. Come Live With Me\n10. Stay With Me\n11. How Long Before I'm Gone\n12. Last of the Line\n13. Night I Got Out of Jail\n14. Shootin' the Breeze\n15. Love Me\n16. I Had Him Down\n\nPlayers:\n\nVocals, Harmonica, Tambourine: Genya Ravan\nGuitar, Vocals, Banjo, Percussion: Aram Schefrin\nOrgan, Piano, Clarinet: Mike Zager\nBass: Bill Takas, Bob Piazza, Blake Hines\nDrums, Percussion: Leon Rix, Allen Herman, David Williams\nCello: Leon Rix\nFlute: Jay Silva, Louie Hoff, Dave Liebman\nTrumpet: Jay Silva, Richard Meisterman, Peter Hyde, Steve Satten, John Gatchell, John Eckert, Dean Pratt, Danny Stiles, &quot;Others&quot;\nSaxophone: Louie Hoff, Dave Liebman\nTrombone: Dennis Parisi, Bill Watrous, Tom Malone\nFlugelhorn: Jay Silva, Peter Hyde, Richard Meisterman, Steve Satten, John Gatchell, John Eckert\nWoodwinds: Alan Gauvin\n\n\nMANY THX TO THE ORIGINAL RELEASER\n\n","torrent":{"xt":"urn:btih:973151fb9810076e5c4a06c7f2e05e69e2b9b183","amp;dn":"Ten+Wheel+Drive+With+Genya+Ravan-The+Best+Of%281995%29%5BEAC-FLAC%5D%5BTWR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"973151fb9810076e5c4a06c7f2e05e69e2b9b183","infoHashBuffer":{"type":"Buffer","data":[151,49,81,251,152,16,7,110,92,74,6,199,242,224,94,105,226,185,177,131]},"announce":[],"urlList":[]}}