{"title":"Best of Earth, Wind &amp; Fire Vol I RAW VINYL 1978 LP","uid":13449732,"size":95203443,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9739ec0558972bf29a2c13d6c58e725918e6628d&amp;dn=Best+of+Earth%2C+Wind+%26amp%3B+Fire+Vol+I+RAW+VINYL+1978+LP&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":4,"time":1454786812,"description":"Source: 1978 LP Record\r\n \r\n[b]RAW LP Rip. No post processing has been done and this LP has a couple of rough spots and at least one bump. But the rest is superb and warm and well worth the listen.  Has crackle and pops just like the olds days of listening to this album.  If you want perfection please search for the CDrips.\r\n\r\n - Big Papi[/b]\r\n \r\n[img]https://yuq.me/users/15/891/f34TZheLJn.png[/img]\r\n \r\n[img]https://yuq.me/users/15/891/uoiRrj3ns5.png[/img]\r\n \r\nBy M. Jones\r\n \r\n[quote]I've always loved this album ever since it's initial release in 1978, however, i've always felt they should have added more songs, especially from their early 70's period when the group was 1st formed. They produced some outstanding early material at a time when the music world was in rapid change &amp; artists, bands &amp; groups, who were unable to change with the times were falling by the way side. That being said, it has wonderful material that just puts a smile on my face each time i hear it!\r\n\r\nA lot of the classics are here: Fantasy, Can't Hide Love, Shining Star, That's The Way of The World &amp; Reasons. It also has, what was then, 2 incredible new songs, Love Music (check out the incredible harmonies on this one) &amp; the hit September. It also has an outstanding cover of Got to Get You into My Life that won them a grammy award and showed how great this band was as they were able to take a song by the Beatles and make it more of a hit than they did. Robert Stigwood, who was the manager of the Bee Gees and also an employee of the Beatles managers Brian Epstein's production company, loved their music asked Earth, Wind and Fire to do a cover of one of their songs on his upcoming tribute film for Sgt Peppers Lonely Heart's Club Band.\r\n\r\nMaurice and the band agreed and were given a choice of 3 songs, Verdine suggested that they do Got To Get You Into My Life. Maurice listened to the song, reworked it with an R&amp;B, Jazz arrangement and went into the studio with the band to record it. It's considered to this day as the best song off of the film and one of the best covers to one of the Beatles songs. The production was so incredible that many first thought the great Sir George Martin had done it, however, it was confirmed to the masses that it was the genius of Maurice White that transformed the song from a minor hit for the Beatles to a grammy award winning hit for the Elements!\r\n\r\nEarth, Wind and Fire were band that made you experience every type of emotion &amp; had deep and powerful lyrics that really made the listener think. That's why it's so confusing for &quot;reviewers&quot; like Ricky Wright to deal with or try to explain their music cause you couldn't always just throw it on &amp; listen to the groove (which were incredible on their own). Their songs were well crafted sermons that reached down into your soul and sadly that's so lacking in the majority of today's music. This is a great buy and a true witness to the marvel that was &amp; is Earth, Wind and Fire.\r\n\r\nThis was the 5th of a string of 7 albums released from 1975 to 1980 that helped to establish Earth, Wind and Fire's musical legacy, change how music was performed and recorded and allow for freedom of thought and expression in the music world as a whole. Gone were the &quot;drill teams&quot; as Maurice put it and now you had a band that made music that truly &quot;turned them on&quot; and brought to their millions of fans a new and refreshing way of how music could be enjoyed and perceived. That truly is a lasting legacy and that truly is the wonder that is Earth, Wind and Fire.[/quote]","torrent":{"xt":"urn:btih:9739ec0558972bf29a2c13d6c58e725918e6628d","amp;dn":"Best+of+Earth%2C+Wind+%26amp%3B+Fire+Vol+I+RAW+VINYL+1978+LP","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9739ec0558972bf29a2c13d6c58e725918e6628d","infoHashBuffer":{"type":"Buffer","data":[151,57,236,5,88,151,43,242,154,44,19,214,197,142,114,89,24,230,98,141]},"announce":[],"urlList":[]}}