{"title":"Stroke of Love (Love in Bloom - The Remingtons #2) [EPUB]","uid":9783292,"size":405212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9754eb070a4f9a0419aafde23aa61e0bb8992a33&amp;dn=Stroke+of+Love+%28Love+in+Bloom+-+The+Remingtons+%232%29+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1395127189,"description":"Pages: 300 pages\nISBN: 0991046862\nPublisher: World Literary Press (March 11, 2014)\nLanguage: English\nASIN: B00HZ3Q2KM\nFormat: EPUB\n\n\nThe Remingtons are the third installment of the Love in Bloom Series, joining the Snow Sisters &amp; The Bradens (Voted BEST BOOK SERIES of 2013 by Supportive Business Moms, UK)\n.\n**CONTENT WARNING: Due to mature content, recommended for readers aged 18+** \n.\n&quot;[The Remingtons] Sweet, sexy, and sensual.&quot; Bestselling author Amy Manemann \n.\nTHE REMINGTONS are the newest addition to the LOVE IN BLOOM series by New York Times &amp; USA Today bestselling and award-winning author Melissa Foster. This 5-book steamy contemporary romance series features alpha male heroes and sexy, empowered women. They're flawed, funny, passionate, and relatable to readers who enjoy new adult romance, contemporary romance, and women's fiction. While each book may be read as a standalone, you might enjoy reading the entire Love in Bloom series (The Snow Sisters, The Bradens, &amp; The Remingtons)\n.\nKate Parello runs a volunteer program in Belize for Artists for International Aid, where she deals with self-centered artists who use the program as a means to repair their marred reputations. She loves the country, the people, and what AIA stands for, but too many diva volunteers have turned her off to press-seeking celebrities altogether and left her questioning the value of the volunteer program. When she meets incredibly handsome and charming Sage, he stirs emotions she hasn't felt for ages, even though he represents the things she despises. \n. \nLaid-back artist Sage Remington escapes his wealthy lifestyle in the Big Apple for a two-week journey of self-discovery to figure out how a guy who has so much can feel so empty. When he meets ultra-organized Kate, who lives her life the way he's always dreamed of living his, the attraction is too hot to ignore, but Sage is there to figure out what's missing in his life, not to find a woman. \n. \nEvery look, and every late-night chat in the romantic jungle brings them closer together, but Sage can barely think past stripping away Kate's misconceptions about him. Kate fights him every step of the way--even though she finds it hard to ignore the strikingly handsome, generous-to-a-fault artist who wants to do nothing more than right the wrongs of the world--and love her to the ends of the earth. \n.\n**BONUS** Includes the first chapter (sneak peek) of Flames of Love, The Remingtons, Book Three.","torrent":{"xt":"urn:btih:9754eb070a4f9a0419aafde23aa61e0bb8992a33","amp;dn":"Stroke+of+Love+%28Love+in+Bloom+-+The+Remingtons+%232%29+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9754eb070a4f9a0419aafde23aa61e0bb8992a33","infoHashBuffer":{"type":"Buffer","data":[151,84,235,7,10,79,154,4,25,170,253,226,58,166,30,11,184,153,42,51]},"announce":[],"urlList":[]}}