{"title":"The English Civil War","uid":4488711,"size":2183831599,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:97ba886becfed29fab782f60f40dc85a63df3112&amp;dn=The+English+Civil+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mroverlord","files":4,"time":1225844346,"description":"[b]The English Civil War[/b]\n[img]http://www.art-prints-on-demand.com/kunst/gaspar_de_crayer/oliver_cromwell_1599_1658_hi.jpg[/img]\n\n[b]Episode 1 Blood on Our Hands\n[/b]\nIn 1640, England was so peaceful that only four people knew how to fire a mortar-cannon. Just eight years later, the nation had become a 17th-century Bosnia, engulfed by brutal violence in which families and communities tore themselves apart. England suffered, proportionately, greater losses than in the First World War. A newly free media stoked the fires of suspicion and religious hatred to push the nation, step by step, towards carnage.\n\nBlood on Our Hands explores the real reasons behind the English Civil War and brings to life through the personal testimony of everyday people the story of how the nation turned on itself.\n\nBrilliana, Lady Harley, under siege in her Herefordshire home, smuggles coded appeals for help to her teenage son in the army. Former journeyman tanner Sgt Wharton gets a taste for leadership only to die during his first battle. And humble wood turner, Nehemiah Wallington, one of a new breed of news junkies, watches the terrible human tragedy unfold.\n\nA/V\n594 MB,  811 Kbps,  25.0 fps,  480*272 (16:9),  XVID = XVID Mpeg-4\n93 MB,  128 Kbps,  48000 Hz,  2 channels,  0x55 = MPEG Layer-3,  CBR\n\n[b]Episode 2 Cromwell[/b]\n\nAs England was plunged into civil war, from the turmoil one man emerged a hero: Oliver Cromwell. He rose from fenland farmer to become the most powerful commoner in British history, and he got there by very un-British means: revolution. His convictions led to the killing of a king, and gave Britain its only experience of republican rule.\n\nHowever, there&amp;#039;s more to Oliver Cromwell than the grim-faced Puritan of legend. This film, originally shown in 2001, reveals a troubled and contradictory man who dominated England as it underwent cataclysmic change in the bloodiest war fought on English soil.\n\nA/V\n616 MB,  1121 Kbps,  25.0 fps,  480*272 (16:9),  XVID = XVID Mpeg-4\n70 MB,  128 Kbps,  48000 Hz,  2 channels,  0x55 = MPEG Layer-3,  CBR,\n\n[b]Episode 3 The Trial of the King Killers[/b]\n\nOn 29 January 1649, the English Civil War reached a dramatic and bloody climax: 59 Members of Parliament signed Charles I&amp;#039;s death warrant. The next day the king was publicly beheaded. and for the first and only time in its history, England became a republic.\n\nWhen Oliver Cromwell died in 1658, the republic died with him. Two years later, when Charles&amp;#039;s son was restored to the throne as Charles II, anyone who had signed the warrant or had assisted in its creation became a marked man. Quite a few fled abroad. Arrested and charged with the crime of regicide, the remainder were put on trial. The gripping exchanges that emerged as they argued for their lives in court reveal the very different motives of the group of men who reached the decision to kill the king.\n\nTaken from the original trial transcripts, Trial of the King Killers is a fact-based drama with a cast led by Corin Redgrave. It tells the bloody story of the most revolutionary episode in all of English history, when a king was brought before a people&amp;#039;s court accused of war crimes, and of what happened to his executioners when the wheel of history turned again and they were called to account for their actions.\n\nA/V\n637 MB,  1157 Kbps,  25.0 fps,  480*272 (16:9),  XVID = XVID Mpeg-4\n70 MB,  128 Kbps,  48000 Hz,  2 channels,  0x55 = MPEG Layer-3,  CBR\n\nHi this is my first torrent, hope you all enjoy it, great set of documentaries from 2005. \n\nTHISISOVERLORD","torrent":{"xt":"urn:btih:97ba886becfed29fab782f60f40dc85a63df3112","amp;dn":"The+English+Civil+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ba886becfed29fab782f60f40dc85a63df3112","infoHashBuffer":{"type":"Buffer","data":[151,186,136,107,236,254,210,159,171,120,47,96,244,13,200,90,99,223,49,18]},"announce":[],"urlList":[]}}