{"title":"Bright Eyes 24 Bit Vinyl Pack","uid":9079804,"size":6948130189,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9807919facde6a96c2e4c4cf38755d4e5a58e4f5&amp;dn=Bright+Eyes+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1382368656,"description":"\n  Bright Eyes 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock, Folk\n  Styles: Singer/Songwriter, Indie Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1998 Letting Off the Happiness \n  2000 Fevers and Mirrors\n  2002 Lifted or The Story is in the Soil, Keep Your Ear to the Ground\n  2005 I'm Wide Awake, It's Morning\n  2005 Digital Ash in a Digtal Urn\n  2007 Cassadaga\n\n  Although many musicians joined the band's rotating lineup, Bright Eyes was primarily the songwriting vehicle of Conor Oberst, a quivery-voiced Nebraska native who first attracted attention in 1994 -- when he was only 14 years old -- as the singer and guitarist for Commander Venus. Oberst proved to be a prolific musician, joining multiple bands (including Commander Venus, the Magentas, Park Ave., and Desaparecidos) while also co-founding Saddle Creek, an influential label that helped broadcast &quot;the Omaha Sound&quot; to a national audience. Nonetheless, he devoted most of his time to Bright Eyes, whose albums encompassed everything from folk to indie rock to electronica. Oberst eventually shifted his focus to the Mystic Valley Band in 2008, fueling rumors that he'd shelved the Bright Eyes project after ten years of activity.\n\n  Oberst had barely entered high school when he formed Commander Venus. Nonetheless, the teenager was a quick songwriter, and he soon amassed a number of songs that didn't gel with the rest of Commander Venus' catalog, 20 of which were compiled and released in 1998 as A Collection of Songs Written and Recorded 1995-1997, a solo record that doubled as Oberst's first release under the Bright Eyes moniker. Letting Off the Happiness followed several months later, featuring contributions from members of Neutral Milk Hotel, Of Montreal, and Tilly and the Wall. The album also marked the first collaboration between Oberst and producer/instrumentalist Mike Mogis, who would play an integral role in Bright Eyes' success going forward.\n\n  As Conor Oberst graduated from teenaged life to adulthood, his productivity increased. Bright Eyes' third release, Every Day and Every Night, appeared in 1999, followed by Fevers and Mirrors in 2000 and Oh Holy Fools in 2001. The Bright Eyes sound had expanded by this point, with Oberst finding room for flute, piano, and accordion in the band's music. The frontman also found room to pursue alternate projects, and he dedicated some time to Desaparecidos before returning to the studio with Mike Mogis in 2002. Lifted or the Story Is in the Soil, Keep Your Ear to the Ground was released that summer and proved to be Bright Eyes' breakthrough album, with Rolling Stone deeming it one of the year's best.\n\n  Bright Eyes released several EPs in 2004 -- including Home, Vol. 4, a collaboration with Spoon's Britt Daniel -- and rang in the following year with a pair of albums released on the same day: I'm Wide Awake, It's Morning (whose accompanying tour produced the Motion Sickness: Live Recordings disc) and the electronic-slanted Digital Ash in a Digital Urn, both of which cracked the Top 20 in America. Hailed by some critics as the next Dylan, Oberst supported the releases with a round of festival appearances and international shows before returning to the studio once more. Recorded in L.A., Chicago, New York, Omaha, and Portland, the follow-up effort Cassadaga was released in the spring of 2007, preceded by the Four Winds EP earlier that spring. Both releases featured full instrumentation -- including pedal steel, Dobro, xylophone, and orchestral swells -- making them some of Bright Eyes' most developed works to date.\n\n  Cassadaga debuted at number four in America and number 13 in the U.K., marking Bright Eyes' highest peak on either chart. Even so, Oberst followed such success by decamping to rural Mexico to work on his first solo effort in years. Recorded in a makeshift studio with a cast of musicians dubbed the Mystic Valley Band, Conor Oberst arrived in 2008. The project soon evolved from a solo effort into a full-band affair, and the Mystic Valley Band returned in 2009 with Outer South, an album that included songs written and sung by several of Oberst's bandmates. Bright Eyes returned in 2011 with People's Key, which was recorded in Omaha and produced by Mogis and Andy LeMaster. In 2013, A Christmas Album, which had originally been quietly issued in 2002 as a Saddle Creek online store exclusive, was finally scheduled for its first full commercial release. This unique holiday album featured a selection of Christmas standards performed in Bright Eyes' trademark bittersweet style, with help from a plethora of other Saddle Creek artists including members of Cursive, Desaparecidos, Neva Dinova, and Azure Ray.","torrent":{"xt":"urn:btih:9807919facde6a96c2e4c4cf38755d4e5a58e4f5","amp;dn":"Bright+Eyes+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9807919facde6a96c2e4c4cf38755d4e5a58e4f5","infoHashBuffer":{"type":"Buffer","data":[152,7,145,159,172,222,106,150,194,228,196,207,56,117,93,78,90,88,228,245]},"announce":[],"urlList":[]}}