{"title":"Catherynne M. Valente - Radiance","uid":13827330,"size":196361250,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:98b458d9e120c929d056f316fb967121e06596b1&amp;dn=Catherynne+M.+Valente+-+Radiance&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":18,"time":1457704006,"description":"Radiance is a decopunk pulp SF alt-history space opera mystery set in a Hollywood—and solar system—very different from our own, from the phenomenal talent behind the New York Times bestselling The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making.\r\n\r\nSeverin Unck’s father is a famous director of Gothic romances in an alternate 1986 in which talking movies are still a daring innovation due to the patent-hoarding Edison family. Rebelling against her father’s films of passion, intrigue, and spirits from beyond, Severin starts making documentaries, traveling through space and investigating the levitator cults of Neptune and the lawless saloons of Mars. For this is not our solar system, but one drawn from classic science fiction in which all the planets are inhabited and we travel through space on beautiful rockets. Severin is a realist in a fantastic universe.\r\n\r\nBut her latest film, which investigates the disappearance of a diving colony on a watery Venus populated by island-sized alien creatures, will be her last. Though her crew limps home to earth and her story is preserved by the colony’s last survivor, Severin will never return.\r\n\r\nAesthetically recalling A Trip to the Moon and House of Leaves, and told using techniques from reality TV, classic film, gossip magazines, and meta-fictional narrative, Radiance is a solar system-spanning story of love, exploration, family, loss, quantum physics, and silent film.\r\n\r\n\r\n\r\nRead by Heath Miller\r\nFormat: MP3\r\nBitrate: 32 Kbps","torrent":{"xt":"urn:btih:98b458d9e120c929d056f316fb967121e06596b1","amp;dn":"Catherynne+M.+Valente+-+Radiance","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98b458d9e120c929d056f316fb967121e06596b1","infoHashBuffer":{"type":"Buffer","data":[152,180,88,217,225,32,201,41,208,86,243,22,251,150,113,33,224,101,150,177]},"announce":[],"urlList":[]}}