{"title":"Bobby Rush - Down in Louisiana (2013) FLAC","uid":9441030,"size":298716539,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9985cda00d4148114c2740acbcda2d101c0c73a2&amp;dn=Bobby+Rush+-+Down+in+Louisiana+%282013%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ghostdogz","files":-1,"time":1388966835,"description":"BOBBY RUSH - Down In Louisiana (2013)\n\nBobby Rush Â has been cranking outalbums cut from the same cloth for so long that it's fair to ask what's the difference with 2013'sÂ Down in Louisiana. As it turns out, the answer is plenty. Departing from his signature slicked-back soul-blues,Â RushÂ strips his band down to the basics -- guitar, bass, drums, keyboard, accentuated with a little accordion on occasion -- abandoning the horns and getting down and dirty, a shift that's evident even on his standard glad-handing charmers like &quot;I Ain't the One.&quot; Too often, that glossy veneer and showboating obscuredÂ Rush's considerable skills as a guitarist and vocalist, so the switch onÂ Down in LouisianaÂ does him some considerable favors.Â Down in Louisianapacks a gut-level punch that feels even more bracing after years, even decades, of glossy grooves, so this is a sheer sonic pleasure, but what makes the record really work is thatÂ RushÂ doesn't abandon his signatures. He still can't resist a dirty joke (&quot;Bowlegged Woman&quot;), he still grinds out funky vamps like &quot;Rock This House&quot; -- he's not digging deep, he's still all about having a very,Â veryÂ good time. Thing of it is, by getting a little dirt underneath his fingernails, he's wound up with a record that will not only please his legions of fans, but an album that will convince doubters that this 77-year-old bluesman is something of a modern-day blues legend.\n\nSinger/guitarist Bobby Rush has traveled an interesting road as a musician. Born in Louisiana, his family relocated to Chicago in the early `50s, where Rush was schooled by Muddy Waters, Howlin' Wolf and other giants of the Windy City's iconic blues scene. He developed his own sound in the `60s, equally fueled by blues, funk and soul, and then in 1971 he moved back to the South and made it his home base for extensive roadwork. He's traveled the remnants of the chitlin' circuit, played nightclubs, auditoriums and Las Vegas showrooms, and at the age of 77 remains terrifically vital as a singer, songwriter, guitarist and harmonica player. His latest album blends electric blues with the soul of his native Louisiana, rendered by a stripped-down quintet of guitar, keyboards, harmonica, bass and drums. The results range from twelve bar blues to swamp-funk to the `70s styled groove &quot;Rock This House.&quot; Rush and co-producer/keyboardist Paul Brown add a few contemporary touches to the vocals, but the music never strays far from the sounds that are deeply rooted in Rush's musical soul. ","torrent":{"xt":"urn:btih:9985cda00d4148114c2740acbcda2d101c0c73a2","amp;dn":"Bobby+Rush+-+Down+in+Louisiana+%282013%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9985cda00d4148114c2740acbcda2d101c0c73a2","infoHashBuffer":{"type":"Buffer","data":[153,133,205,160,13,65,72,17,76,39,64,172,188,218,45,16,28,12,115,162]},"announce":[],"urlList":[]}}