{"title":"Beach Road by James Patterson","uid":8738567,"size":268603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99c0276d7d4aa1faf82e2a38fc07a79ca7465ff1&amp;dn=Beach+Road+by+James+Patterson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OrajelJunkie","files":-1,"time":1374729016,"description":"Montauk lawyer Tom Dunleavy's client list is woefully small - occasional real estate closings barely keep him in paper clips. When he is hired to defend a local man accused in a triple murder that has the East Hampton world in an uproar, he knows that he has found the case of his lifetime. \nThe crime turns the glittering playground for the super-rich into a blazing inferno. Dunleavy's client is a local hero, but Dunleavy knows the case rests atop a volcano of money, deception, and forbidden desires. His client is the perfect fall guy - unless he can find the key that unlocks the secret rooms of the gilt-shrouded set. \nWhen Dunleavy is joined by his former flame, the savvy and well-connected attorney, Kate Costello, he believes he has a chance. But payback is a bitch - especially from the rich. The violent retaliations of billionaires threatened by his investigation exceed anything Dunleavy has ever seen. With the entire nation's eyes on him in a new Trial of the Century, Dunleavy orchestrates a series of revelations that lead to a stunning outcome - only to find afterward that the truth is wilder than anything he ever imagined.","torrent":{"xt":"urn:btih:99c0276d7d4aa1faf82e2a38fc07a79ca7465ff1","amp;dn":"Beach+Road+by+James+Patterson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c0276d7d4aa1faf82e2a38fc07a79ca7465ff1","infoHashBuffer":{"type":"Buffer","data":[153,192,39,109,125,74,161,250,248,46,42,56,252,7,167,156,167,70,95,241]},"announce":[],"urlList":[]}}