{"title":"Two Fat Ladies COMPLETE 4 Disk DVD Collection","uid":4927744,"size":31050018816,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a0e43073987b6245aa1f5e336d42e06608e0e3f&amp;dn=Two+Fat+Ladies+COMPLETE+4+Disk+DVD+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SolaceG","files":-1,"time":1243908927,"description":"Two Fat Ladies is a British television cooking programme starring Clarissa Dickson Wright and Jennifer Paterson. It originally ran for four seasons, from 1996 to 1999 on BBC Two. The show also appeared on the Food Network in the USA, and on the Australian Broadcasting Corporation in Australia.\n\nThe show centered on Clarissa Dickson Wright and Jennifer Paterson, travelling the United Kingdom on a Triumph Thunderbird driven by Paterson. Wright rode in the sidecar as they travelled to various destinations, such as an army camp or an all-girls' school, where they would prepare large meals, often with unusual ingredients. Both ladies were very fond of strong flavours, and would often use things like anchovies, garlic, and various herbs and spices quite liberally. The recipes were gleaned from an older time and tradition when ingredients like rendered fat and drippings were used as well as raw eggs and unpasteurized milk products. They emphasized the importance of using fresh ingredients of the very best quality, avoiding supermarkets for farms and roadside markets.\n\n\nThis torrent contains all 24 episodes of the series, ripped directly from the DVD set released by Acorn Media. Please seed and enjoy ;)","torrent":{"xt":"urn:btih:9a0e43073987b6245aa1f5e336d42e06608e0e3f","amp;dn":"Two+Fat+Ladies+COMPLETE+4+Disk+DVD+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a0e43073987b6245aa1f5e336d42e06608e0e3f","infoHashBuffer":{"type":"Buffer","data":[154,14,67,7,57,135,182,36,90,161,245,227,54,212,46,6,96,142,14,63]},"announce":[],"urlList":[]}}