{"title":"eDonkey_2000_Pro_Full_v1.4.6_and PF Config","uid":6002436,"size":7535694,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9a813fdac43aeb9e9be8c45a3b9e1b340f4598f7&amp;dn=eDonkey_2000_Pro_Full_v1.4.6_and+PF+Config&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jinualex","files":1,"time":1291218904,"description":"eDonkey\n\neDonkey is an application that allows you to share and download files with millions of other people across the globe. It is fast and easy to use with the most sophisticated file sharing technology available.The newest version of eDonkey2000 connects to both the eDonkey2000 and OverNet networks. Both of these networks use the same protocols to share files. The biggest difference between the two is OverNet is serverless, while eDonkey2000 is server-based.\n\neDonkey is the most advanced file sharing application around. It is a completely decentralized peer to peer network. It allows you to trade any type of file, mp3s, video, images, software, etc. It runs on Windows, Mac OS X, and Linux. Users on eDonkey2000 predominantly share large files of tens or hundreds of megabytes, such as CD images, videos, games, and software programs. To ease file searching, some websites list the checksums of sought-after files in the form of an ED2K link. Some of those websites also have lists of active servers for users to update.\n\n\neDonkey2000 has all of these features:\n\n    * When searching on the server based network (eDonkey2000), it doesn't rely on one central server yet searches are still quick and your client doesn't get bogged down with endless search requests. You have the ability to search all the files being shared anywhere on the eDonkey2000 network.\n    * No central server. Servers can be located anywhere at any IP address.\n    * It allows you to transfer any type of file. It automatically resumes interrupted transfers from alternate sources. It even introduces ways to share a whole collection of files together so you can be sure to get all the songs in an album or all pieces of a movie. Users will be able to download a file from multiple sources at the same time thus insuring that transfers will be as fast as possible.\n    * Files can be uploaded while being downloaded. This insures that a rare file that is wanted by many people will be distributed as quickly as possible.\n    * Downloads are automatically continued from session to session.\n    * Dynamic ports. The donkey can be configured to run over any port.\n    * The server and client are both distributed for free. There are Linux, Windows, and Mac versions available.","torrent":{"xt":"urn:btih:9a813fdac43aeb9e9be8c45a3b9e1b340f4598f7","amp;dn":"eDonkey_2000_Pro_Full_v1.4.6_and+PF+Config","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a813fdac43aeb9e9be8c45a3b9e1b340f4598f7","infoHashBuffer":{"type":"Buffer","data":[154,129,63,218,196,58,235,158,155,232,196,90,59,158,27,52,15,69,152,247]},"announce":[],"urlList":[]}}