{"title":"Democracy Now - 27 feb 2012","uid":7061506,"size":458528688,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9a9a9a82d740f96d201cf2446e144455814807b9&amp;dn=Democracy+Now+-+27+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1330362229,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 27, 2012\n\n- Suicide Bomber Strikes Afghan Airport; U.S. Officials Killed Inside Interior Ministry\n- Santorum: Obama Should Not Have Apologized For Koran Burning\n- White House Funds Aided NYPD Effort to Spy on Muslim Communities\n- 59 Killed in Syria As Referendum Held to Extend Assad's Rule\n- WikiLeaks Begins Posting Internal Emails of Private Intel Firm Stratfor\n- U.S. Intelligence Analysts: No Hard Evidence Iran Is Building Nuclear Bomb\n- Saleh's VP Sworn In As Yemen's New President\n- Israel Inks Arms Deal with Azerbaijan\n\n\nSpecial reports\n\n- Author Walter Mosley on Writing Mystery Novels, Political Revelation, Racism and Pushing Obama\n\nToday in a Black History Month special, we spend the hour with the award-winning author Walter Mosley, who many people were introduced to when Bill Clinton praised his book while running for president. Mosley has published 37 books, including a series of bestselling mysteries featuring the private investigator Easy Rawlins. The first novel in this series, set in 1948 and called &quot;Devil in a Blue Dress,&quot; was made into a film starring Denzel Washington. Mosley has been hailed for his use of the popular detective novel as a vehicle for confronting racism across multiple decades. &quot;When I started writing Easy Rawlins ... I was trying to talk about my father's generation, black men and women who moved from the deep South to different parts of the world,&quot; Mosley says. &quot;Here's these wonderful stories about these people who have moved here and who make a big difference here. Let's include them in the literature.&quot; Mosley's latest novel, &quot;All I Did Was Shoot My Man,&quot; follows the modern-day private eye Leonid McGill as he navigates a world filled with corporate wealth, armed assassins and family drama. His writing has spanned many genres, from young adult to science fiction, but he is less known for his non-fiction works that address the pressing political issues of our time. Mosley's most recent work of non-fiction, &quot;Twelve Steps Toward Political Revelation,&quot; starts on a deeply personal note, then expands to a call of action for people to organize against wealth inequality. Regarding the his continued support of President Barack Obama, Mosley notes, &quot;We can't blame a guy who, you know, got elected, and he's sitting there alone in the White House. ... I agree, he has a lot of power, but he doesn't have enough power without us.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9a9a9a82d740f96d201cf2446e144455814807b9","amp;dn":"Democracy+Now+-+27+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a9a9a82d740f96d201cf2446e144455814807b9","infoHashBuffer":{"type":"Buffer","data":[154,154,154,130,215,64,249,109,32,28,242,68,110,20,68,85,129,72,7,185]},"announce":[],"urlList":[]}}