{"title":"Your Heart Is a Muscle the Size of a Fist - Sunil Yapa","uid":13305863,"size":796247,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c550e001ad5bd853300601376f05c141b62db63&amp;dn=Your+Heart+Is+a+Muscle+the+Size+of+a+Fist+-+Sunil+Yapa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":3,"time":1453743152,"description":"\nThe Flamethrowers meets Let the Great World Spin in this electrifying debut novel set amid the heated conflict of Seattle's 1999 WTO protests.\r\n\r\nOn a rainy, cold day in November, young Victor--a nomadic, scrappy teenager who's run away from home--sets out to sell as much marijuana as possible to the throng of WTO demonstrators determined to shut down the city. With the proceeds, he plans to buy a plane ticket and leave Seattle forever, but it quickly becomes clear that the history-making 50,000 anti-globalization protestors--from anarchists to environmentalists to teamsters--are testing the patience of the police, and what started out as a peaceful protest is threatening to erupt into violence.\r\n\r\nOver the course of one life-altering afternoon, the fates of seven people will change forever: foremost among them police Chief Bishop, the estranged father Victor hasn't seen in three years, two protesters struggling to stay true to their non-violent principles as the day descends into chaos, two police officers in the street, and the coolly elegant financial minister from Sri Lanka whose life, as well as his country's fate, hinges on getting through the angry crowd, out of jail, and to his meeting with the President of the United States. When Chief Bishop reluctantly unleashes tear gas on the unsuspecting crowd, it seems his hopes for reconciliation with his son, as well as the future of his city, are in serious peril.\r\n\r\nIn this raw and breathtaking novel, Yapa marries a deep rage with a deep humanity. In doing so he casts an unflinching eye on the nature and limits of compassion, and the heartbreaking difference between what is right and what is possible","torrent":{"xt":"urn:btih:9c550e001ad5bd853300601376f05c141b62db63","amp;dn":"Your+Heart+Is+a+Muscle+the+Size+of+a+Fist+-+Sunil+Yapa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c550e001ad5bd853300601376f05c141b62db63","infoHashBuffer":{"type":"Buffer","data":[156,85,14,0,26,213,189,133,51,0,96,19,118,240,92,20,27,98,219,99]},"announce":[],"urlList":[]}}