{"title":"Robert Pollard (GBV) 2006 From a Compound Eye","uid":9817094,"size":608478386,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9cdfc8833ac4d9f70ffd96d4aae8965a1472c72c&amp;dn=Robert+Pollard+%28GBV%29+2006+From+a+Compound+Eye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":29,"time":1395633235,"description":" Review by Stephen Thomas Erlewine  [-] from AllMusic.com\n\nRobert Pollard pulled the plug on Guided by Voices in 2004, but by that point many fans won over by the band ten years earlier had long stopped paying attention. And who could blame them? Sometime around 1999, just when GBV leapfrogged from Matador to TVT and made their second attempt at a big rock record, Pollard's solo albums started piling up at an alarmingly rapid rate, along with box sets of GBV outtakes presented under invented band names. Sure, the solo records, billed as part of the never-ending Fading Captain series, were intended to be a clearing-house for experimental material that couldn't quite fit on the increasingly streamlined GBV albums, but the sheer avalanche of material wound up seeming like little more than white noise to those unwilling to devote nearly all their free time to sorting out the minutia within Pollard's vast, cumbersome discography. It also didn't help that despite all this music, it didn't seem that Pollard was taking great leaps forward: instead, he was refining and sharpening the blueprint introduced to the world at large with 1994's Bee Thousand, the record that saw him catapult out of Dayton, OH, and into the realm of cult legend.\n\nLegendary status suited Pollard well, but his ceaseless productivity diminished his status, pushing him to the fringes of the fringes of indie rock. He could have existed there forever, but he wanted to break out of the band -- or at least, he wanted to jump-start his career, to bring disenchanted listeners back into the fold by breaking up the band and giving his career a fresh start. And so, From a Compound Eye, roughly his eighth solo album, but the first that was consciously intended for a wider audience. Although it was released in January 2006, the album had been completed for a long time, since the waning days of GBV, and saved until 2006, when an appropriate amount of breathing time had passed between the band's demise and the launch of a solo career -- enough time to make those listeners who had long ago given up on the band interested again, with the solo album, band biography, and DVD of the final concert all hitting the stores within a month of each other. For the hardcore, the fact that this album was designed as Pollard's first ever, long-awaited genuine double album -- constructed and sequenced as if its 26 songs were spread over four vinyl sides -- was supposed to be the selling point, along with its heavily hyped pre-release buzz on the Internet (as well as Jim Greer's official biography).\n\nSo does From a Compound Eye live up to its multiple promises? Yes, to a degree. For those who abandoned GBV around Mag Earwhig! or Do the Collapse and thereby missed the band's latter-day renaissance upon their return to Matador, this is a good reintroduction to the world of Robert Pollard. It's comfortably familiar, equal parts affected British psychedelia and British Invasion hooks, with his prog rock heart pierced by his enduring affection for Wire-patterned weirdness and blasts of Who-styled rockers. Pollard's songwriting is more focused, and producer Todd Tobias -- a former GBV keyboardist who also helmed Bob's 2004 Fiction Man the way he did this, by overdubbing all the instruments himself after Pollard laid down his guitar and vocals -- fills out the sound, giving this a rich, fully realized sound, not only in comparison to GBV's lo-fi records, but also to their muscular latter-day affairs. That said, at its core From a Compound Eye ain't all that different than the seemingly thousands of other Pollard-related projects -- it's still a rush of songs heavy on hooks but not coherence, interesting sounds that never quite seem to lead anywhere, enigmatic lyrics that never quite withstand scrutiny. On the surface it sounds great, yet it leaves little behind. And, once again, Pollard's dogged determination to push himself to the limits of self-indulgence means he winds up with too much of a not-bad thing. By the end of From a Compound Eye, his circular melodies and swirling songs are a bit exhausting, and the ballyhooed double-album sequencing doesn't have any discernible benefit to the album itself: in terms of time, it may run longer than any other Guided by Voices album, but Alien Lanes is two songs longer than this, and Pollard's fractured style and never-ending stream of songs always make his records feel like double albums, even when they clock in at 40 minutes.\n\nAll this means that From a Compound Eye winds up standing apart from the pack of Pollard projects even if it doesn't stand that far apart. It sprawls, but most individual tracks are full and focused, taking his art-pop to grand, cinematic scale, even if it plays more like a collection of short films than an epic picture. For those who have stuck with Bob through his ups and downs and piles of CDs, they'll be more inclined to find the connecting line between these tunes, particularly since it does serve up a fair amount of great Pollard songs (such as &quot;Dancing Girls and Dancing Men,&quot; &quot;Love Is Stronger Than Witchcraft,&quot; and &quot;Lightshow&quot;) along with more sonic detail to get lost in than any of his previous albums. And those are all good reasons for those who have gotten off the train to use From a Compound Eye as a reintroduction to his work, but for as good as this is in long stretches and small doses, it ultimately suffers from the Pollard curse: too much pop in miniature winds up sounding like minutia.\n","torrent":{"xt":"urn:btih:9cdfc8833ac4d9f70ffd96d4aae8965a1472c72c","amp;dn":"Robert+Pollard+%28GBV%29+2006+From+a+Compound+Eye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cdfc8833ac4d9f70ffd96d4aae8965a1472c72c","infoHashBuffer":{"type":"Buffer","data":[156,223,200,131,58,196,217,247,15,253,150,212,170,232,150,90,20,114,199,44]},"announce":[],"urlList":[]}}