{"title":"Eclipso:  The Darkness Within (Complete) (No ads)","uid":7822344,"size":443825071,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9d57314f185fc8477b511b463478dd4b68363322&amp;dn=Eclipso%3A++The+Darkness+Within+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SplhcbPrime","files":-1,"time":1352851558,"description":"Eclipso:  The Darkness Within was a comic book mini-series and crossover storyline published by DC Comics. It featured the heroes of the DC Universe fighting against Eclipso.  Eclipso:  The Darkness Within 1 debuted in July, 1992, and was created and co-plotted by Robert Loren Fleming and Keith Giffen. Keith Giffen also did pencil layouts for the series, and Bart Sears provided the finished artwork.\n\nAfter an unsuspecting Daxamite hero named Valor frees Eclipso from his palace on Earth's moon, he uses hate as a trigger to possess other beings. Whenever someone who has a black diamond in their possession gets angry, Eclipso can instantly take control of that particular person even though trapped in his lair on the moon. He then uses an eyeblast to take control of others. He can also create monsters from a person's anger [which happens with characters like Hawkman and James Gordon.] Furthermore, there are thousands of black diamonds scattered around the world, through which Eclipso can possess his victims by playing upon their darkest emotions and desires.\n\nIt is further established that Eclipso is an extremely cruel and vindictive being, who has only been pretending to be a B-list villain in order to avoid detection by heroes. In the mini-series, Eclipso has grown weary of his modus operandi and decides to launch an all-out offensive by using his black diamonds to possess heroes and villains directly, or to manipulate them by possessing their loved ones. During this conflict, Eclipso is able to possess Batman, Captain Marvel, and even Superman [on two separate occasions.] The story climaxes with a massive confrontation at Eclipso's hideout on the moon.  Who shall live, and who shall die?\n\nDownload and peruse this torrent now, to find out how it all ends.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and of course the authors, artists and publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:9d57314f185fc8477b511b463478dd4b68363322","amp;dn":"Eclipso%3A++The+Darkness+Within+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d57314f185fc8477b511b463478dd4b68363322","infoHashBuffer":{"type":"Buffer","data":[157,87,49,79,24,95,200,71,123,81,27,70,52,120,221,75,104,54,51,34]},"announce":[],"urlList":[]}}