{"title":"Squaresoft 5.1ch Movie Collection DVD Promo Square","uid":11753983,"size":920678656,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9da9d1ee7ef0c6460f1fba30f4e049f1b50a4c25&amp;dn=Squaresoft+5.1ch+Movie+Collection+DVD+Promo+Square&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Violaceum","files":37,"time":1426306777,"description":"Square 5.1ch Movie Collection DVD. This special disc could only be obtained as a special promo for purchasing a P2DiPOLE speaker system, which came out in Japan in 2000. This item was never available to buy separately.\n\nThe P2DiPOLE speaker system was specifically tailored to the then newlyÂ­launched Playstation 2's Dolby Digital playback capability. This disc was included as a bonus for the early adopters of the Playstation 2, as the PS2 was the first home console to have DVD playback capability. \n\noriginal price for this package was 29,800 yen, which equaled about $276 in USD using the May 2000 exchange rate. The Square 5.1ch Mov Collection was an incentive bonus for buyers to adopt early. (Note that this is a standard Region 2 DVD and can be played back in any multiregion DVD player.) This disc was meant to be something of a tech demo for new Playstation 2 owners. What makes this DVD special for Final Fantasy fans is that the Square Visual Works department remastered the game's CG to full DVD resolution specifically for this limited disc.\n\nAs you may know, the original PS1 had a fairly low native resolution, approximately 320 x 224. All movies on this disc have been mastered directly at 720 x 540. As such, you can see more detail and resolution in these clips than you could on the Playstation releases. In addition, the disc credits state that Square Sounds was responsible for upgrading the sound to Dolby Digital 5.1 to demonstate the capacity of the P2DiPO speaker system.\n\nThis disc includes clips from the following Squaresoft titles:\n\nFinal Fantasy VIII, Chocobo's Dungeon 2, Front Mission 3, Chrono Cross","torrent":{"xt":"urn:btih:9da9d1ee7ef0c6460f1fba30f4e049f1b50a4c25","amp;dn":"Squaresoft+5.1ch+Movie+Collection+DVD+Promo+Square","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da9d1ee7ef0c6460f1fba30f4e049f1b50a4c25","infoHashBuffer":{"type":"Buffer","data":[157,169,209,238,126,240,198,70,15,31,186,48,244,224,73,241,181,10,76,37]},"announce":[],"urlList":[]}}