{"title":"[youshikibi] Date a Live - 03 (1280x720 h264 AAC) [644c3af8].mp4","uid":8393734,"size":411532306,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a0117120c82a13afe4bf8fb6e97530dea414cb15&amp;dn=%5Byoushikibi%5D+Date+a+Live+-+03+%281280x720+h264+AAC%29+%5B644c3af8%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"youshikibi","files":1,"time":1366505762,"description":"Episode 04 - &quot;Sword That Splits the Sky&quot;\n\n\nSynopsis\n\nShido and Tohka are on their date being overseen and supported by the Fraxinus crew. Tohka mistakingly assumes that each variety of food she is consuming at first is a &quot;date&quot;. Not accustomed to a crowd, when the couple enter the shopping area she assumes that humanity is launching an all out attack on her. Origami observes them from the shadows while Shido and Tohka go from a high priced restaurant to south of the station where they enter an improvised shopping area. Tohka is able to indulge in the foods present to her desire but notices that Shido doesn't seem to be having fun. They move on to an arcade that is dominated by crane games which Tohka mistakingly assumes is the &quot;mecha team's&quot; secret base. In the course of playing for a prize that has caught Tohka's eye, Tohka inadvertantly voices her bond with Shido. They make their way to a cliff edge where Tohka finally finds out what a &quot;date&quot; is and sees why the &quot;mecha people&quot; want to kill her as she keeps destroying a world that's so kind, fun and beautiful. Meanwhile, Origami is given permission to fire but as she fires, Shido pushes Tohka out of the way and is killed instead. Enraged by Shido's death, Tohka rampages on a stunned Origami as she sees the AST as people who only want to kill and die. Before Tohka can swing the killing blow on Origami, Shido is revived with his wounds completely healed and falls from the sky towards Tohka. To prevent the city from being destroyed by a critical state Halvanhelev, Tohka kisses Shido while they glide down to the cliffedge as Tohka's Astral Dress disappears. Her last request is that Shido take her on a date again.\n\n\nMP4 format with hardcoded English subtitles.\n\nVideo...: H.264/AVC Video (playable on PS3, Xbox 360, etc.)\nAudio...:192 kbps, 2 Channel (AAC)\n\n\nscreenshots: &lt;a href=&quot;\nhttps://yuq.me/u/1967762/vldaJrCDhF.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/u/1967762/vldaJrCDhF.png&lt;/a&gt;","torrent":{"xt":"urn:btih:a0117120c82a13afe4bf8fb6e97530dea414cb15","amp;dn":"%5Byoushikibi%5D+Date+a+Live+-+03+%281280x720+h264+AAC%29+%5B644c3af8%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0117120c82a13afe4bf8fb6e97530dea414cb15","infoHashBuffer":{"type":"Buffer","data":[160,17,113,32,200,42,19,175,228,191,143,182,233,117,48,222,164,20,203,21]},"announce":[],"urlList":[]}}