{"title":"The 5000 Year Leap: A Miracle That Changed The World - AudioBook","uid":4841220,"size":193795398,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1c62cdb3886a5ac29a4c3fbbd77c50629d34896&amp;dn=The+5000+Year+Leap%3A+A+Miracle+That+Changed+The+World+-+AudioBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4lib3rty","files":-1,"time":1239511503,"description":"The 5000 Year Leap: A Miracle That Changed The World by W. Cleon Skousen - iTunes AudioBook\n\n\niTunes file, but will play on all players that playback MP4 files.\n\n\nThis file has artwork, chapters, and will remember where it was played last.\n\n\nEnjoy... and leave comments please, it's nice to know others appreciate your efforts.\n\n\nClick on my username to check out other important works related to freedom and liberty.\n\n\n\nAbout the Author:\n\nSkousen authored The Naked Communist and was the source of the publication &quot;1963 Communist Goals&quot; list. He later wrote a follow-up, The Naked Capitalist, based on Carroll Quigley's assertions made in the books Tragedy and Hope and The Anglo-American Establishment, which claimed that top Western merchant bankers, industrialists and related institutions were behind the rise of Communism and Fascism around the world.\n\nIn June 1935, immediately after graduating from San Bernardino Valley Jr. College, where he served as Student Body President, Skousen began working for the Agricultural Adjustment Administration. This led into a career with the Federal Bureau of Investigation (FBI) the following year, which lasted until 1951.\n\nSkousen attended George Washington University Law School, graduating with an LL.B. in June 1940. He had already passed the Washington, D.C., Bar Exam. In 1972, recognizing the sufficiency of his law school studies more than 30 years earlier, his law degree was upgraded to Juris Doctor (J.D.).\n\nAfter the American election of 1980, Skousen was appointed to the Council for National Policy, a think tank of influential politicians, scholars and academics that lent support and advice to President Ronald Reagan-s administration. Among the many solutions Skousen proposed included suggested programs to convert the Social Security system to private retirement accounts and a plan to completely wipe out the national debt. Skousen was never a tax protestor but campaigned for several proposals to eliminate the federal income tax, including the famous Liberty Amendment, which among other things, would return federally owned land to the states and preclude the federal government from being involved in any activities that competed with private enterprise. --Publisher \n\n\nProduct Description\nThe 5000 Year Leap: A Miracle That Changed the World. For many years in the United States there has been a gradual drifting away from the Founding Fathers original success formula. This has resulted in some of their most unique contributions for a free and prosperous society becoming lost or misunderstood. Therefore, there has been a need to review the history and development of the making of America in order to recapture the brilliant precepts which made Americans the first free people in modern times.\n\nIn this book, discover the 28 Principles of Freedom our Founding Fathers said must be understood and perpetuated by every people who desire peace, prosperity, and freedom. Learn how adherence to these beliefs during the past 200 years has brought about more progress than was made in the previous 5000 years. Published by National Center for Constitutional Studies, a non-profit organization.","torrent":{"xt":"urn:btih:a1c62cdb3886a5ac29a4c3fbbd77c50629d34896","amp;dn":"The+5000+Year+Leap%3A+A+Miracle+That+Changed+The+World+-+AudioBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1c62cdb3886a5ac29a4c3fbbd77c50629d34896","infoHashBuffer":{"type":"Buffer","data":[161,198,44,219,56,134,165,172,41,164,195,251,189,119,197,6,41,211,72,150]},"announce":[],"urlList":[]}}