{"title":"Verve Jazz Masters 41 - Tal Farlow (1995) [Jazz][mp3 192][h33t][","uid":4978943,"size":105593470,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a1e49968623a95f633b6ea876cd56c15750e4b6f&amp;dn=Verve+Jazz+Masters+41+-+Tal+Farlow+%281995%29+%5BJazz%5D%5Bmp3+192%5D%5Bh33t%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":21,"time":1246167404,"description":"Verve Jazz Masters 41 - Tal Farlow\nAudio CD: April 18, 1995 \nOriginal Release Date: April 18, 1995 \nLabel: Polygram Records \nBitrate: 192 kbps\n\nI've listened to alot of Tal's recordings, and I consider this CD to an outstanding representation of his best work.  If I had to own only one CD of his, this would be it.  It has tunes from his earlier '50s recordings, such as &quot;The Tal Farlow Album&quot;, when his blistering single note runs were at their crispest.  &quot;Cherokee&quot; is as fast as you can possibly get on a guitar -- I calculated 22 notes per second bursts based on the tempo of more than 300 quarter notes per minute.  Smoo. . . kin! It also contains some ballads to give the listener a chance to wipe the sweat off his brow.  Don't miss out on this one! ~ ccamp@qntm. com\n\nWhat else can one say? This album is a great compilation of his early work.  From the incredible chord melody of &quot;Autumn in New York&quot;, to his interpretation of &quot;Autumn Leaves&quot;, (Complete with his &quot;A&quot; string tuned down one octave). Everythings here.  His blistering single note solos, single line harmonics, brilliant full rounded chords, and elusive harmonic sophistication.  He even produces snare, brush, and bongo drum effects! Also looking for &quot;Tal Farlow 78&quot; album on disc.  Also recommended is &quot;This is Tal Farlow&quot;, and &quot;The Swinging Guitar Of Tal Farlow&quot; ~ Frank Gi\n\nThis disc gives you 73 minutes of Farlow, with a variety of sidemen, taken from records released between 1954-'56.  If you like jazz guitar, you can't go wrong buying this.  Farlow began playing for pay during World War II, and really showed his greatness on vinyl during the years represented on this CD.  I also highly recommend &quot;The Swingin' Guitar of Tal Farlow&quot;---one track of that album is on this CD, but all 63 minutes of that record are superb.  I'm not a player, so I can't tell you how Farlow produced his beautiful sounds, but I know what I like musically, and this is definitely what I like.  Some songs are fast, some are slow, but none are just mood music, easy listening, or background sound.  His crisp plucking and strumming and fingering reflects what must have been a keen intelligence.  As the liner notes say, Farlow was not particularly in love with the guitar itself, but with the music, and the guitar was simply the instrument he played the best.  Give him a try, if you are not familiar with his work. ~ William E.  Adams\n\nVerve Jazz Masters 41 - Tal Farlow Tracks\n01 Autumn Leaves\n02 It's You Or No One\n03 Little Girl Blue\n04 Out Of Nowhere\n05 Ev'rything I've Got\n06 Isn't It Romantic?\n07 Meteor\n08 Lorinesque\n09 Love Nest, The\n10 Yesterdays\n11 With The Wind And The Rain In Your Hair\n12 I Remember You\n13 Moonlight Becomes You\n14 Autumn In New York\n15 Stella By Starlight\n16 Cherokee","torrent":{"xt":"urn:btih:a1e49968623a95f633b6ea876cd56c15750e4b6f","amp;dn":"Verve+Jazz+Masters+41+-+Tal+Farlow+%281995%29+%5BJazz%5D%5Bmp3+192%5D%5Bh33t%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e49968623a95f633b6ea876cd56c15750e4b6f","infoHashBuffer":{"type":"Buffer","data":[161,228,153,104,98,58,149,246,51,182,234,135,108,213,108,21,117,14,75,111]},"announce":[],"urlList":[]}}