{"title":"Come Come yet Again Come #12_the world is crayzi.mp4","uid":15341568,"size":449431850,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a1e62b038127580c2b9deec9cc45ba97b721d462&amp;dn=Come+Come+yet+Again+Come+%2312_the+world+is+crayzi.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1468842611,"description":"Chapter #12\r\nChapter title: From Italy to Nirvana\r\n7 November 1980 am in Buddha Hall\r\nQ2 and Q3 on video\r\nThe second question:\r\nQuestion 2\r\nBELOVED OSHO,\r\nTHE WORLD SEEMS TO BE GETTING MORE AND MORE CRAZY FROM DAY TO DAY. NOBODY KNOWS WHAT IS GOING ON AND EVERYTHING IS UPSIDE DOWN AND CONFUSED. THIS IS WHAT IS TOLD IN THE NEWSPAPERS. IS IT REAL? AND IF SO, IS THERE ANY INTRINSIC BALANCE IN LIFE WHICH IS KEEPING EVERYTHING STABLE?\r\n\r\nBuddhaprem, the world is the same; it has always been the same -- upside down, crazy, insane. In fact, only one thing new has happened in the world, and that is the awareness that we ARE crazy, that we are upside down, that something is basically wrong with us. And this is a great blessing -- this awareness....\r\nThe third question:\r\n\r\nQuestion 3\r\nBELOVED OSHO,\r\nIS IT TRUE THAT YOU ARE REALLY AN ITALIAN?\r\n\r\nAntar Vittorio, not now, but I must have been in some of my past lives. One has to pass through all kinds of things; one has to be an Italian too. Without being an Italian you cannot become enlightened -- that much is absolutely certain. If somebody becomes enlightened without being an Italian he will have to come back; he will relapse from his enlightenment. Hence it is a must to pass through.\r\nTo be an Italian is just the opposite of being enlightened. Have you ever heard about any Italian becoming enlightened? But it helps -- to touch the opposite pole is very necessary; only then the journey begins towards the source. You have gone as much astray as you could, then the prodigal sons return. You have to come back -- there is nowhere else to go. Once you are an Italian, where else can you go? What else can you do? You have reached the dead end of the road. So it is good to be an Italian -- the sooner it happens the better!...\r\nDownload free books and audios from oshoworld(dot)com","torrent":{"xt":"urn:btih:a1e62b038127580c2b9deec9cc45ba97b721d462","amp;dn":"Come+Come+yet+Again+Come+%2312_the+world+is+crayzi.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e62b038127580c2b9deec9cc45ba97b721d462","infoHashBuffer":{"type":"Buffer","data":[161,230,43,3,129,39,88,12,43,157,238,201,204,69,186,151,183,33,212,98]},"announce":[],"urlList":[]}}