{"title":"Razzle Dazzle - Super Kaleidoscope Screensaver","uid":15247360,"size":29085088,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a289465a7dd509743499107317b1017c1031407c&amp;dn=Razzle+Dazzle+-+Super+Kaleidoscope+Screensaver&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PileNGril","files":1,"time":1468016081,"description":"DAZZLE is an award winning self directing color image generator for DOS and Windows computers\r\nwith EGA or VGA compatible color displays and adapters. Performance art for the eyes.\r\nThis software is a graphics image generator that you can run as a screen saver.\r\nTransform your color VGA or EGA-equipped PC into a stunning source of computer-generated beauty.\r\nDAZZLE is a hypnotizing graphics image generator acclaimed in computer magazines as the best\r\nself-directing art program available. It fills the computer monitor with continually evolving displays\r\nthat protect the screen from image burn. A popular diversion for waiting rooms, reception areas,\r\nand family rooms at home. A source of beauty; sometimes subtle, sometimes vibrant, always changing.\r\nThe image engine has numerous primary image drawing algorithms, most of which have at least two styles\r\nof presentation, many of which have multiple internal drawing variations. There is an assortment of fades,\r\nincluding split screens and pans, used by the imaging system for greater diversity of presentation.\r\n\r\n- Award winning interactive color kaleidoscopic program that provides endless changing visual viewscapes.\r\n- Performance art for the eyes featuring a rich selection of drawing algorithms, fades, and special effects.\r\n- Includes a self-directing mode which is an effective and entertaining attention getter. \r\n\r\n\r\nLicense: Razzle Dazzle was a $15 commercial product (beyond version 4.0, which was public domain). The commercial version implemented a TSR to automatically launch the program on inactive PCs, supported SVGA 640x480 modes, as well as having expanded visualization modes.\r\n\r\nDeveloper: © Worldwide MicroTronics, Inc. 1990-2005\r\n\r\nAuthor: James R. Shiflett \r\n\r\nRelease Date: 1996 (October) \r\n\r\nCompiled: 2016 (July) \r\n\r\nAdditional: Bonus as optional install - Johnny Castaway screensaver with it's audio driver","torrent":{"xt":"urn:btih:a289465a7dd509743499107317b1017c1031407c","amp;dn":"Razzle+Dazzle+-+Super+Kaleidoscope+Screensaver","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a289465a7dd509743499107317b1017c1031407c","infoHashBuffer":{"type":"Buffer","data":[162,137,70,90,125,213,9,116,52,153,16,115,23,177,1,124,16,49,64,124]},"announce":[],"urlList":[]}}