{"title":"Hallmark-Christmas Song [2012]","uid":7795204,"size":733521462,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a29eb2f4f297490690d8eec8508ccffe345f6bed&amp;dn=Hallmark-Christmas+Song+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"RayCort","files":1,"time":1352126076,"description":"Hallmark-Christmas Song (2012) \n\nAir Date: 3 Nov 2012\n\nSummary: When budget cuts force the merger of two New York City high schools, two music teachers aim to compete in the largest, televised Christmas Carol competition that will determine the fate of the school's music program and the teachers' jobs. Natasha Henstridge (&quot;The Whole Nine Yards,&quot; &quot;The Secret Circle&quot;) and Gabriel Hogan (&quot;Heartland&quot;) star in &quot;Christmas Song,&quot; a Hallmark Channel Original Movie, premiering Holiday 2012. Hallmark Channel's &quot;Countdown to Christmas&quot; is the biggest holiday destination on television, premiering more original holiday programs than any other network. \n\nThough two schools have recently merged into one, students at the newly formed Carter-Cresswell Academy have yet to blend into one harmonious body. Particularly for the award-winning choral groups of the two former schools, old rivalries die hard. Music teachers Diana Deason (Henstridge) and Ken Stoddard (Hogan) are forced to compete for a single music department position by entering dueling musical acts in a televised Christmas song competition. The success of either group will determine the fate of the music department and will determine who will get the job as the school's only music director. As the musical teams duke out their differences at the competition and in the school halls, sparks begin to fly between Diana and Ken; romantic and otherwise. Confused by these sentiments, Diana is forced to reevaluate her priorities and choose what is really worth fighting for.\n\n\n\nCast:\n\nNatasha Henstridge \n\nGabriel Hogan ... Ken Stoddard \n\nBrittany Adams ... Amy \n\nKent Nolan ... Carlo \n\nRamona Milano ... Jill \n\nBen Mulroney ... Emcee \n\nAmanda Marie Thomson ... Liz Strade \n","torrent":{"xt":"urn:btih:a29eb2f4f297490690d8eec8508ccffe345f6bed","amp;dn":"Hallmark-Christmas+Song+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a29eb2f4f297490690d8eec8508ccffe345f6bed","infoHashBuffer":{"type":"Buffer","data":[162,158,178,244,242,151,73,6,144,216,238,200,80,140,207,254,52,95,107,237]},"announce":[],"urlList":[]}}