{"title":"Very Bad Trip 3 TRUEFRENCH DVDRiP 2013","uid":13014529,"size":731795456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a2e28bb7bfa5d4f99f41f892bf5977c21b516432&amp;dn=Very+Bad+Trip+3+TRUEFRENCH+DVDRiP+2013&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"annuaireweb","files":1,"time":1450278988,"description":"The.Hangover.Part.III.2013.TRUEFRENCH.BRRip.XviD-TMB\r\n\r\nDeux ans ont passé. Phil (Bradley Cooper), Stu (Ed Helms) et Doug (Justin Bartha) mènent des existences tranquilles et heureuses. Ils ont fait disparaître leurs tatouages et se sont rachetés une conduite. Aux dernières nouvelles, Leslie Chow (Ken Jeong), qui attirait les catastrophes, a échoué dans une prison en Thaïlande : depuis qu'il n'est plus dans le secteur, nos trois lascars ont - presque - oublié leurs folles virées nocturnes à travers les quartiers sordides de Las Vegas, à moitié shootés, et le jour où ils se sont fait kidnapper, tirer dessus et prendre en chasse par une bande de dangereux dealers à Bangkok...Le seul de la Meute à ne pas avoir trouvé son équilibre est Alan (Zach Galifianakis). Se cherchant toujours, la brebis galeuse du groupe a arrêté les médocs et donné libre cours à ses impulsions, ce qui, dans son cas, revient à ne reculer devant rien et à ne se fixer aucune limite... Jusqu'à ce qu'il traverse une crise douloureuse et qu'il se mette en quête du soutien dont il a besoin.Et qui mieux que ses trois meilleurs copains pourraient l'aider à s'engager dans la bonne voie ? Cette fois, il n'y a pas de mariage, ni de fête d'enterrement de vie de garçon. Qu'est-ce-qui pourrait donc bien dégénérer ? Mais quand la Meute s'en mêle, il faut être prêt à tout ! Et pour boucler la boucle, la petite bande doit retourner là où tout a commencé : à Las Vegas","torrent":{"xt":"urn:btih:a2e28bb7bfa5d4f99f41f892bf5977c21b516432","amp;dn":"Very+Bad+Trip+3+TRUEFRENCH+DVDRiP+2013","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e28bb7bfa5d4f99f41f892bf5977c21b516432","infoHashBuffer":{"type":"Buffer","data":[162,226,139,183,191,165,212,249,159,65,248,146,191,89,119,194,27,81,100,50]},"announce":[],"urlList":[]}}