{"title":"The 9th Fortress (Epub)","uid":7843586,"size":467503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3346c7ec0315177f4a55a7dbffa69b9f5a8bf5a&amp;dn=The+9th+Fortress+%28Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmobley","files":1,"time":1353412392,"description":"What happens when we die? William Fox has just found out. \nLost in limbo on the other side of space, our hero has been cast there for wasting all of his 41 years on Earth. This mediocre man has just been offered a lifeline however, one last chance to redeem himself - The 9th Fortress.\nSoaring from the bowels of Hell, the Fortress is a jagged tower confining the worst of the worst, and fortunately for Willie Fox, it holds one extremely important individual in its dungeon - a soul in need of rescue.\nTo achieve this almighty task, Fox is given a guide for the journey - the only man to ever escape hellfire, a vicious and killer samurai called Kat. \nOn their epic rescue mission, the Kat and Fox encounter an exiled French angel called Harmony Valour, and an English knight called Eddinray. Together these four clash with monsters on land and sea, with wizards, dragons, giants, and the armies of Satan on route to the 9th fortress. \nInspired by Homer's Odyssey, my novel is fantasy not for the faint hearted, but for those of you who like a little blood with your steak. It's ambitious and it's arduous, it's dark and it's light - it's a classic adventure story for the 21st century.  \n","torrent":{"xt":"urn:btih:a3346c7ec0315177f4a55a7dbffa69b9f5a8bf5a","amp;dn":"The+9th+Fortress+%28Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3346c7ec0315177f4a55a7dbffa69b9f5a8bf5a","infoHashBuffer":{"type":"Buffer","data":[163,52,108,126,192,49,81,119,244,165,90,125,191,250,105,185,245,168,191,90]},"announce":[],"urlList":[]}}