{"title":"Melville-Russian Face of Germany(secret German rearmament in Sov","uid":5167365,"size":1812055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a34c447638f1123bcd94b6a1087c372f8592fb81&amp;dn=Melville-Russian+Face+of+Germany%28secret+German+rearmament+in+Sov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1258483776,"description":"This is Cecil F. Melville's shocking book The Russian Face of Germany - An Account of the Secret Military Relations Between the German and Soviet-Russian Governments (1932) which exposes secret military relations between the German and Soviet-Russian governments as they existed before the outbreak of 2nd World war. After the 1st World war the militarists at Berlin were feverishly working for the rebuilding of the Prussian military machine which was destroyed in the war. During the past few months before this book was written the military-nationalists camarilla - for long the real rulers in the background - have emerged into the open, and have confronted Europe with a demand for equality of military status, i.e. German re-armament. General von Schleicher, the Minister of Defence, and &quot;strong man&quot; of von Papen's government, has made it clear that Germany intends to re-arm, with or without the assent of the Treaty Powers. Schleicher was one of the &quot;political generals&quot; who, with General von Seeckt, at the Reichswehr Ministry, conducted the policy of the Abmachungen (=agreements), the secret military understanding between Germany and Russia. The Russian Face of Germany is an uncommon and outstandingly prescient expose of the increasing militarism of Germany before WW2 as its leaders desperately wanted to rearm it - even if it means going to bussiness with the Soviets. In this increasingly rare book Melville documents how the secret deals were struck and how Germany was able to rearm in complete secrecy using Soviet Union as its silent bussiness partner and how many major German corporations were heavily involved in this process. You are about to read one of the most secret chapters of modern world history. 220 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:a34c447638f1123bcd94b6a1087c372f8592fb81","amp;dn":"Melville-Russian+Face+of+Germany%28secret+German+rearmament+in+Sov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a34c447638f1123bcd94b6a1087c372f8592fb81","infoHashBuffer":{"type":"Buffer","data":[163,76,68,118,56,241,18,59,205,148,182,161,8,124,55,47,133,146,251,129]},"announce":[],"urlList":[]}}