{"title":"Axialis Professional Screen Saver Producer 3.62_ patch and seria","uid":4339974,"size":11105658,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a353f74e334415f428c4a97ed3cd26846f6a45b5&amp;dn=Axialis+Professional+Screen+Saver+Producer+3.62_+patch+and+seria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"romelanda","files":8,"time":1218541005,"description":"Axialis Professional Screensaver Producer is a powerful tool which allows you to create all kinds of Windows screensavers based on Sprites\n (animated objects), FlashÃ‚Â®, Slideshows and Video Movies.\n It has a fully integrated workspace that permits you to work efficiently and create professional screen savers in minutes.\n Compile and produce Windows XP/98/ME/NT4/2000 SCR compatible files with Control Panel preview. Several options are available:\n Sprite collisions at different levels with sounds; MIDI, MP3 or MOD/S3M/XM Background music support; Slideshow screensavers support\n BMP, JPEG, PNG (including with alpha chanel 32BPP), \nTIFF, PSD, GIF, PCX, LBM, PCD, PICT, QTI, WMF, TGA, IFF and LBM; Multi-resolution support; Several Background effects;\n AVI, MPEG, QT Video Sequences support; FLI, FLC, GIF Animations support; Compilation with image compression; \nCustomizable screen saver About dialog box, and more... \n\nFeatures:\nCreating state-of-art screensavers with sprites (animated objects moving on screen) has never been easier. \nFor example, you&amp;#039;ll be able to create in minutes a cool screensaver with your company logo bouncing on screen. \nImages with transparency (including alpha-channel) are supported. Several options are available: Bouncing on the screen borders,\n realistic collisions between objects and more...\n\nIf you use to create Macromedia FlashÃ‚Â® movies, you&amp;#039;ll produce limitless screensavers. \nThe product is fully compatible with SWF movies up to MX. You can produce full screen or scaled playback.\n An interesting feature permits to create interactive screensavers (the user can click in movie to interact with the screensaver).\n\nCreating slideshow screensavers is also possible: Many transitions are available including the famous &quot;fade-in &amp; fade-out&quot; effects.\n Several options are available to meet your needs: background sounds, ability to attach a speech to each image,\n display with automatic screen resolution adjustment, and more. Supported image file formats are: BMP, JPEG, PNG \n(including with alpha chanel 32BPP), TIFF, PSD, GIF, PCX, LBM, PCD, PICT, QTI, WMF, TGA, IFF and LBM.\n\nIf you have created a video movie, you&amp;#039;ll be able to create a screensaver from it in a few minutes. For example,\n it&amp;#039;s a great idea for a company to make a screensaver from a TV ad clip. All the video file formats are supported: \nAVI, MPEG, ASF, QuickTime, RealMedia.\n\nCreate professional installation packages: The corporate edition permits to create installable packages of your screensavers.\n This is the best method to distribute your screensavers. \nThe resulting installation is very professional and permit the end-user to easily install the screensaver.\n any options are available to customize the installer (logo, icon, license agreement, command switches...).\n\nSell your screensavers by creating Limited/Trial versions: More and more authors actually sell their screensavers.\n It&amp;#039;s very easy using Internet. The product permits you to create demo/limited screensavers.\n It&amp;#039;s very easy because it&amp;#039;s just an option of the compilation prosess. You can limit the trial period or the number of objects displayed.\n The screensaver is unlockable. If the user is interested by the trial version, he purchases a code to unlock it. \nYou can generate unlock codes using a powerful built-in feature.\n\nCreate multi-language screensavers: \nThe built-in compiler permits you to choose the language of the installation procedure as well as the screensaver dialog.\n Eight languages are available: English, French, German, Spanish, Dutch, Russian, Portuguese and Italian.\n\n","torrent":{"xt":"urn:btih:a353f74e334415f428c4a97ed3cd26846f6a45b5","amp;dn":"Axialis+Professional+Screen+Saver+Producer+3.62_+patch+and+seria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a353f74e334415f428c4a97ed3cd26846f6a45b5","infoHashBuffer":{"type":"Buffer","data":[163,83,247,78,51,68,21,244,40,196,169,126,211,205,38,132,111,106,69,181]},"announce":[],"urlList":[]}}