{"title":"Magnetic Resonance in Chemistry and Medicine - R. Freeman","uid":15059974,"size":16062481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4e57e38e0e3abb863897a9e75375a4ef29c197d&amp;dn=Magnetic+Resonance+in+Chemistry+and+Medicine+-+R.+Freeman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466754994,"description":"Magnetic Resonance in Chemistry and Medicine - R. Freeman (OUP, 2003).pdf\r\n\r\nISBN 0-19-926225-X\r\n\r\nMagnetic resonance (MR) measures the tiny radio frequency signals emitted by the nucleus of the atom when living or inanimate material is placed in a magnetic field. On the one hand, these signals allow scientists to picture the architecture of molecules too small to be seen under the most powerful microscope, while on the other hand they give medical doctors a detailed picture of the internal structure of the human body without resorting to surgery of any kind. These two applications (high-resolution NMR spectroscopy and the MRI scanner) seem to be worlds apart, but the underlying physical principles are the same, and it makes sense to treat them together.\r\n\r\nChemists and clinicians who use magnetic resonance have much to learn about each other's specialities if they are to make the best use of magnetic resonance technology. Many in the medical fraternity will benefit from a general appreciation of how high-resolution NMR has advanced our understanding of human biochemistry, diagnostic medicine, and the search for new drugs. A broad general understanding of magnetic resonance should prove of interest to doctors who make use of the MRI scanner, and to those of their patients who wish to learn more about these daunting machines, even if it is only the question of their own personal safety.\r\n\r\nAt the other end of the spectrum, chemists and biochemists who use high-resolution NMR spectroscopy in their everyday investigations will benefit by broadening their horizons to cover the exciting new developments in MR imaging and in vivo spectroscopy, as one justification for their research is the eventual benefit to health care.\r\n\r\nFinally, anyone interested in how the human mind works (cognitive neuroscience) will find a chapter devoted to the exciting new developments in functional magnetic resonance imaging of the brain. Each disparate group has something useful to learn from the others. The treatment is pictorial rather than mathematical","torrent":{"xt":"urn:btih:a4e57e38e0e3abb863897a9e75375a4ef29c197d","amp;dn":"Magnetic+Resonance+in+Chemistry+and+Medicine+-+R.+Freeman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e57e38e0e3abb863897a9e75375a4ef29c197d","infoHashBuffer":{"type":"Buffer","data":[164,229,126,56,224,227,171,184,99,137,122,158,117,55,90,78,242,156,25,125]},"announce":[],"urlList":[]}}