{"title":"Linux Mint 13 KDE (32-bit)","uid":7667460,"size":959447040,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:a5f38328423c1eb8e88948756894cab991b31637&amp;dn=Linux+Mint+13+KDE+%2832-bit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JRepin","files":-1,"time":1348482875,"description":"The purpose of Mint is to produce a modern, elegant and comfortable GNU/Linux-based operating system which is both powerful and easy to use. KDE edition is based on Kubuntu with KDE Plasma desktop and KDE software.\n\nSome of the reasons for the success of Linux Mint are:\n* It works out of the box, with full multimedia support and is extremely easy to use.\n* It's both free of cost and free as in freedom (open source).\n* It's community-driven. Users are encouraged to send feedback to the project so that their ideas can be used to improve Linux Mint.\n* Based on Debian and Kubuntu, it provides about 30,000 packages and one of the best software managers.\n* It's safe and reliable. Thanks to a conservative approach to software updates, a unique Update Manager and the robustness of its Linux architecture, Linux Mint requires very little maintenance (no regressions, no antivirus, no anti-spyware...etc).\n\nThe highlight of this edition is the latest KDE 4.8 desktop, which features the following improvements:\n* Kwin window manager optimizations\n* Redesign of power management and integration with Activities\n* The first QtQuick-based Plasma widgets have entered the default installation of Plasma Desktop, with more to follow in future releases\n* New display engine in Dolphin file manager\n* New Kate advanced text editor features and improvements\n* Functional and visual improvements in Gwenview image viewer\n\nMore info: &lt;a href=&quot;\nhttp://www.linuxmint.com/rel_maya_kde_whatsnew.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.linuxmint.com/rel_maya_kde_whatsnew.php&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a5f38328423c1eb8e88948756894cab991b31637","amp;dn":"Linux+Mint+13+KDE+%2832-bit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5f38328423c1eb8e88948756894cab991b31637","infoHashBuffer":{"type":"Buffer","data":[165,243,131,40,66,60,30,184,232,137,72,117,104,148,202,185,145,179,22,55]},"announce":[],"urlList":[]}}