{"title":"SS 04.Devil Said Bang - Richard Kadrey","uid":10916359,"size":378186482,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a6abc35c10f09d2f8996f6935a0d0869fc6b9b8a&amp;dn=SS+04.Devil+Said+Bang+-+Richard+Kadrey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":34,"time":1409310691,"description":"While ruling the denizens of darkness does have a few perks, James Stark isn't exactly thrilled at the course his career (not to mention his soul) has taken. Breaking out of Hell once was a miraculous trick. But twice? If anyone can do it, it's Sandman Slim. While he's working out the details of his latest escape plan, Slim has to figure out how to run his new domain and hold off a host of trigger-happy killers mesmerized by that bullseye on his back. Everyone in Heaven, Hell, and in between wants to be the fastest gun in the universe, and the best way to prove it is to take down the new Lucifer, aka Sandman Slim aka James Stark.\n\nThen again, LA isn't quite the paradise it once was since he headed south. A serial killer ghost is running wild and his angelic alter-ago is hiding somewhere in the lost days of time with a secret cabal who can rewrite reality. And starting to care about people and life again is a real bitch for a stone-cold killer.\n\nA violent and atmospheric tale full of edgy fun and packed with angels and demons, monsters and madmen, Devil Said Bang is another thrilling hit of kickass fun from the diabolically talented Richard Kadrey.\n","torrent":{"xt":"urn:btih:a6abc35c10f09d2f8996f6935a0d0869fc6b9b8a","amp;dn":"SS+04.Devil+Said+Bang+-+Richard+Kadrey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6abc35c10f09d2f8996f6935a0d0869fc6b9b8a","infoHashBuffer":{"type":"Buffer","data":[166,171,195,92,16,240,157,47,137,150,246,147,90,13,8,105,252,107,155,138]},"announce":[],"urlList":[]}}