{"title":"An A-Z Guide to Food Additives - Never Eat What You Can't Pronou","uid":8679420,"size":2970083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7c46e582def89d0eba2252bc924bbfe250933ff&amp;dn=An+A-Z+Guide+to+Food+Additives+-+Never+Eat+What+You+Can%27t+Pronou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"R0thschild","files":4,"time":1373664288,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n\n          Crystal Clean files - Fast Speed! No Virus! No Fake! Enjoy!\n    \n              ***********************************************\nDetails:\n\nAn A-Z Guide to Food Additives - Never Eat What You Can't Pronounce\nISBN: 1573244031 | 2009 | EPUB/MOBI | 160 pages | 1 MB/2 MB\n\nCochineal extract, diacetyl, teriary butylhydroquinone, BHA, HFCS, MSG--it's not just knowing how to pronounce what's in your food, it's knowing what it does and how it can affect you that matters most. But with so many processed foods on the supermarket shelves and additives showing up in the most unlikely foods, that's certainly a tall order. An A-Z Guide to Food Additives will help consumers avoid undesirable food additives and show them which additives do no harm and may even be nutritious. Designed to fit in a purse or pocket, this little book will serve as an &quot;additive translator&quot; when navigating through the landmine field of additives or ingredients that may cause allergic reactions like headaches, fatigue, and breathing difficulties or those that cause bloating or make one hyperactive. Included are safety ratings to 300 ingredients and reference charts of such additives as those that may potentially cause cancer or allergic reactions or that should be limited for sodium-sensitive individuals. There is also essential nutrition advice, hints on what to look for when reading those unreadable ingredient labels, and even tips on buying fresh produce in order to avoid pesticides.\n\n\n\n* The average American consumes about 150 pounds of food additives per year.\n\n* Safety ratings on over 300 ingredients -- all based on the latest scientific evidence.\n\n* Formatted for easy reference and small enough to carry along to the supermarket.","torrent":{"xt":"urn:btih:a7c46e582def89d0eba2252bc924bbfe250933ff","amp;dn":"An+A-Z+Guide+to+Food+Additives+-+Never+Eat+What+You+Can%27t+Pronou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7c46e582def89d0eba2252bc924bbfe250933ff","infoHashBuffer":{"type":"Buffer","data":[167,196,110,88,45,239,137,208,235,162,37,43,201,36,187,254,37,9,51,255]},"announce":[],"urlList":[]}}