{"title":"Peter Murphy - Should The World Fail To Fall Apart[FLAC - LOSSLE","uid":3837702,"size":321995399,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7d05ea3b4fe1e400510013815cce9bebad8b8f2&amp;dn=Peter+Murphy+-+Should+The+World+Fail+To+Fall+Apart%5BFLAC+-+LOSSLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"99AM","files":16,"time":1192080289,"description":"FLAC files + CUE sheet + Covers\nReleased in 1986\n\nTrack listling:\n1. Canvas Beauty [Romance Version]\n2. The Light Pours Out of Me\n3. Confessions\n4. Should the World Fail to Fall Apart\n5. Never Man\n6. God Sends\n7. Blue Heart\n8. The Answer Is Clear\n9. Final Solution\n10. Jemal\n\nReview from AMG:\nFollowing the collapse of Dali&amp;#039;s Car, Murphy embarked on a solo career in earnest, fortuitously hooking up with Howard Hughes, who had been working with fellow cult artists the Associates. With 4AD label head Ivo Watts-Russell drafted in to produce and guest musicians popping in as desired, Murphy and Hughes created a slightly fragmentary but still intriguing record. Caught between his recent past (the use of fretless bass on &quot;Canvas Beauty&quot; was a dead giveaway that he missed working with Mick Karn) and his eventual solo successes, Murphy concentrates here mostly on breaking free of the goth stereotype in which he had found himself trapped. His vocal passion isn&amp;#039;t diminished in the slightest, but this time the music over which he sings is generally lighter and freer in tone; he himself handles drum programming, core guitar parts, and keyboard lines while Hughes takes care of the rest. The quietly anthemic title track and &quot;God Sends&quot; stand out as thorough successes on these lines. Two covers also crop up, both worthy of note: A solid run-through of Magazine&amp;#039;s &quot;The Light Pours Out of Me&quot; with that band&amp;#039;s guitarist John McGeoch; more noteworthy is a fierce rip on Pere Ubu&amp;#039;s &quot;Final Solution.&quot; The ghosts of Bauhaus do crop up at points, most notably &quot;Never Man,&quot; with haunting backing vocals and a generally creepy feeling. Meanwhile, &quot;The Answer Is Clear&quot; has a more direct connection, with none other than Bauhaus guitarist Daniel Ash contributing some fine feedback squalls. Ironically enough, the song itself is a pointed response to Ash&amp;#039;s own recent Tones on Tail song &quot;The Movement of Fear,&quot; which Murphy took as an attack on himself!\n\nEnjoy!","torrent":{"xt":"urn:btih:a7d05ea3b4fe1e400510013815cce9bebad8b8f2","amp;dn":"Peter+Murphy+-+Should+The+World+Fail+To+Fall+Apart%5BFLAC+-+LOSSLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d05ea3b4fe1e400510013815cce9bebad8b8f2","infoHashBuffer":{"type":"Buffer","data":[167,208,94,163,180,254,30,64,5,16,1,56,21,204,233,190,186,216,184,242]},"announce":[],"urlList":[]}}