{"title":"Salman Rushdie - Joseph Anton: A Memoir","uid":7976962,"size":583750789,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a8573bd98180bfd2e45f432944e1838b55a3dfeb&amp;dn=Salman+Rushdie+-+Joseph+Anton%3A+A+Memoir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zis123","files":-1,"time":1357028382,"description":"On February 14, 1989, Valentine's Day, Salman Rushdie was telephoned by a BBC journalist and told that he had been &quot;sentenced to death&quot; by the Ayatollah Khomeini. For the first time he heard the word fatwa. His crime? To have written a novel called The Satanic Verses, which was accused of being &quot;against Islam, the Prophet and the Quran&quot;.\nSo begins the extraordinary story of how a writer was forced underground, moving from house to house, with the constant presence of an armed police protection team. He was asked to choose an alias that the police could call him by. He thought of writers he loved and combinations of their names; then it came to him: Conrad and Chekhov - Joseph Anton.\nHow do a writer and his family live with the threat of murder for more than nine years? How does he go on working? How does he fall in and out of love? How does despair shape his thoughts and actions, how and why does he stumble, how does he learn to fight back? In this remarkable memoir Rushdie tells that story for the first time; the story of one of the crucial battles, in our time, for freedom of speech. He talks about the sometimes grim, sometimes comic realities of living with armed policemen, and of the close bonds he formed with his protectors; of his struggle for support and understanding from governments, intelligence chiefs, publishers, journalists, and fellow writers; and of how he regained his freedom.\nIt is a book of exceptional frankness and honesty, compelling, provocative, moving, and of vital importance. Because what happened to Salman Rushdie was the first act of a drama that is still unfolding somewhere in the world every day.","torrent":{"xt":"urn:btih:a8573bd98180bfd2e45f432944e1838b55a3dfeb","amp;dn":"Salman+Rushdie+-+Joseph+Anton%3A+A+Memoir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8573bd98180bfd2e45f432944e1838b55a3dfeb","infoHashBuffer":{"type":"Buffer","data":[168,87,59,217,129,128,191,210,228,95,67,41,68,225,131,139,85,163,223,235]},"announce":[],"urlList":[]}}