{"title":"Ten.Little.Pieces.2016.S01.WebRip.x264-FiSH","uid":15445509,"size":643351411,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a9b3800966dab515b9ec838572dab0e6de43389c&amp;dn=Ten.Little.Pieces.2016.S01.WebRip.x264-FiSH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":11,"time":1469876878,"description":"Ten Little Pieces - Series 1\r\n\r\nCategory:  Kids/Family (Full Series Pack)\r\nChannel:  CBBC\r\nDate:  May to June 2016\r\nTime:  Various (5 minutes)\r\n\r\nTen Pieces were films made for primary and secondary students, aiming to open up the world of classical music to a new generation of children and inspire them to develop their own creative responses to ten pieces of music.\r\n\r\nThe Ten Little Pieces series is a collection of shorts compiled from the original two films, shown on CBBC from May to June 2016. In each episode special guests look at the work of a particular classical composer.\r\n\r\nWebsite: http://www.bbc.co.uk/programmes/b07dyq1p\r\n\r\nEpisode 1 - Wagner (30th May 2016)\r\n\r\nChristopher Eccleston goes in search of the story behind Richard Wagner's dramatic Ride of the Valkyries, involving winged warriors on horseback and a mysterious ring. The BBC Philharmonic and members of the National Youth Orchestra of Great Britain perform in an atmospheric Manchester warehouse, with young conductor Alpesh Chauhan.\r\n\r\nEpisode 2 - Gabriel Prokofiev (30th May 2016)\r\n\r\nThe genre-bending Concerto for Turntables and Orchestra melds classical music with hiphop breakbeats courtesy of soloist DJ Mr Switch and the BBC Philharmonic. London-based composer Gabriel Prokofiev introduces his extraordinary piece, along with Radio 1's Clara Amfo.\r\n\r\nEpisode 3 - Bizet (31st May 2016)\r\n\r\nNaomi Wilkinson and actor Bobby Lockwood introduce two famous pieces from Georges Bizet's gypsy opera Carmen - a love triangle under the Spanish sun, transposed to a UK nightclub. The BBC Philharmonic perform the sultry Habanera and the Toreador Song.\r\n\r\nEpisode 4 - Haydn (31st May 2016)\r\n\r\nFormer footballer Dion Dublin summarises Joseph Haydn's Trumpet Concerto, with the help of a football team and some MOTD-style graphics. Soloist Alison Balsom performs with the BBC Philharmonic under the baton of Alpesh Chauhan.\r\n\r\nEpisode 5 - Shostakovich (1st June 2016)\r\n\r\nAccompanied by striking visuals, poet Lemn Sissay explores Dmitri Shostakovich's thrilling 10th Symphony. Written under Soviet dictator Stalin's rule of terror, the piece is performed by the BBC Philharmonic with young conductor Alpesh Chauhan.\r\n\r\nEpisode 6 - Bach (1st June 2016)\r\n\r\nJames May shows his sensitive side as he confesses his love for the music of JS Bach, with musical accompaniment from organist Wayne Marshall. The BBC Philharmonic play extracts from Bach's Toccata and Fugue, conducted by Alpesh Chauhan.\r\n\r\nEpisode 7 - Vaughan Williams (2nd June 2016)\r\n\r\nMolly Rainford visits the English countryside to explore the tranquil piece The Lark Ascending, written by English composer Vaughan Williams at the time of World War I. Violin star Nicola Benedetti is the soloist with the BBC Philharmonic.\r\n\r\nEpisode 8 - Anne Clyne (2nd June 2016)\r\n\r\nRapper, comedian and actor Doc Brown enters a threatening, animated seascape via a giant wave, to introduce Night Ferry by living composer Anna Clyne. The BBC Philharmonic perform the exciting piece in a Manchester warehouse.\r\n\r\nEpisode 9 - Verdi (3rd June 2016)\r\n\r\nComedian Vikki Stone fears the end of the world is nigh as she introduces part of Guiseppe Verdi's Requiem. The massed ranks of the Halle Choir join forces with the BBC Philharmonic to perform Dies Irae and Tuba Mirum.\r\n\r\nEpisode 10 - Bernstein (3rd June 2016)\r\n\r\nPixie Lott weaves her way through an animated 50s New York to the irresistible rhythms of Leonard Bernstein's Mambo from West Side Story. A dynamic performance of the symphonic dance by the BBC Philharmonic will get toes tapping and hips shaking!","torrent":{"xt":"urn:btih:a9b3800966dab515b9ec838572dab0e6de43389c","amp;dn":"Ten.Little.Pieces.2016.S01.WebRip.x264-FiSH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b3800966dab515b9ec838572dab0e6de43389c","infoHashBuffer":{"type":"Buffer","data":[169,179,128,9,102,218,181,21,185,236,131,133,114,218,176,230,222,67,56,156]},"announce":[],"urlList":[]}}