{"title":"Demonic Gospels - Ken Johnson","uid":10339072,"size":370159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa00136944d8a0f29ed18a614014af6fd4cb2940&amp;dn=Demonic+Gospels+-+Ken+Johnson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1402518545,"description":" Learn how we got the books of the Bible. There were prophets who proved they were from God by performing miracles and making localized predictions with one hundred percent accuracy. Their long range predictions were then recorded in the sixty-six books of the Bible. We can know this for a fact because over fifty of those long range prophecies have come to pass since the nation of Israel was reborn in AD 1948. The ancient church fathers teach the Gnostic gospels were demonically inspired. They contain no prophecy and their teachings contradict the teachings of the prophetically proven word of God. In some cases the church fathers record which cults wrote which gnostic books and why they are to be considered heresy.\n The demonic Gnostic gospels teach reincarnation, that there are multiple gods, and that humans are divine. They teach that the use of sorcery is imperative for salvation. The Bible clearly teaches that there is only one God. We do not have a spark of God in us, nor are we evolving into gods. It also teaches that the use of sorcery is a sin that will damn people to an eternal hell, and that everyone will die only once, physically resurrect, and be judged. The Gnostic gospels are summarized in their own chapters showing why these are truly demonic gospels!\n\n\nAbout the author:\nKen Johnson, Th.D. was born in 1965 and became a Christian at the age of 12. He quickly realized there were differences in doctrine in various denominations and sought out to prove to himself the correct interpretation of these issues that divide Christians. After an intensive study of the first century church he sought to bring back the teaching of the disciples of the 12 apostles. He has authored numerous books and made ancient Jewish scrolls available to the English speaking world.\nHe currently travels to churches inside the USA, speaking on these and other topics. He currently attends Calvary Chapel of Johnson County, located in Olathe Kansas. ","torrent":{"xt":"urn:btih:aa00136944d8a0f29ed18a614014af6fd4cb2940","amp;dn":"Demonic+Gospels+-+Ken+Johnson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa00136944d8a0f29ed18a614014af6fd4cb2940","infoHashBuffer":{"type":"Buffer","data":[170,0,19,105,68,216,160,242,158,209,138,97,64,20,175,111,212,203,41,64]},"announce":[],"urlList":[]}}