{"title":"Pax Indica by Shashi Tharoor","uid":9665278,"size":1263092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa620dafb4c26d278b40118cc39ffd2ed986eb51&amp;dn=Pax+Indica+by+Shashi+Tharoor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":2,"time":1393368621,"description":"\nIndian diplomacy, a veteran told Shashi Tharoor many years ago, is like the love-making of an elephant: it is conducted at a very high level, accompanied by much bellowing, and the results are not known for two years. In this lively, informative and insightful work, the award-winning author and parliamentarian brilliantly demonstrates how Indian diplomacy has become sprightlier since then and where it needs to focus in the world of the 21st century. \n\nExplaining why foreign policy matters to an India focused on its own domestic transformation, Tharoor surveys Indias major international relationships in detail, evokes the countrys soft power and its global responsibilities, analyses the workings of the Ministry of External Affairs, Parliament and public opinion on the shaping of policy, and offers his thoughts on a contemporary new grand strategy for the nation, arguing that India must move beyond non-alignment to multi-alignment. \n\nHis book offers a clear-eyed vision of an India now ready to assume new global responsibility in the contemporary world. Pax Indica is another substantial achievement from one of the finest Indian authors of our times.\n\nGenre: Non Fiction | Culture | India | Politics","torrent":{"xt":"urn:btih:aa620dafb4c26d278b40118cc39ffd2ed986eb51","amp;dn":"Pax+Indica+by+Shashi+Tharoor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa620dafb4c26d278b40118cc39ffd2ed986eb51","infoHashBuffer":{"type":"Buffer","data":[170,98,13,175,180,194,109,39,139,64,17,140,195,159,253,46,217,134,235,81]},"announce":[],"urlList":[]}}