{"title":"Stone Temple Pilots - Take A Load Off (2nafish)","uid":5909252,"size":118536196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aad8ab77946f7cc648f422e8e4fa20d1b067bfc6&amp;dn=Stone+Temple+Pilots+-+Take+A+Load+Off+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1287992990,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Take a Load Off&quot; is a song by American rock band Stone Temple Pilots. &quot;Take a Load Off&quot; is the second track off the band's sixth studio album, Stone Temple Pilots, released in 2010. The song was the album's second single, after the #1 hit &quot;Between the Lines.&quot; A music video for &quot;Take a Load Off&quot; was released on September 8, 2010.\n\n&quot;Take a Load Off&quot; was composed by guitarist Dean DeLeo. In writing this song, singer Scott Weiland listened to and studied poetical lyricists to learn how to free his writing from his autobiographical and &quot;self-obsessed&quot; nature. &quot;There's an art to telling a story, and it can mean anything, or it can mean nothing.&quot;\n\nStone Temple Pilots is the sixth studio album by American rock band Stone Temple Pilots. The album was released worldwide from May 21, 2010 through May 27, and is the band's first album since their 2001 release, Shangri-La Dee Da. The album is the result of the band's reunion, which occurred in April 2008 with their North American tour. After Stone Temple Pilots had begun playing together, the band decided to record again, but a lawsuit filed by Atlantic Records on June 12, 2008, made the sixth album an uncertainty, and Weiland released statements that expressed his disapproval of working with a major record label. Atlantic eventually withdrew the lawsuit, and the band's attorney called the legal situation a &quot;misunderstanding&quot;.\n\nRobert DeLeo, against Atlantic Records's wishes, insisted that he and his brother Dean DeLeo produce the record themselves, which began production in early 2009. Because recording took place during breaks in the band's touring schedule, production took nearly ten months to complete. Three studios were used simultaneously, including Robert's home studio and Eric Kretz's Bomb Shelter Studios. Scott Weiland recorded vocals at his own Lavish studios. Don Was, a record producer, was brought in as an additional producer to help keep the band's separate recording sessions in sync, as well as to work closely with Weiland during the recording of his vocals. The album was completed in December 2009, and mixing and mastering were finished by February 2010.\n\nThe album received generally favorable reviews. Most critics agreed that Stone Temple Pilots was heavily inspired by country and rock music from the '60s and '70s. The band confirmed these assertions and, in interviews, discussed their influences, which included country music, lyricists like Bob Dylan, and guitarists like Speedy West and Brad Whitford. The album was promoted during the band's performances at music festivals and headlining concerts, as well as a myriad interviews with music websites, magazines, including Billboard and Spin, and radio and television talk shows. &quot;Between the Lines&quot; was the first single, released on March 22, and an accompanying music video was released on May 7. The second single, &quot;Take a Load Off&quot;, was released on June 15. Stone Temple Pilots sold 62,000 copies in its first week and peaked at #2 on the Billboard 200.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:aad8ab77946f7cc648f422e8e4fa20d1b067bfc6","amp;dn":"Stone+Temple+Pilots+-+Take+A+Load+Off+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aad8ab77946f7cc648f422e8e4fa20d1b067bfc6","infoHashBuffer":{"type":"Buffer","data":[170,216,171,119,148,111,124,198,72,244,34,232,228,250,32,209,176,103,191,198]},"announce":[],"urlList":[]}}