{"title":"Holland Taylor Series - David Housewright (Mystery)","uid":10052603,"size":1132872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab438fb401b6315127c74b5d094545f09e149fa8&amp;dn=Holland+Taylor+Series+-+David+Housewright+%28Mystery%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1398623809,"description":"Penance (1995)\n(The first book in the Holland Taylor series)\n\nIntrigue runs deep when a Minnesota detective finds murder, blackmail, and politics all wrapped up with a gubernatorial race involving people from his past, but it is not until a murder hits close to home does he begin to play tough. \n\nPractice to Deceive (1997)\n(The second book in the Holland Taylor series)\n\nHousewright's Edgar Award-winning first novel, Penance, introduced readers to Holland Taylor, a wisecracking, cynical ex-cop turned PI. Now Taylor takes on a shocking embezzlement case that puts millions of dollars, the reputations of the city's most powerful people--and even Taylor's own life--on the line...\n\nAbout the Author\nA reformed newspaper reporter and ad man, Housewright's book &quot;Penance&quot; (Foul Play Press) earned the 1996 Edgar Award for Best First Novel from the Mystery Writers of America and was nominated for a Shamus in the same category by the Private Eye Writers of America. He has won three Minnesota Book Awards for &quot;Practice to Deceive&quot; (1998), &quot;Jelly's Gold&quot; (2010) and &quot;Curse of the Jade Lily&quot; (2013). (His novels &quot;Tin City,&quot; &quot;The Taking of Libbie, SD,&quot; and &quot;The Devil and the Diva&quot; were nominated for the same prize, but did not win.) Housewright's 16th novel - &quot;The Devil May Care&quot; - will be published by St. Martin's Minotaur in June, 2014. He also has a volume of short stories called &quot;Full House&quot; available through Down and Out Books. All of his books are available on Kindle. Housewright was elected President of the Private Eye Writers of America in 2014. Website: www.davidhousewright.com. He can also be found on Facebook and Twitter.","torrent":{"xt":"urn:btih:ab438fb401b6315127c74b5d094545f09e149fa8","amp;dn":"Holland+Taylor+Series+-+David+Housewright+%28Mystery%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab438fb401b6315127c74b5d094545f09e149fa8","infoHashBuffer":{"type":"Buffer","data":[171,67,143,180,1,182,49,81,39,199,75,93,9,69,69,240,158,20,159,168]},"announce":[],"urlList":[]}}