{"title":"Infectious Burden: The Cause Of Aging And Age-Related Disease","uid":14707970,"size":1890197,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acba8811e3425ad18edfefc3ea42bc7add6e6e23&amp;dn=Infectious+Burden%3A+The+Cause+Of+Aging+And+Age-Related+Disease&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1464383744,"description":"Infectious Burden: The Cause Of Aging And Age-Related Disease\r\n\r\n\r\n\r\nMore than 100 years ago, the major causes of death were infectious-related. However, over the past 100+ years, deaths related to infectious disease have been dramatically reduced. So can we say that the war against infectious disease is over? \r\n\r\nDefinitely not! Humans are completely outnumbered by microbes, including bacteria and viruses, by at least 1,000,000,000,000,000,000,000 to 1! Our existence is under constant microbial attack, and eventually, our immune system can't properly handle this challenge. Infectious microbes enter and live inside us, where they cause insulin resistance, inflammation, telomere shortening, and oxidative stress, four major theories about why we age. In addition, infectious burden is involved with the major causes of death in 2016, including cardiovascular disease, cancer, stroke, Alzheimer’s disease, and diabetes. We haven’t eliminated infectious disease, we have merely delayed it! \r\n\r\nThis book will present evidence that supports the hypothesis that ageing and age-related disease are caused by infectious burden. Also, how can we fight back? Microbes can enter us through the gut, skin, mouth, and lungs. With the goal of reducing infectious burden to minimize aging and age-related disease, evidence about how to optimally fortify these barriers is presented","torrent":{"xt":"urn:btih:acba8811e3425ad18edfefc3ea42bc7add6e6e23","amp;dn":"Infectious+Burden%3A+The+Cause+Of+Aging+And+Age-Related+Disease","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acba8811e3425ad18edfefc3ea42bc7add6e6e23","infoHashBuffer":{"type":"Buffer","data":[172,186,136,17,227,66,90,209,142,223,239,195,234,66,188,122,221,110,110,35]},"announce":[],"urlList":[]}}