{"title":"9th Dawn RPG + v1.60","uid":8922370,"size":24163238,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:acbe5a878a440083e1bd1b8ceb7ba92d6effb527&amp;dn=9th+Dawn+RPG+%2B+v1.60&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1379284080,"description":"\nAre you a fan of oldschool RPGs like Ultima, but crave the openness and exploration in modern games? If so, we at Valorware are dedicated to giving you just that! We are proud to present 9th Dawn, a game that's a blend of modern and traditional design and gameplay and sports the largest open world experience available today in a mobile RPG! \n\nExplore the large island continent of Montelorne, a land far detached from the mainland, but filled with mystery, danger, and last but not least, adventure. You begin your journey in the small village of Agaria, but once you gain your bearings, you'll find yourself immersed in a world of its own.\n\nPlay as one of three of the traditional classes: The sturdy knight, skilled in the art of combat and possessing the ability to wield heavy armour and weapons; the nimble archer, capable of swiftly dispatching a foe from afar or up close with his daggers; the wise mage, master of the elements and capable of utilizing powerful magic spells and summoning abilities to obliterate the enemy.\n\nWhether it's searching for hidden artifacts and treasure, helping the troubled Montelornians with the rising undead armies, or simply exploring the massive world and its many towns, dungeons, and forests, there is no shortage of fun for a bold adventurer to partake of!\n\nWe would personally like to thank all of our supporters and players, whether they be from our failed Kickstarter campaign, a fan of our tech demo that we released some months back, or a family member or friend. It is your interest and support that has driven this project and gotten us to this point in the game's development. It may have taken us a bit longer, but we are proud to present the game to you all as it is now.\n\nIf you are uncertain of purchasing right now, feel free to check out the free version of the game! The free version contains all of the features of the full game; it just limits you to a small portion of the world map.\nWe are currently aware of some issues which affect framerate and loading times. If you encounter a long loading time or black screen, give it some time. \n\nMobile phones have not quite caught up yet for such an open world, expansive map system, but we are making efforts to enhance the performance experience and will be adding options to enhance performance on lower end phones in the future. Note: We do not guarantee support for resolutions below 320x480, but the game should run great on tablets.\n\nWe strongly encourage all players to e-mail us with any questions, concerns, suggestions, bug reports, or otherwise at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ea999f9a9a85989eaa9c8b8685989d8b988fc4898587c4&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; We make it one of our top priorities to personally respond to all e-mails we get from you, because your thoughts are important to us! In addition, you can also follow us and chat with us on Facebook, where we post most of our development updates for you to keep up with!\n\nWhat's New\n\nWe are currently building a new game engine for our next entry in the 9th Dawn series: Remnants of Caspartia. We expect the engine to be in good working order sometime in October and will be remaking the original (this game) in it and releasing that as a free update! That means no more bugs, new features, new content, more options, and possibly multiplayer! Stay tuned for more!\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.valorware.ninthdawn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.valorware.ninthdawn&lt;/a&gt;\n","torrent":{"xt":"urn:btih:acbe5a878a440083e1bd1b8ceb7ba92d6effb527","amp;dn":"9th+Dawn+RPG+%2B+v1.60","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acbe5a878a440083e1bd1b8ceb7ba92d6effb527","infoHashBuffer":{"type":"Buffer","data":[172,190,90,135,138,68,0,131,225,189,27,140,235,123,169,45,110,255,181,39]},"announce":[],"urlList":[]}}