{"title":"Lynda - After Effects Apprentice Short Courses Complete","uid":13640707,"size":17778319428,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:acf20af4ee9249699066d2589ed5a5fde749be11&amp;dn=Lynda+-+After+Effects+Apprentice+Short+Courses+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"mrodgers","files":563,"time":1456134124,"description":"One of our priorities in the creation of the After Effects Apprentice video series is that it be relevant for a large number of users. So last fall we gave it a major update for CS6 users, and the day after After Effects Creative Cloud was released we updated it again for CC users. This now makes the After Effects Apprentice series compatible with all After Effects versions since CS5. Premium subscribers using After Effects CC should download and use the CS6 version of the exercise files.\r\n\r\nThe initial release of After Effects CC saw the addition of several advanced features, such as Warp Stabilizer VFX and the Live 3D Pipeline between After Effects and MAXON CINEMA 4D. Since the Apprentice series focuses on the fundamental tools in After Effects, not many changes were required for CC users—we primarily added captions to note where shortcut keys or parameter names changed. To address the major features of After Effects CC, the new captions will also refer you to the relevant chapters in our course After Effects: Creative Cloud Updates, also available on lynda.com.\r\n\r\nWe realize many of you who are watching the After Effects Apprentice video courses also have a copy of our book After Effects Apprentice 3rd Edition. We’ve also released a PDF file that cross-references feature changes in After Effects CC with specific pages in that book. You can download it here.\r\n\r\nSo whether you’ve already upgraded to After Effects CC or are putting off your move to Creative Cloud until later, we’ve got you covered. Enjoy!","torrent":{"xt":"urn:btih:acf20af4ee9249699066d2589ed5a5fde749be11","amp;dn":"Lynda+-+After+Effects+Apprentice+Short+Courses+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acf20af4ee9249699066d2589ed5a5fde749be11","infoHashBuffer":{"type":"Buffer","data":[172,242,10,244,238,146,73,105,144,102,210,88,158,213,165,253,231,73,190,17]},"announce":[],"urlList":[]}}