{"title":"Monsta Island Czars - Escape from Monsta Island!","uid":5077500,"size":143854552,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ad05ca1f84c7bf888ae2d385ea4d7b60e11e304b&amp;dn=Monsta+Island+Czars+-+Escape+from+Monsta+Island%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rocha02","files":21,"time":1251992762,"description":"Straight out of B grade movies and into a A grade album, the Monsta Island Czars mix Kaiju movies with indie hiphop. The super group consists of Gigan, Jet Jaguar (MF Grimm), Kamackeris, King Cesar (X-Ray), King Ghidra (MF Doom), Kong, Spiega, Megalon and Rodan. You could best think of them as Wu-Tang but using monster flicks instead of Kung Fu.\n\nI would imagine that most people would pick up the album just for the MF Doom or Grimm content, but Grimm isn't on the album at all (incarcerated at the time, but came up with the album idea) and Doom only raps on one track (MIC Line). Even without the two MF's, the others Czars on the mic and X-Ray on the beats are more than capable and have their own distinctive sound.\n\nX-Ray produces the bulk of the tracks (Doom does a few), his production is raw, minimalistic and almost cinematic at times. He frequently mixes piano with drum loops, not dissimilar to some of RZA's work. Skits featuring samples from Kaiju movies are thrown in between tracks which works well. All of the mc's have a raw sound, with Kamackeris' slick rhymes and flow and Rodan's relentless delivery making them the stand out performers.\n\nThe first track M.I.N.Y.A is the only track that instantly stands out, X-Ray puts down an incredibly funky beat with Kamackeris opening with one of the albums best verses. The rest of the tracks feature great production and verses, but just don't stand out as much as M.I.N.Y.A. The only weak and out of place track is the Doom produced 'Comin' at You', which has an upbeat synth sound and an almost cheesy female hook.\n\n20 tracks deep, &quot;Escape From Monsta Island!&quot; is an LP that you can listen to over and over again and find something new in it every time. It overflows with beats, lyrics, ideas, and energy. The concept is extremely original and none of the producers or emcees stray away from the project's intention. If you like your hip-hop underground and dirty with hunger and extreme force, this album is for you.\n\n\n1 \tWhat's the Name of This Place? \t\t\n2 \tM.I.N.Y.A (Kamackeris, Rodan, Kong, Megalon &amp; X-Ray)\n3 \tF@#K Y'all N!@@#'s (Kamackeris, Megalon &amp; X-Ray)\n4 \tWitchCraft (Rodan, Megalon, Kong, Kamackeris, Spiega, King Caesar &amp; X-Ray)\n5 \t1,2... 1,2 (Kong, Megalon, Rodan &amp; King Geedorah) \n6 \tScientific Civilization (skit) (King Geedorah) \t\n7 \tMIC Line (King Geedorah)\n8 \tPoizon Windz (Megalon, Rodan, Gigan &amp; X-Ray)\n9 \tUnder Pressure (Spiega, Megalon, Rodan, Kong &amp; X-Ray)\n10 \tBecame A Monsta (Spiega &amp; X-Ray)\n11 \tThere's A Legend (skit) (X-Ray)\n12 \tOut My Mind (King Caesar, Kamackeris, Megalon &amp; X-Ray)\n13 \tWarning (Kong &amp; X-Ray)\n14 \tMake It Squash (Kong, Megalon, King Caesar, Rodan &amp; King Geedorah)\n15 \tGunz 'n' Swordz (Gigan, Megalon &amp; X-Ray)\n16 \tSumthin' to Prove (Rodan &amp; X-Ray)\n17 \tLive Son Of A Bitch (skit) (X-Ray) \t\n18 \tComin' at You (Megalon, Rodan, Kamackeris, Kong &amp; King Geedorah)\n19 \tTake Control (Kamackeris &amp; X-Ray)\n20 \tEscape From Monsta Isle (Rodan, Megalon, Kong, Spiega &amp; King Geedorah)\n\nBitrate: 320 kbps\t\t\n","torrent":{"xt":"urn:btih:ad05ca1f84c7bf888ae2d385ea4d7b60e11e304b","amp;dn":"Monsta+Island+Czars+-+Escape+from+Monsta+Island%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad05ca1f84c7bf888ae2d385ea4d7b60e11e304b","infoHashBuffer":{"type":"Buffer","data":[173,5,202,31,132,199,191,136,138,226,211,133,234,77,123,96,225,30,48,75]},"announce":[],"urlList":[]}}