{"title":"Gemcraft 2 Chasing Shadows v1.0.12 (Premium) (Works on Linux)","uid":9992701,"size":27513862,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ad0ca6d400931bad83ae1d44ffbb4c6adc33e784&amp;dn=Gemcraft+2+Chasing+Shadows+v1.0.12+%28Premium%29+%28Works+on+Linux%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"okonomiyaki","files":1,"time":1397870831,"description":"Gemcraft: Chapter 2: Chasing Shadows, version 1.0.12\n\n\nBackground:\nI used JPEXS open-source flash decompiler to edit several different lines in the code of this game..\n\nTherefore, this version differs from the .swf file on armorgames site..\n\nThis one differs in the following ways:\n\n- Removed the website check, so you can run it from your local hard-drive, and don't have to play it on armorgames or be connected to the internet at all..\n\n- Removed the flash-version check, which means that you can finally play it on Linux! woohoo!\n\n- Enabled the &quot;Premium&quot; mode (also known as &quot;magician's pouch&quot;) for all save slots, EVEN the local saves! So now you can use all the skills and apparently premium mode also unlocks &quot;endurance mode&quot; too.. Normally, even when you pay your hard-earned money to buy premium mode, the game only let's you use premium skills et cetera. on an ONLINE slot only, and will put you in non-premium mode if you use a local save slot. I've removed this artificial limitation, so now you can use premium mode even on *local* save slots!\n\nSo, please enjoy this game every one.. And, you might try playing with JPEXS your self, it isn't that difficult to use.. I won't always be around to constantly upload the newest version of gemcraft for you.. You're going to have to learn to take care of your self some day son.. And if you do, be sure to upload it so that every one can enjoy your labor too..\n\nOne disadvantage of this version: It is impossible to NOT use premium mode.. So if you want to play with basic mode for some weird reason, well, I'm sorry, but you can't..\n\nOne more note: The premium-unlocked &quot;Endurance mode&quot; really does ruin the balance of the game.. So, if you really want to enjoy gemcraft like it was meant to be enjoyed, I would refrain from using endurance mode for as long as possible.. Other-wise you will beat it too fast and then have nothing to play..","torrent":{"xt":"urn:btih:ad0ca6d400931bad83ae1d44ffbb4c6adc33e784","amp;dn":"Gemcraft+2+Chasing+Shadows+v1.0.12+%28Premium%29+%28Works+on+Linux%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0ca6d400931bad83ae1d44ffbb4c6adc33e784","infoHashBuffer":{"type":"Buffer","data":[173,12,166,212,0,147,27,173,131,174,29,68,255,187,76,106,220,51,231,132]},"announce":[],"urlList":[]}}