{"title":"Ellis Paul - Stories [1994][EAC,log,cue.FLAC]","uid":9236997,"size":293544428,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad547dc6795ca3f317284a692839ff51f483ca79&amp;dn=Ellis+Paul+-+Stories+%5B1994%5D%5BEAC%2Clog%2Ccue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1385194828,"description":"Artist: Ellis Paul\nRelease: Stories\nReleased: 1994\nLabel: Philo CD\nCatalog#: PH 1181\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk\n\nimage\n\n\n01 All Things Being the Same 3:41\n02 3,000 Miles 3:51\n03 Here She Is 3:52\n04 Autobiography of a Pistol 4:13\n05 River 4:37\n06 Last at the Table 4:22\n07 Last Call 4:16\n08 Who Killed John Lennon 4:26\n09 King of 7th Avenue 5:46\n10 Looking for My Friends 4:12\n11 Don't Breathe 4:21\n12 Secret Track 1:14\n\n\nStories, Paul's second album, was originally issued by Black Wolf Records in 1994. With his distinctive, plaintive singing and writer's eye for details, the album features Paul's intimate confessional side (&quot;Here She Is,&quot; &quot;Last Call&quot; ) and a previously-unheard rockier side, his vocals floating above a full band driven by guitarist extraodinaire Duke Levine (who produced the album with Ellis), and Hammond organist Tom West (&quot;All Things Being The Same,&quot; &quot;Last at the Table&quot;). \n\nThe Players: Ellis Paul, vocals, acoustic guitar, harps Duke Levine, electric guitars, mandolin, lap steel, six-string bass, baritone guitar, bass on &quot;Autobiography of a Pistol&quot; Richard Gates, bass / Doug Plavin, drums Jon Svetkey, vocals, acoustic guitar on&quot;Last at the Table&quot; Brendan Devitt, acoustic guitar on &quot;Don't Breathe&quot; Tom West, Hammond B-3 organ Johnny Cunningham, violins Alain Mallet, accordion Patty Griffin, vocals Martin Sexton, vocals Jennifer Kimball, vocals Jonatha Brooke, vocals \n\n&quot;Ellis Paul is among the best of the new breed of writers. His images are rich and speak of issues most of us sweep away to another place. His songs speak about real people, the people many of us never see, those in need of understanding . . . lost people . . .characters who reflect the polarization of society, a society losing it's grip on compassion. --[COLOR=blue]Dick Pleasants, The Folk Heritage, WGBH/WUMB \n\n&quot;Ellis Paul has always been a songwriter's songwriter. The kind of peer respect that usually comes only with years of seasoning has somehow always been his . . . no emerging songwriter in recent memory has been more highly touted or respected by songwriters than this 28 year old Maine native.&quot; --[COLOR=blue]Scott Alarik, Boston Globe \n\n&quot; . . . a spinner of intimate, closely observed tales that address universal themes of despair, displacement and longing . . . songs that draw you in just as surely as a whispered secret.&quot; --[COLOR=blue]The Washington Post \n\nSpeaking of great songwriters, get your hands on a copy of Stories, Ellis Paul's second release. It's easy to hear why he won a batch of awards recently, including being named &quot;Boston's Best Songwriter&quot; at the 1994 Boston Music Awards and winning the &quot;New Folk&quot; competition at this years Kerrville, TX Folk Festival. Paul delivers his lyrics that read like poetry with a high, clear voice that can be as fragile or tough as the song allows and each one strikes directly at the heart. Very special.&quot; --[COLOR=blue]CMJ \n\n&quot;Paul's solid open tuned rhythms and soaring tenor are fleshed out by session-ace producer Duke Levine high electric punctuation. Discursive, earnest songs seduce and interrogate, celebrate and condemn. Outstanding.&quot; --[COLOR=blue]Guitar Player \n\n&quot; . . . start spreading the word! I think this is one that I'll still be playing on a regular basis for years.&quot; --[COLOR=blue]David Elbert, Folk &amp; Acoustic Music Exchange.\n","torrent":{"xt":"urn:btih:ad547dc6795ca3f317284a692839ff51f483ca79","amp;dn":"Ellis+Paul+-+Stories+%5B1994%5D%5BEAC%2Clog%2Ccue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad547dc6795ca3f317284a692839ff51f483ca79","infoHashBuffer":{"type":"Buffer","data":[173,84,125,198,121,92,163,243,23,40,74,105,40,57,255,81,244,131,202,121]},"announce":[],"urlList":[]}}