{"title":"The Complete Works of Isaac Babel","uid":9252347,"size":2371403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae7bd79ae18d0a26bd5d7e2803650305ad278076&amp;dn=The+Complete+Works+of+Isaac+Babel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"APGHOSH","files":-1,"time":1385485673,"description":"Considered one of the greatest writers of the twentieth century--and the most revered short-story writer since Chekhov--Isaac Babel (1894-1940) left an extraordinary literary legacy that continues to grow, remarkably, more than sixty years after his death.This magnificent edition of Babel's collected work fulfills a lifelong ambition of Babel's daughter, Nathalie, who has authorized and edited the entire collection, and has collaborated with award-winning translator Peter Constantine in readying the work for publication. Every story or selection included in this volume (147 in total) has been newly edited and translated, beginning with Babel's first published story, &quot;Old Shloyme,&quot; originally published in 1913, and concluding with two scenes from a screenplay that Babel did not live to see made into a film. Included in The Complete Works are stories that will be familiar to Babel enthusiasts, like the &quot;Red Cavalry&quot; cycle and his diaries, as well as untranslated stories and other works that appear in English for the first time.\nTo read Babel is to relive the wild and often terrifying swings of twentieth-century Russian history. No writer has conveyed with such emotion and convulsive energy the tragic story of a modern nation that remained a prisoner of its brutal and repressive past. Combining the compassion of Dostoevsky with the mordant wit of Chekhov, Babel injected a daring social criticism and a palpable sexual tension into the literary climate of post-tsarist Russia. In the process, he created a style so vivid, so lacerating, and so utterly hypnotic that his stories have come to define the sanguinary landscape of the Soviet Union in the years between the two world wars.","torrent":{"xt":"urn:btih:ae7bd79ae18d0a26bd5d7e2803650305ad278076","amp;dn":"The+Complete+Works+of+Isaac+Babel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7bd79ae18d0a26bd5d7e2803650305ad278076","infoHashBuffer":{"type":"Buffer","data":[174,123,215,154,225,141,10,38,189,93,126,40,3,101,3,5,173,39,128,118]},"announce":[],"urlList":[]}}