{"title":"Seal - Kiss From A Rose (Live)  (2nafish)","uid":5339653,"size":197888004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aedfd7c57b14fc43c32728790df7c6930550fca3&amp;dn=Seal+-+Kiss+From+A+Rose+%28Live%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265428052,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Kiss from a Rose&quot; is a song from Seal's second eponymous album Seal (aka Seal II). The song was first released as a single in July 1994. Re-released in 1995, it was included on the Batman Forever film soundtrack, helping it top the charts in the U.S. and Australia. It took the 1996 Grammy Awards for both Record of the Year and Song of the Year. Seal also won Best Male Pop Vocal Performance.\n\nWritten by Seal and Trevor Horn, the single &quot;Kiss from a Rose&quot;, the second taken from the Batman Forever film soundtrack, topped the U.S. Billboard Hot 100 for one week in August 1995. It also went to #4 on the UK Singles Chart. The single originally made it to #20 in 1994, but upon being re-released after being featured in the film, it reached the top position. It was also nominated for a 1996 MTV Movie Award.\n\nSeal (sometimes referred to as Seal II to avoid confusion with the 1991 album of the same name) is the second self-titled album of singer Seal. The album was released in 1994 on ZTT/Sire Records.\n\nThe image on the cover has since become nearly synonymous with Seal, in that it has appeared on several singles covers and was recycled for his greatest hits album.\n\nSeal Henry Olusegun Olumide Adeola Samuel (born 19 February 1963 in Paddington, London, United Kingdom) is a British soul singer and songwriter, of Nigerian ethnicity. His name Olusegun means &quot;God is victorious&quot;. Known professionally by his first name, Seal is known for his numerous international hits and his marriage to German model Heidi Klum.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:aedfd7c57b14fc43c32728790df7c6930550fca3","amp;dn":"Seal+-+Kiss+From+A+Rose+%28Live%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aedfd7c57b14fc43c32728790df7c6930550fca3","infoHashBuffer":{"type":"Buffer","data":[174,223,215,197,123,20,252,67,195,39,40,121,13,247,198,147,5,80,252,163]},"announce":[],"urlList":[]}}