{"title":"Advances in Peritoneal Surface Oncology","uid":6528773,"size":4574430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aee0c919ff8062f306b0e84a7acb5ec5d0f474e3&amp;dn=Advances+in+Peritoneal+Surface+Oncology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1310249115,"description":"S. GonzÃƒÂ¡lez-Moreno, &quot;Advances in Peritoneal Surface Oncology&quot; \n Publisher: Springer | ISBN: 3540307591 | edition 2007 | PDF | 176 pages | 4.36 mb\n\n Malignant peritoneal disease in its various forms is a devastating condition for patients who suffer from it and it poses a significant challenge for the clinicians taking care of them. Research efforts in this field have traditionally been scarce under the assumption of a uniformly fatal and hopeless outcome.\n\n In the last few decades a renewed interest in peritoneal carcinomatosis and primary peritoneal malignancies has occurred. Unprecedented favourable results reported with the employment of aggressive cytoreductive surgery combined with perioperative intraperitoneal chemotherapy have catalysed a change in the conception and treatment alternatives for these diseases. Selected patients can now be offered a curative-intent combination therapy, whereas in the past only the best possible palliation could be considered.\n\n This book is a comprehensive compilation of the new knowledge in peritoneal surface oncology in the dawn of the twenty-first century. It covers the complete spectrum of the latest research carried out in peritoneal malignant dissemination, from its pathogenesis and molecular mechanisms to the latest clinical trials. Additionally, the essentials of perioperative intraperitoneal chemotherapy and the modern histopathological assessment of peritoneal surface malignancy are reviewed. A unique historical perspective on how this new knowledge has unfolded over the years helps point out the future research directions to be pursued. Leading experts in this field from around the world, including the pioneers who gave birth to this new era in oncology, form an unbeatable and outstanding panel of authors.","torrent":{"xt":"urn:btih:aee0c919ff8062f306b0e84a7acb5ec5d0f474e3","amp;dn":"Advances+in+Peritoneal+Surface+Oncology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee0c919ff8062f306b0e84a7acb5ec5d0f474e3","infoHashBuffer":{"type":"Buffer","data":[174,224,201,25,255,128,98,243,6,176,232,74,122,203,94,197,208,244,116,227]},"announce":[],"urlList":[]}}