{"title":"Tom Clancy's Ghost Recon: Future Soldier Lossless Repack R G Ori","uid":8061447,"size":9550514223,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:af14668242baff0430181459b8f8663a01e87b08&amp;dn=Tom+Clancy%27s+Ghost+Recon%3A+Future+Soldier+Lossless+Repack+R+G+Ori&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Taker009","files":14,"time":1359091951,"description":"Tom Clancy's Ghost Recon: Future Soldier Lossless Repack R G Origami \n\n[INCLUDING Raven strike DLC] \n\n\n\nReleased: 2012\nGenre: Action (Shooter) / Tactic / 3rd Person\nDeveloper: Ubisoft\nPublication Type: Repack\nLanguage: English, Russian\nSound language: Russian, English\nCrack: enclosing (SKIDROW)\nGame Version: v.1.6\n\nSYSTEM REQUIREMENTS:\n\nOperating system: Windows Vista (SP2),  Windows 7 (SP1) (Windows XP is currently not supported!)\nProcessor: Intel Pentium D 3,0 GHz or AMD Athlon64 X2 4400 + 2.2 GHz;\nRAM: 2 GB;\nVideo: Nvidia GeForce 8600 / Radeon HD 2600 512 MB;\nFree hard disk space: 11.5 GB\n\n\n\nGhost Recon: Future Soldier promises to go beyond a series of war games, Ghost Recon, and give us a completely new gameplay. The game offers cutting-edge technology, prototype high-tech weapons, modern single-player and multiplayer modes. &quot;Ghosts&quot;, an elite soldier in the Special Forces are ready to complete the task at any point of the globe. Their work - the fight against terrorism, the neutralization of enemy agents and the destruction of a superior enemy. Over time, this legendary unit ceased to be just one of the special forces and turned into an ideal tool that can change the fate of mankind. Equipped with the latest technology, equipped with the best development of military technology, these professionals keep you company in a number of specific military operations. You are waiting for the hot sands of Africa and the Antarctic ice, penetration of secretive missions and battle for survival. In the role of one of the men you have to fight side by side with the best squad operatives. Now is the time to demonstrate the worth of true professionals!\n\n\nGAME FEATURES:\n\nStay one step ahead of the enemy: Cross Com transmits relevant information directly on the glass of your points. The interface allows you to monitor and track the movement of drones key enemy targets.\n- Become invisible: to optical camouflage to pass unnoticed through the dangerous areas and gain a tactical advantage over the enemy.\n- Noted and destroy: Check your enemies in the area of sight or within sight of your drone and run synchronous attack on enemy targets.\n- Do not fall for the eyes: Use a unique system of dynamic hiding to surprise, to evade and eliminate the enemy.\n- Weapons and Equipment &quot;Tomorrow&quot; - thermal imaging, optical camouflage, reconnaissance and combat drones, and much more.\n- Outstanding opportunities for customization and selection of each and every element of its own weapons - more than twenty million combinations build unique weapons\n\n\nREPACK FEATURES:\n\nDo not recoded\nNew Raven Strike DLC included\ngame has been updated to version v.1.6\nInstallation Time ~ 20 min","torrent":{"xt":"urn:btih:af14668242baff0430181459b8f8663a01e87b08","amp;dn":"Tom+Clancy%27s+Ghost+Recon%3A+Future+Soldier+Lossless+Repack+R+G+Ori","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af14668242baff0430181459b8f8663a01e87b08","infoHashBuffer":{"type":"Buffer","data":[175,20,102,130,66,186,255,4,48,24,20,89,184,248,102,58,1,232,123,8]},"announce":[],"urlList":[]}}