{"title":"Phenomenon - Music From the Motion Picture 1996","uid":9436673,"size":109271742,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:af8d46e19403e650430f305f57b3ef9579ed0059&amp;dn=Phenomenon+-+Music+From+the+Motion+Picture+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1388920040,"description":"Phenomenon - Music From the Motion Picture 320cbr (Big Papi) 1996 Soundtrack\n\n\n01 Eric Clapton - Change the World.mp3\t9.14 MB\n02 Bryan Ferry - Dance With Life (Brilliant Light).mp3\t14.42 MB\n03 Robbie Robertson - Crazy Love.mp3\t10.42 MB\n04 Taj Mahal - Corinna.mp3\t7.02 MB\n05 Jewel - Have a Little Faith in Me.mp3\t10.22 MB\n06 Peter Gabriel - I Have the Touch.mp3\t12.61 MB\n07 Marvin Gaye - Piece of Clay.mp3\t11.99 MB\n08 Iguanas, The - Para Donde Vas.mp3\t7.68 MB\n09 Dorothy Moore - Misty Blue.mp3\t8.49 MB\n10 J.J. Cale - A Thing Going On.mp3\t6.16 MB\n11 Thomas Newman - The Orchard.mp3\t5.95 MB\n\n\n\nSource: 1996 CD\n\n\n\nBy L.A. Scene\n\nThere is no question that John Travolta has had one of the most successful movie careers of all time. Sometimes people forget that Travolta movies have been associated with three very popular soundtracks - &quot;Saturday Night Fever&quot;, &quot;Urban Cowboy&quot;, and &quot;Grease&quot; (Travolta would actually sing on that one). Many forget is that there is a fourth Travolta film that has one of the all-time great soundtracks - that film being &quot;Phenomenon&quot;. Not only did &quot;Phenomenon&quot; have a great soundtrack, but it probably is both the most underrated performance and underrated film in Travolta's career. One thing that makes the &quot;Phenomenon&quot; soundtrack so outstanding is that it truly captures the essence of the movie. As you listen to the soundtrack, you truly feel like to are watching the movie. Not only is this a great soundtrack, I would venture to say that this was the best album for 1996.\n\nTo understand why the &quot;Phenomenon&quot; soundtrack is so good - one must have a little background on the movie. Travolta plays George Malley - a small town man whose life changes after he sees a flash of light. Following that encounter, George begins to experience genius and telekinetic powers. However the government becomes wary of George's newfound powers However George learns that he has a rare brain tumor that is causing his brain to act the way he is. The tumor is slowly killing George. The film deals with George dealing with his powers, the government, a relationship with Lace Pennamin (played by Kyra Sedgwick), and his own mortality. It are all of these factors that really play into the music that supports this movie.\n\nEach of the songs have some of the great producers in the business - Kenneth &quot;Babyface&quot; Edmonds, Don Was, Trevor Horn, and Robbie Robertson. However it is Robertson who serves as the executive producer to the compilation. Robertson's efforts must be applauded as he builds a soundtrack that captures the essence of the movie. The soundtrack makes great use of crooning and blues along with a &quot;coffee house&quot; sound - gelling beautifully with the movie.\n\nHere is a song by song review:\n\n&quot;Change the World&quot;: While Eric Clapton didn't write or produce this song, nor deliver his best guitar work - it is Clapton's crooning performance of some very moving lyrics that easily made this a &quot;Record of the Year&quot;. If you listen to the lyrics, the lines &quot;Change the World; I will be the sunlight of your universe&quot; support many of factors that George Malley was dealing with in this movie.\n\n&quot;Dance with Life (The Brilliant Life)&quot;: The title along gels very nicely with the whole story of George Malley. Bryan Ferry is one of the most underrated musicians and this is one of his most underrated songs. Ferry also employs a crooning style. Trevor Horn produced this song.\n\n&quot;Crazy Love&quot;: Don Was produces this Van Morrison song. This is a nice &quot;coffee house&quot; song delivered by another crooner - Aaron Neville. Neville does great justice to this cover. Robertson is also featured on this song.\n\n&quot;Corrina&quot;: I hadn't heard of Taj Mahal before, but this song really gave me a good taste. Very nice bluesy song that fits the &quot;small town&quot; flavor of George Malley's town perfectly.\n\n&quot;Have a Little Faith In Me&quot;: Don Was produces this Jewel song. I was not a Jewel fan, but this song really impressed me. Again, just from the title alone - this fits very nicely with the whole story of &quot;Phenomenon&quot;. But the whole song also fits nice. Jewel delivers a &quot;full blown&quot; performance in this song. She almost employs a &quot;gospel-like&quot; quality combined with some nice coffee house rock. I like how Jewel &quot;builds up&quot; this song as it progresses.\n\n&quot;I Have the Touch&quot;: Peter Gabriel's career is legendary. This song just adds to Gabriel's legend - and I subscribe that this might be his best performance on any record. The title and theme of this song might be the best fit of all of the songs on this soundtrack. Gabriel's unique haunting voice and style are tailor-made for the &quot;Phenomenon&quot; story. Simply put - outstanding.\n\n&quot;Pieces of Clay&quot;: This might not be Marvin Gaye's best known song, but it is a very good song. The song employs a bluesy Hendrix-like guitar at the beginning before progressing to a more traditional bluesy song. As mentioned, the whole bluesy theme fits nicely with the setting and story of this movie - and this song is no exception.\n\n&quot;Para Donde Vas&quot;: Here is another group I discovered. The Iguanas deliver an outstanding performance. This song is in Spanish and has a full blown Latin feel. It's very catchy and will have you toe-tapping.\n\n&quot;Misty Blue&quot;: A very bluesy song. This was my least favorite track of the collection. While I personally didn't care for it, I still have to say that because of this bluesy theme, this fits very well with the whole theme of the movie.\n\n&quot;A Thing Going On&quot;: J.J. Cale was the third artist I discovered on this album. I'm surprised Cale didn't make a better name for himself and that this song didn't become a hit. The guitar work in this song is almost a dead-ringer for the work of Carlos Santana.\n\n&quot;The Orchard&quot;: This is a very nice instrumental. It has a haunting quality thanks to the African-styled percussion at the beginning. This might not have the most catchy beat, but this is still one worth listening to. It is some outstanding musicianship by Thomas Newman that makes this a great finale to this collection.\n\nIt's too bad the liner notes don't include the lyrics. However, that doesn't take away from the album. When looking at 1996 albums, this album clearly deserves its place among the best - and also deserves its place among the elite Travolta soundtracks. Whether you have seen the movie or not, this collection is definitely worth getting.","torrent":{"xt":"urn:btih:af8d46e19403e650430f305f57b3ef9579ed0059","amp;dn":"Phenomenon+-+Music+From+the+Motion+Picture+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af8d46e19403e650430f305f57b3ef9579ed0059","infoHashBuffer":{"type":"Buffer","data":[175,141,70,225,148,3,230,80,67,15,48,95,87,179,239,149,121,237,0,89]},"announce":[],"urlList":[]}}