{"title":"ExXxtraSmall ~ Stella Stone NEW (A Pinch of Salt and a Dash of D","uid":13606916,"size":423190817,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b14b143e8dfdae042366bbfe144e954b87d32dd2&amp;dn=ExXxtraSmall+%7E+Stella+Stone+NEW+%28A+Pinch+of+Salt+and+a+Dash+of+D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1455891668,"description":"ExXxtraSmall ~ Stella Stone NEW (A Pinch of Salt and a Dash of Dick / TeamSkeet / 18 February 2016) 480p NEW\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kIp\r\n \nhttp://imgsnaps.com/image/kI8\r\n \nhttp://imgsnaps.com/image/kIQ\r\n \nhttp://imgsnaps.com/image/kIV\r\n\r\nStella was just making herself some food when someone knocks at the front door. It was her big sisters friend J who came over unexpectedly. He was looking for Stellas big sis but ended up not finding her. Stella invites him in and quickly looks like sparks are flying. She must be into Tall guys and it seems like J is into very small girls. Stella is finishing up in the kitchen but needs help getting something on the top shelf. J helps her out and boosts her up and peaks under clothes. He gets caught by Stella and she doesnt mind at all. she flashes her extremely tiny pussy at J and he cant help but to put his hands on her in the kitchen. She drops to her knees and starts to suck his cock right in the kitchen, gagging and deep throating in front of the stove. They move to the bedroom where he throws her petite frame on the bed and starts to destroy her. She mounts him and gets her hair pulled tight while being pounded exxxtra hard. He gets her from behind while she writhes in ecstasy from how deep hes hitting. He picks her up and slams her down on the bed, fucks as hard as he possibly can, then jumps up and rips a fat load all over Stellas ever wanting face.\r\nTags:\r\nBed, Bedroom, Big Ass, Big Dicks, Big Tits, Bimbo, BJ, Black Hair, Blowjob, Booty, Bubble Butt, Busty, Butt, Casual, Crazy, Cum On Tits, Deepthroat, Dumb, Easy, Euro, European, Facial, Girl Next Door, Handjob, Hardcore, Hispanic, Home, Indoor, Kitchen, Latin, Latina, Milf, Natural Tits, No Condom, Nympho, Pale, Pantyless, Piercings, Pornstar, Sexy, Shaved Pussy, Short Hair, Skirts, Slutty, Spanish, Straight, Tattoos, Titty Fuck, Wild","torrent":{"xt":"urn:btih:b14b143e8dfdae042366bbfe144e954b87d32dd2","amp;dn":"ExXxtraSmall+%7E+Stella+Stone+NEW+%28A+Pinch+of+Salt+and+a+Dash+of+D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b14b143e8dfdae042366bbfe144e954b87d32dd2","infoHashBuffer":{"type":"Buffer","data":[177,75,20,62,141,253,174,4,35,102,187,254,20,78,149,75,135,211,45,210]},"announce":[],"urlList":[]}}