{"title":"Armin van Buuren Anthems (All) (Mp3) (Inspiron)","uid":11102468,"size":1654114886,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b19da34030fa9e896ca3b132ba5349c63e10896c&amp;dn=Armin+van+Buuren+Anthems+%28All%29+%28Mp3%29+%28Inspiron%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-inspiron-","files":-1,"time":1411689353,"description":"=======================================================\nSite: &lt;a href=&quot; http://inspiron-trance.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://inspiron-trance.com&lt;/a&gt;\n=======================================================\n\n\n=======================================================\nF B Page: Inspiron Trance \n=======================================================\n\n\n=======================================================\nTWITTER : inspiron22\n=======================================================\t\n\nThis includes all the anthems that you might vote to, all in extended mixes for mixing purposes. All mp3 @ 320kbps!\n\n\n\n\nTracklist:\n\n\n\n\n\n01 Armin Van Buuren &amp; Orjan Nilsen - Belter.mp3\n01 Armin Van Buuren &amp; W&amp;W - D# Fat (Original Mix).mp3\n01 Armin Van Buuren - Communication Part 3 (Original Mix).mp3\n01 Armin Van Buuren - Imagine (Extended Mix).mp3\n01 Armin Van Buuren - The Sound Of Goodbye (Radio Edit).mp3\n01 Armin Van Buuren Feat. Ana Criado - Suddenly Summer (Original Mix).mp3\n01 Armin Van Buuren Feat. Fiora - Breathe In Deep.mp3\n01 Armin Van Buuren Feat. Jan Vayne - Hymne.mp3\n01 Armin Van Buuren Feat. Justine Suissa - Wall Of Sound.mp3\n01 Armin Van Buuren Feat. Laura V - Drowning (Avicii Remix).mp3\n01 Armin Van Buuren Feat. Miri Ben-Ari - Intense (Original Mix).mp3\n01 Armin Van Buuren Feat. Nadia Ali - Feels So Good (Radio Edit).mp3\n01 Armin Van Buuren Feat. Nadia Ali - Who Is Watching (Album Version).mp3\n01 Armin Van Buuren Feat. Susana - Desiderium 207.mp3\n01 Armin Van Buuren Pres. Rising Star - Clear Blue Moon (Original Mix).mp3\n01 Armin Van Buuren Vs. Arty - Nehalennia (Original Mix).mp3\n01 Armin Van Buuren Vs. Rank 1 Feat. Kush - This World Is Watching Me (Original Mix).mp3\n01. Armin van Buuren &amp; Markus Schulz - The Expedition [A State Of Trance 600 Anthem] (Original Mix).mp3\n01. Armin van Buuren - Face To Face (Extended Mix).mp3\n01. Armin van Buuren vs DJ Remy &amp; Roland Klinkenberg - Bounce Back (DJ Remy &amp; Roland Klinkenberg Remix).mp3\n02 Armin - Blue Fear (Extended Version).mp3\n02 Armin Van Buuren &amp; Dj Shah Feat. Chris Jones - Going Wrong (Original Mix).mp3\n02 Armin Van Buuren - Ful Focus (Extended Mix).mp3\n02 Armin Van Buuren - Mirage.mp3\n02 Armin Van Buuren - Precious.mp3\n02 Armin Van Buuren - Rush Hour (Extended Mix).mp3\n02 Armin Van Buuren - Shivers (Rising Star Original Mix).mp3\n02 Armin Van Buuren - Waiting For The Night (Extended Version).mp3\n02 Armin Van Buuren - We Are Here To Make Some Noise (Extended Mix).mp3\n02 Armin Van Buuren Feat. Jacqueline Govaert - Never Say Never (Extended Mix).mp3\n02 Armin Van Buuren Feat. Jaren - Unforgivable (Extended Mix).mp3\n02 Armin Van Buuren Feat. Mic Burns - Empty State.mp3\n02 Armin Van Buuren Feat. Susana - If You Should Go (Extended Mix).mp3\n02 Armin Van Buuren Feat. Trevor Guthrie - This Is What It Feels Like (Extended Mix).mp3\n02 Armin Van Buuren Feat. Vanvelzen - Broken Tonight (Extended Mix).mp3\n02 Armin Van Buuren Feat. Vanvelzen - Take Me Where I Wanna Go.mp3\n02 Armin Van Buuren Vs. Herman Brood - Saturday Night (Club Mix).mp3\n02 Armin Van Buuren Vs. Sophie Ellis Bextor - Not Giving Up On Love (Extended Version).mp3\n03 Armin Van Buuren - Control Freak (Sander Van Doorn Remix).mp3\n03 Armin Van Buuren - Miserere &amp; Rush Hour.mp3\n03 Armin Van Buuren - Sail (Original Mix).mp3\n03 Armin Van Buuren - Serenity (Original Mix).mp3\n03 Armin Van Buuren - Sunburn (Walk Through The Fire) (Extended Mix).mp3\n03 Armin Van Buuren Feat. Cathy Burton - I Surrender.mp3\n03 Armin Van Buuren Feat. Christian Burns - This Light Between Us.mp3\n03 Armin Van Buuren Feat. Gabriel &amp; Dresden - Zocalo.mp3\n03 Armin Van Buuren Feat. Racoon - Love You More (Vocal Mix).mp3\n03 Armin Van Buuren Feat. Ray Wilson - Yet Another Day (Original Mix).mp3\n04 Armin Van Buuren - Birth Of An Angel.mp3\n04 Armin Van Buuren - Virtual Friend Feat. Sophie (Extended Version).mp3\n04 Armin Van Buuren Feat. Jessie Morgan - Love Too Hard.mp3\n04 Armin Van Buuren Feat. Martijn Hagens - Golddigger.mp3\n05 Armin Van Buuren - I Don't Own You.mp3\n05 Armin Van Buuren - Pulsar (Original Mix).mp3\n05 Armin Van Buuren Feat. Airwave - Sunspot.mp3\n05 Armin Van Buuren Feat. Audrey Gallagher - Hold On To Me (Extended Mix).mp3\n05 Armin Van Buuren Feat. Justine Suissa - Burned With Desire (Rising Star Remix).mp3\n06 Armin Van Buuren - Touch Me.mp3\n06 Armin Van Buuren Feat. Laura Jansen - Sound Of The Drums (Extended Mix).mp3\n06 Armin Van Buuren Feat. Ray Wilson - Gypsy.mp3\n06 Armin Van Buuren Feat. Sharon Den Adel - In &amp; Out Of Love (Original Extended Mix).mp3\n06 Armin Van Buuren Feat. System F - From The Heart.mp3\n06 System F Feat. Armin Van Buuren - Exhale (Original Mix).mp3\n07 Armin Van Buuren - 4 Elements.mp3\n07 Armin Van Buuren - Coming Home (Extended Version).mp3\n07 Armin Van Buuren Feat. Justine Suissa - Never Wanted This.mp3\n07 Armin Van Buuren Feat. Justine Suissa - Simple Things.mp3\n07 Armin Van Buuren Feat. Lauren Evans - Alone (Extended Mix).mp3\n07 Armin Van Buuren Feat. Winter Kills - Take A Moment.mp3\n08 Armin Van Buuren - These Silent Hearts Feat. Bt (Extended Version).mp3\n08 Armin Van Buuren Feat. Cathy Burton - Rain (Extended Mix).mp3\n08 Armin Van Buuren Feat. Cindy Alma - Beautiful Life (Original Mix).mp3\n08 Armin Van Buuren Vs Nervo Feat. Laura V. - Turn This Love Around (Original Mix).mp3\n09 Armin Van Buuren - Orbion (Extended Version).mp3\n09 Armin Van Buuren Feat. Aruna - Won't Let You Go (Original Mix).mp3\n09 Armin Van Buuren Feat. Krezip - Stay.mp3\n09 Armin Van Buuren Feat. Vera Ostrova - What If (Extended Mix).mp3\n10 Armin Van Buuren &amp; Ferry Corsten - Minack (Extended Version).mp3\n10 Armin Van Buuren - In 10 Years From Now (Original Mix).mp3\n10 Armin Van Buuren Feat. Jennifer Rene - Fine Without You (Extended Mix).mp3\n10 Armin Van Buuren Feat. M.I.K.E. - Intruder.mp3\n10 Armin Van Buuren Feat. Victoria Horn - Wait For You (Song For The Ocean).mp3\n11 Armin Van Buuren - Intricacy (Extended Mix).mp3\n11 Armin Van Buuren - Last Stop Before Heaven (Original Mix).mp3\n12 Armin Van Buuren Feat. Emma Hewitt - Forever Is Ours (Original Mix).mp3\n13 Armin Van Buuren Feat. Airwave - Slipstream.mp3\n13 Armin Van Buuren Feat. Richard Bedford - Love Never Came (Original Mix).mp3\n14 Armin Van Buuren - Who's Afraid Of 138! (Extended Mix).mp3\n15 Armin Van Buuren Feat. Bagga Bownz - Reprise (Original Mix).mp3\n16 Armin Van Buuren Feat. Adam Young - Youtopia.mp3\n17 Armin Van Buuren - Save My Night (Original Mix).mp3\n21 Armin Van Buuren Feat. Christian Burns &amp; Bagga Bownz - Neon Hero (Original Mix).mp3\n\n\n\n\nEnjoy\n(Inspiron)","torrent":{"xt":"urn:btih:b19da34030fa9e896ca3b132ba5349c63e10896c","amp;dn":"Armin+van+Buuren+Anthems+%28All%29+%28Mp3%29+%28Inspiron%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b19da34030fa9e896ca3b132ba5349c63e10896c","infoHashBuffer":{"type":"Buffer","data":[177,157,163,64,48,250,158,137,108,163,177,50,186,83,73,198,62,16,137,108]},"announce":[],"urlList":[]}}