{"title":"Evolution: The Grand Experiment, Vol. I-II - Dr. Carl Werner","uid":11773188,"size":32205236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b230d03d1f6a40a2422d4c0cf800dd28dcc3a595&amp;dn=Evolution%3A+The+Grand+Experiment%2C+Vol.+I-II+-+Dr.+Carl+Werner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1427157764,"description":"\nDarwin?s book on evolution admitted that ?intermeditate links? were ?perhaps the most obvious and serious objection to the theory? of evolution. Darwin recognized that the fossils collected by scientists prior to 1859 did not correspond with his theory of evolution, but he predicted that this theory would be confirmed as more and more fossils were found. One hundred and fifty years later, Evolution: The Grand Experiment critically examines the viability of Darwin?s theory.\n\nIn 1938 the discovery of a large, unusual fish turned the scientific community on end. Dubbed a living fossil, the discovery of a coelacanth in South Africa shocked scientists around the world who thought this type of fish had died out millions of years prior during the process of evolution.\n\nLiving fossils are organisms found preserved in the fossil record, which still exist in similar form today. If the core concepts of the theory of evolution presuppose change over time, then how can these living fossils exist for millions of years remaining virtually unchanged?\n\nWhether a shark, leaf, or crab, living fossils are a challenge for evolutionary theorists and create a fascinating debate among scholars. Do they indicate a younger earth than thought, placing the millions of years timeline of evolution in question? Or do they represent a deep mystery Evolution: The Grand Experiment, Vol 2 - Living Fossils delves into these provocative questions and more.\n\nA fact-filled learning adventure as Dr. Werner takes you around the world on a unique scientific expedition from remote dig sites and museums to the Australian Rainforest and more.\n\nHow do living fossils impact one of the most controversial debates of our time - creation vs. evolution?\n\n\nAbout the author:\nDr Carl Werner is the Executive Producer of Evolution: The Grand Experiment video series and author of Evolution: The Grand Experiment book series and curriculum. He received his undergraduate degree in Biology, with distinction, at the University of Missouri, graduating summa cum laude. He received his doctorate degree in Medicine at the age 23","torrent":{"xt":"urn:btih:b230d03d1f6a40a2422d4c0cf800dd28dcc3a595","amp;dn":"Evolution%3A+The+Grand+Experiment%2C+Vol.+I-II+-+Dr.+Carl+Werner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b230d03d1f6a40a2422d4c0cf800dd28dcc3a595","infoHashBuffer":{"type":"Buffer","data":[178,48,208,61,31,106,64,162,66,45,76,12,248,0,221,40,220,195,165,149]},"announce":[],"urlList":[]}}