{"title":"Resorcerer 2.4","uid":5659133,"size":1775426,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b24cbf9817e517d7875f5d57b8869f6401934cde&amp;dn=Resorcerer+2.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Minimum91","files":-1,"time":1277906164,"description":"Resorcerer is the premiere general-purpose commercial resource editor for Macintosh computers running System 8, 9, or Mac OS X. Relied upon by thousands of Mac developers all over the world, Resorcerer features a wealth of powerful yet easy-to-use tools for easier, faster, and safer editing of Macintosh data files and resources.\n\nWhether you have to parse a picture, change one bit in a 500MB data fork, write an AppleScript to patch or build a file, transfer resource-fork-based resources to data-fork-based resource files under Mac OS X, create a scripting dictionary, build icon suites with all 144 variant icons, change the structure of existing custom resources, debug an AppleEvent from another application, design and edit a custom resource with 40,000 fields in it, find every reference to a control, try out a dialog interface under Aqua, see a Unicode glyph, magnify the screen, disassemble some PowerPC instructions to English, or any of dozens of other resource- or data-related viewing and editing tasks, Resorcerer's magic will make you more productive and quickly save you time and money.\n\nIncludes the Serial Number in the text file.","torrent":{"xt":"urn:btih:b24cbf9817e517d7875f5d57b8869f6401934cde","amp;dn":"Resorcerer+2.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24cbf9817e517d7875f5d57b8869f6401934cde","infoHashBuffer":{"type":"Buffer","data":[178,76,191,152,23,229,23,215,135,95,93,87,184,134,159,100,1,147,76,222]},"announce":[],"urlList":[]}}