{"title":"Mance Lipscomb - 1961 - Trouble In Mind (2002) FLAC","uid":11398405,"size":470242642,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2d5dd8eca0448cc9bf0afa9239f98da5e584c5e&amp;dn=Mance+Lipscomb+-+1961+-+Trouble+In+Mind+%282002%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1415393793,"description":"Mance Lipscomb - 1961 - Trouble In Mind (2002)\n\nFor whatever strange reason (not disclosed in the liner notes to the CD reissue), Mance Lipscomb's second album managed to come out on the large Reprise label, at a time when major labels in general were recording few country blues artists, and a time when Reprise specifically was far more known for adult pop. Not that it did the singer's career much good, as it sold little and Lipscomb never recorded for a major company again, the album becoming a scarce rarity prior to its 2003 CD reissue. Trouble in Mind is actually no different from the many recordings he did for the much smaller Arhoolie label. It's just Lipscomb and his acoustic guitar, affably picking and singing his way through an assortment of largely traditional material, including some well-known standards like &quot;Careless Love,&quot; &quot;Alabama Bound,&quot; &quot;Night Time Is the Right Time,&quot; &quot;Motherless Children&quot; (which has some stinging slide guitar), &quot;Johnnie Take a One on Me&quot; (better known as its variant &quot;Take a Whiff on Me&quot;), &quot;Trouble in Mind,&quot; and &quot;Ballad of the Boll Weevil.&quot; The CD reissue on Rhino Handmade doubles the length of the record by adding 13 previously unreleased tracks recorded at the same sessions, none of them alternate takes of songs that made it onto the original LP. There's no difference in the level or tone of the unreleased material, which again has some frequently covered tunes (&quot;Hey Lawdy Mama,&quot; &quot;Casey Jones,&quot; &quot;Black Gal&quot;) among lesser-known numbers, as well as a couple of instrumentals. The slide guitar-driven &quot;Frankie Was a Good Woman&quot; and the humorous &quot;You Gonna Look Like a Monkey&quot; are standouts in this batch, certainly worthy of consideration for the original album, though they didn't make that cut. Perhaps &quot;Cocaine Done Kill My Baby&quot; was considered too bold a title to include on a 1961 release, however. (AllMusic)\n\nTrack list:\n01 - captain, captain\n02 - careless love\n03 - when death comes creeping in your room\n04 - alabama bound\n05 - buck dance\n06 - night time is the right time\n07 - rocks and gravel make a solid road\n08 - johny take a one on me\n09 - motherless children\n10 - which a way do red river run\n11 - trouble in mind\n12 - ballad of the boll weevill\n13 - boogie in 'a'\n14 - hattie green\n15 - bumble bee blues\n16 - shine on harvest moon\n17 - cocaine done kill my baby\n18 - hey lawdy mama\n19 - is you gonna quit me baby\n20 - frankie was a good woman\n21 - you gonna look like a monkey\n22 - black gal\n23 - casey jones\n24 - after hours\n25 - angel child\n\nEnjoy and share!","torrent":{"xt":"urn:btih:b2d5dd8eca0448cc9bf0afa9239f98da5e584c5e","amp;dn":"Mance+Lipscomb+-+1961+-+Trouble+In+Mind+%282002%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d5dd8eca0448cc9bf0afa9239f98da5e584c5e","infoHashBuffer":{"type":"Buffer","data":[178,213,221,142,202,4,72,204,155,240,175,169,35,159,152,218,94,88,76,94]},"announce":[],"urlList":[]}}