{"title":"BBC Mud Sweat and Tractors The Story of Agriculture 3of4 Wheat X","uid":7764220,"size":782014464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3d77d31e09a0c8c01f9848d1bb7441f6a323cd4&amp;dn=BBC+Mud+Sweat+and+Tractors+The+Story+of+Agriculture+3of4+Wheat+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":1,"time":1351325289,"description":"Mud, sweat and Tractors: The Story of Agriculture\n\nHistory Documentary hosted by Charles Collingwood, published by BBC in 2010 - English narration\n\n\n\nInformation\n------------------------------\n\nBBC Mud, sweat and Tractors: The Story of Agriculture \nThe history of modern farming in Britain is presented through individual stories of man s relationship with the land. The series charts the revolution that food production in Britain underwent in the 20th Century, and examines the impact this had on the lives of farmers and consumers alike. With episodes focusing on milk, fruit and vegetables, wheat, and beef, as well as intimate and touching home movies recorded at the time, the series provides an original and largely unseen record of a century of revolution on the land. \nThis is a brilliant documentary series: with its use of archive home video it is both a loving and moving memorial to times long gone --The Times\nStrange but true - in the 1950s, strawberries were virtually the size of apples. It's a fact you can verify for yourself in this excellent social history series&quot; --The Guardian\nShorlisted for the Best History Documentary Grierson Award\n\n\n1)  Milk \nAs the 20th Century dawned, 150,000 dairy farmers milked by hand and sold milk door- to-door. By the end of the century, the 15,000 that were left were breeding cows that increased yields by 400 per cent and milk was sold through supermarkets. How and why this occurred is told through the personal home movies and stories of two dairy farmers who survived the revolution.\n\n2)  Fruit and Veg \nThe changing methods of growing, picking and selling produce is told through three staples of the British landscape: apples, strawberries and tomatoes. Home movies and archive footage reveal the extent of the revolution; and the impact supermarkets had on the fortunes of small and medium-sized farmers.\n\n3)  Wheat \nThe working lives and home movie archives of three farming families reveal how wheat farmers progressed from using horse power to machine power, and science and genetics, in their quest to transform the size and yield of their crops with controversial outcomes for the countryside.\n\n4)  Beef \nTwo of our finest native breeds of cattle, Hereford and Aberdeen Angus, reigned supreme before the Second World War and helped earn Britain a reputation as the 'stockyard of the world'.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1617 kbps\n * Video Resolution: 720 x 416\n * Video Aspect Ratio: (16:9)\n * Frames Per Second: 25\n * Audio Codec: 0x2000 (Dolby AC3)\n * Audio Bitrate: 128 kb/s AC3 48000 Hz)\n * Audio Streams: 2\n * Audio Languages: English\n * RunTime Per Part: 59.Mins\n * Number Of Parts: 4\n * Part Size: 745 MB\n * Source: DVD\n * Encoded by Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.telegraph.co.uk/culture/tvandradio/5154477/The-One-to-Watch-Wednesday-15-April.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.telegraph.co.uk/culture/tvandradio/5154477/The-One-to-Watch-Wednesday-15-April.html&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:b3d77d31e09a0c8c01f9848d1bb7441f6a323cd4","amp;dn":"BBC+Mud+Sweat+and+Tractors+The+Story+of+Agriculture+3of4+Wheat+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3d77d31e09a0c8c01f9848d1bb7441f6a323cd4","infoHashBuffer":{"type":"Buffer","data":[179,215,125,49,224,154,12,140,1,249,132,141,27,183,68,31,106,50,60,212]},"announce":[],"urlList":[]}}