{"title":"Movits! - Discography - Diskografi (2008-2015)","uid":12729096,"size":427594426,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b6148fc9acb8d91487164e85e8d7b21b08e200ac&amp;dn=Movits%21+-+Discography+-+Diskografi+%282008-2015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":51,"time":1447082654,"description":"Movits! is a Swedish music group from Luleå. The group plays swing mixed with hip hop. Their debut album Äppelknyckarjazz, literally translated as Apple swiper jazz or scrumping jazz, was released in November 2008 and has been recognized by national Swedish newspaper Dagens Nyheter. In the United States the album Äppelknyckarjazz is released by Comedy Central Records.\r\n\r\nThe name Movits! alludes to Fader Movitz, a character in the Epistles of Fredman by Swedish 18th-century poet and composer Carl Michael Bellman. The band, however, replaced the last character of the name z with an s in order to avoid being associated with Swedish bands playing dansband style music, such as Lasse Stefanz, Svänzons or Larz-Kristerz.\r\n\r\nOn July 27, 2009, Movits! was featured on the American satirical news show The Colbert Report. The band was interviewed and performed their song &quot;Fel del av gården&quot;. Colbert mentioned on his show on 30 July 2009, that the band's album Äppelknyckarjazz recently had gained significant popularity onand claimed that their appearance on his program was significantly responsible for their newfound popularity (referred to as &quot;The Colbert Bump&quot;).\r\n\r\nThe band is made up of brothers Johan Jivin' Rensfeldt (vocals), Anders Rensfeldt (multi-instrumentalist and DJ) and saxophonist Joakim 'One-Take' Nilsson","torrent":{"xt":"urn:btih:b6148fc9acb8d91487164e85e8d7b21b08e200ac","amp;dn":"Movits%21+-+Discography+-+Diskografi+%282008-2015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6148fc9acb8d91487164e85e8d7b21b08e200ac","infoHashBuffer":{"type":"Buffer","data":[182,20,143,201,172,184,217,20,135,22,78,133,232,215,178,27,8,226,0,172]},"announce":[],"urlList":[]}}