{"title":"The Anthony Cumia Show 2015-04-20 Stinky MP4 MP3","uid":11832066,"size":295328813,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b6856bbaf39b373c3089c950d93e8e1272339e87&amp;dn=The+Anthony+Cumia+Show+2015-04-20+Stinky+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1429631421,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 148 - The new weeks begins with Ant mentioning how incredible it was to have Ron Bennington on TACS last week, his time spent lounging by the pool over the weekend, re-watching the movie Animal House, and he runs down the details of trying to get into SiriusXM on Friday to do radio with Joe Rogan. We get the history of Ben Affleck's family thanks to the show &quot;Finding Your Roots&quot;, see part of the new &quot;Jurassic World&quot; trailer, Ant explains his Star Wars tweet from over the weekend, a caller brings up conspiracies, Ant wishes George Takei a happy birthday, and Garrett talks about 420. We see a possibly racist news story out of Missouri, hear about the #KylieJennerChallenge and see some of the dummies that did it, briefly talk about Lady Di's GoFundMe, get into some other random crowdfunding pages wanting help, talk about the trouble ESPN reporter Britt McHenry's cunty mouth got her in, and Ant gives his opinion on how people (aka big bugs) are using the planet. We then look at &quot;Exploding Head Syndrome&quot;, Ant attempts to analyze his dreams, goes through Monday's mail, we see a Titanic cat toy, Ant pitches cat toy ideas, reads a news story on the migrant boat that capsized in the Mediterranean, and one out of Norway about canning FM radio. Anthony then plays a news video from Seattle after a drive-by, checks out Chicago's murder rate, KtC explains reclassifying stats to help ratings, and the show ends by watching a live car chase in Riverside County, KtC reminiscing about a high speed chase of his own, and finding out that having a &quot;General Lee&quot; painted car is now racist.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:b6856bbaf39b373c3089c950d93e8e1272339e87","amp;dn":"The+Anthony+Cumia+Show+2015-04-20+Stinky+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6856bbaf39b373c3089c950d93e8e1272339e87","infoHashBuffer":{"type":"Buffer","data":[182,133,107,186,243,155,55,60,48,137,201,80,217,62,142,18,114,51,158,135]},"announce":[],"urlList":[]}}