{"title":"Wonder Woman v2 000-226 + Ex (1987-2006|Dgtl+S|Novus+Empire+)","uid":9819131,"size":6352381462,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b69585ff6831f74ce4489dca7b4f68f65da812c4&amp;dn=Wonder+Woman+v2+000-226+%2B+Ex+%281987-2006%7CDgtl%2BS%7CNovus%2BEmpire%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":13,"uploader":"VikTSlick","files":-1,"time":1395670394,"description":"This torrent is the full run of Wonder Woman v2, with all 8 annuals as well as the Secret Files &amp; Origins issues as extras. George Perez launched the new volume in 1987 and completely redefined Wonder Woman within the first 62 issues, for a more modern era. Perez also took her back to her mythological roots and built up the Amazons around her, giving the comic a large cast to use and a sense of grandeur. Other notable runs include that of Phil Jimenez (with Perez returning as artist) and Greg Rucka, which closes out the volume and is considered one of the finest sets of stories on the character yet.\n\nThe numbering is weird here due to the hodgepodge of sources, however I assure you that all 226 issues + the &quot;zero&quot; issue from 1994 and the &quot;one million&quot; special are accounted for. The scanner groups are on the individual filenames, but include Dreamgirl-Novus, Tithe-Empire, Empire proper, Minuteman-KangCouncil and a few more. Again, the sourcing is strange and some have v2 in the filename while others do not, but it is all there. The vast majority of the run is digital or HR, with only issues 26-84 being low-res original scans. ALL the groups deserve much kudos for their efforts, and if you download this PLEASE show your appreciation by seeding, as it is quite large (6 GB), though well worth the effort. Thanks, and enjoy! :-)","torrent":{"xt":"urn:btih:b69585ff6831f74ce4489dca7b4f68f65da812c4","amp;dn":"Wonder+Woman+v2+000-226+%2B+Ex+%281987-2006%7CDgtl%2BS%7CNovus%2BEmpire%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b69585ff6831f74ce4489dca7b4f68f65da812c4","infoHashBuffer":{"type":"Buffer","data":[182,149,133,255,104,49,247,76,228,72,157,202,123,79,104,246,93,168,18,196]},"announce":[],"urlList":[]}}