{"title":"British Ethical Theorists from Sidgwick to Ewing (The Oxford His","uid":11188484,"size":1779896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b78799e939f2cf41d47514b02e1981675ac70db6&amp;dn=British+Ethical+Theorists+from+Sidgwick+to+Ewing+%28The+Oxford+His&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sunghabib","files":-1,"time":1412958813,"description":"Book Description:\n\nThomas Hurka presents the first full historical study of an important strand in the development of modern moral philosophy. His subject is a series of British ethical theorists from the late nineteenth century to the mid-twentieth century, who shared key assumptions that made them a unified and distinctive school. The best-known of them are Henry Sidgwick, G. E. Moore, and W. D. Ross; others include Hastings Rashdall, H. A. Prichard, C. D. Broad, and A. C. Ewing. They disagreed on some important topics, especially in normative ethics. Thus some were consequentialists and others deontologists: Sidgwick thought only pleasure is good while others emphasized perfectionist goods such as knowledge, aesthetic appreciation, and virtue. But all were non-naturalists and intuitionists in metaethics, holding that moral judgements can be objectively true, have a distinctive subject-matter, and are known by direct insight. They also had similar views about how ethical theory should proceed and what are relevant arguments in it; their disagreements therefore took place on common ground.\n\nHurka recovers the history of this under-appreciated group by showing what its members thought, how they influenced each other, and how their ideas changed through time. He also identifies the shared assumptions that made their school unified and distinctive, and assesses their contributions critically, both when they debated each other and when they agreed. One of his themes is that that their general approach to ethics was more fruitful philosophically than many better-known ones of both earlier and later times.\n\nProduct Details:\n\nSeries: The Oxford History of Philosophy\nPDF: 325 pages\nPublisher: Oxford University Press (January 6, 2015)\nLanguage: English\nISBN-10: 0199233624\nISBN-13: 978-0199233625\nAmazon Link:\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:b78799e939f2cf41d47514b02e1981675ac70db6","amp;dn":"British+Ethical+Theorists+from+Sidgwick+to+Ewing+%28The+Oxford+His","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b78799e939f2cf41d47514b02e1981675ac70db6","infoHashBuffer":{"type":"Buffer","data":[183,135,153,233,57,242,207,65,212,117,20,176,46,25,129,103,90,199,13,182]},"announce":[],"urlList":[]}}