{"title":"Sukhishvili Assa Party","uid":6113282,"size":164634980,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b79d1395170d91bd59e94534c6e7897bf451621b&amp;dn=Sukhishvili+Assa+Party&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GioDorcel","files":-1,"time":1295445745,"description":"Disc Cover : \n  &lt;a href=&quot;\nhttp://bayimg.com/DadiCAadG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DadiCAadG&lt;/a&gt;\n\n\nLogo : \n  &lt;a href=&quot;\nhttp://bayimg.com/EAjBPaaCP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EAjBPaaCP&lt;/a&gt;\n\n\n\n\n\nArtist : Georgian National Ballet Sukhishvili.\nName : Assa Party.\nDate Created : 2003\nCountry : Georgia.\nGenre : Georgian Modern Folklor.\nType : Mp3.\n\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nMode                             : Dual mono\nBit rate mode                    : Constant\nBit rate                         : 320 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nWriting library                  : LAME3.93\n\n\n\nIn the very heart of Caucasus, and namely on the Black Sea coast, between the slopes and southern range of the great Caucasian mountains a country has been existing with two thirds of its land at 1000 meters above the sea level. And that is Georgia.\n\nSpecific geo-political location became the major reason of Georgia\\\\\\\\\\\\\\'s tragic history. It roomed great Silk Road, caravan routs linking the west with the east. It is not surprising at all that many wished to get hold of this deadly attractive crossroad. This very corridor became the transmitting channel of various cultures. Fortunately enough, it conditioned filtration of the ethnic streams and obtained an individual position in the world folklore.\n\nAs for the authentic Georgian dance, plastic \\\\\\\\\\\\\\&quot;content\\\\\\\\\\\\\\&quot; of which has preserved a true reflection of spiritual cataclysms of the nation, it was subject to strikingly quick evolution and received world recognition in the second half of 20th century. It happened with great merits to two maestros who appeared at the horizon of the Georgian culture - Iliko Sukhishvili and Nino Ramishvili, who established the Georgian National Dance Ensemble and revived almost forgotten Georgian dance art. They were the first to develop the Georgian dance music concept.\nToday, the Georgian National Ballet called after Ilia Sukhishvili, aka Sukhishvili Ensemble, brings a new tide of energy not only to the dance itself but also to the Georgian dance music. Musical accompaniment is an integral part of tempo-rhythm and character of the Georgian dance.\n\nOver years the choreographic evolution process did not amend much the dance music. This gap has now been filled and current popularisation of the folklore has been attempted by authors of this project. A club version of Georgian folk dance and music has been created.\n\nA new term folkotheque was introduced to the Georgian sub-culture. It is perceived as a breakthrough in modern Georgian music. Cultural realms of other nations were accessed. Affluence of Georgian and broadly Caucasian rhythm, musical motifs and uniqueness conditioned its particular position in world folklore. Assa is reflected in modern version music and plastics that are solidly based on national grounds.","torrent":{"xt":"urn:btih:b79d1395170d91bd59e94534c6e7897bf451621b","amp;dn":"Sukhishvili+Assa+Party","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b79d1395170d91bd59e94534c6e7897bf451621b","infoHashBuffer":{"type":"Buffer","data":[183,157,19,149,23,13,145,189,89,233,69,52,198,231,137,123,244,81,98,27]},"announce":[],"urlList":[]}}