{"title":"Rain","uid":11980545,"size":408161807,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b7c4e5d7a050f1b26cb64ef05bb3af7e8c70a6a0&amp;dn=Rain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":1,"time":1433188335,"description":"One of several versions of the often-retold story of Sadie Thompson, &quot;Rain&quot; is a tense drama that focuses effectively on the tension between two very different persons, portrayed by Joan Crawford and Walter Huston. While not always convincing, it holds the viewer's attention to the end, and often gives us plenty to think about.\n\nCrawford plays Sadie, a young woman with an immoral past, and Huston is Reverend Davidson, a fire-and-brimstone preacher who is stuck with Sadie and several other travelers for a time on a tropical island. A series of confrontations between the two follows, initiated by the reverend, who is outraged by Sadie's character and behavior. The other characters observe, comment, and occasionally try to intervene. Meanwhile, the island is engulfed in an endless, torrential rain, providing an eerily effective backdrop to the story.\n\nAs the story proceeds, the two characters begin to affect each other in significant ways. Sometimes these changes seem too sudden and not entirely believable, and at other times they are very believable but discomforting in what they reveal about the characters and about human nature. The cast helps get past some awkward moments with some good acting, and this keeps the viewer interested in how it all will turn out.\n\n&quot;Rain&quot; will not be to everyone's liking, but it is a thought-provoking story that should be of interest to anyone who enjoys psychological drama. \n\n///////////////////////\n\nFor residents on the idyllic South Seas island of Pago Pago, life is simple until a boat arrives carrying two couples, the Davidsons (who are missionaries), the MacPhails and a prostitute named Sadie Thompson. Davidson is more than just a religious zealot; he's a mad man. When the boat, which was en route to another port, is temporarily stranded on the island due to a possible Cholera outbreak on-board, Sadie spends her time &quot;partying&quot; with the American soldiers stationed on the island. Her behavior, however, is more than the Davidsons can stand and soon Mr. Davidson confronts Sadie about her evil ways and offers salvation. When Sadie rebels and the attempted redemption does not go as planned, Davidson arranges to have her sent back to San Francisco, where she fled some years ago due to mysterious personal issues. Davidson soon becomes unhinged and thus begins a series of surprising events which culminate in disaster","torrent":{"xt":"urn:btih:b7c4e5d7a050f1b26cb64ef05bb3af7e8c70a6a0","amp;dn":"Rain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7c4e5d7a050f1b26cb64ef05bb3af7e8c70a6a0","infoHashBuffer":{"type":"Buffer","data":[183,196,229,215,160,80,241,178,108,182,78,240,91,179,175,126,140,112,166,160]},"announce":[],"urlList":[]}}