{"title":"Mach Write v1.5.0 MacOSX Retail-CORE [ATOM]","uid":11354888,"size":2120338,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b815c7375318fafb3b6074765839a0740bc124ad&amp;dn=Mach+Write+v1.5.0+MacOSX+Retail-CORE+%5BATOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":-1,"time":1414888934,"description":"Description:\nMach Write is a powerful new RTF, TXT, and PDF Editor (Rich Text Format, Plain Text, PDF) for iOS and OS X! Featuring full iCloud document synchronization, RTF in multiple styles, sizes, and colors; as well as PDF Viewing/Creating/Annotation; and TXT files in addition to supporting nearly 15 plain text code formats; Mach Write makes it super easy to create in many different formats while still being incredibly powerful!\n\nUnlike other text editing/word processing apps which only offer RTF, or only offer TXT, or only offer PDF editing (and usually no iCloud/iOS version) Mach Write has all these features and much much more!\n\n\nFeatures:\n- iCloud document synchronization; Mach Write keeps all your documents up to date on all your iOS and OS X devices (iPhone, iPad, and Mac)\n- RTF Read/Write support; easily Create and Edit Rich Text with multiple styles, alignment, font sizes, color, shadows, line spacing, and more -- one of the most popular word processor formats widely compatible across OS X, Windows, and Linux\n- TXT Read/Write support; as well as HTML/JS/PHP/RB/PL/JAVA/C/H/M/CP/MM Read/Write with Syntax Highlighting support for HTML, Javascript, PHP, Ruby, Perl, Java, C, C++, Objective-C++ and more\n- PDF Creation, Editing, and Viewing (on iOS, annotate PDF with free-hand writing, take notes, grade papers, and more -- Large PDF documents in iCloud, such as large eBooks, are not recommended)\n- PDF Editing includes Text, Shapes, Lines, Highlights, and more\n- DOC/DOCX Read/Write support on OS X (DOC/DOCX Viewing on iOS)\n- Export to DOC, RTFD, HTML, TXT, and more\n- Tap the &quot;Function&quot; (Fn) Key twice to turn on Voice Dictation\n- Easily Share with Facebook, Twitter, E-mail, and Messages right from the Toolbar\n- Incredibly advanced, yet super easy to use!\n\n\nWhat's New in Version 1.5.0:\n- Added iCloud Drive and iCloud HandOff Support (iCloud Drive works for every format, iCloud HandOff works for every format except .DOC and .DOCX)\n- Completely overhauled interface for OS X 10.10","torrent":{"xt":"urn:btih:b815c7375318fafb3b6074765839a0740bc124ad","amp;dn":"Mach+Write+v1.5.0+MacOSX+Retail-CORE+%5BATOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b815c7375318fafb3b6074765839a0740bc124ad","infoHashBuffer":{"type":"Buffer","data":[184,21,199,55,83,24,250,251,59,96,116,118,88,57,160,116,11,193,36,173]},"announce":[],"urlList":[]}}