{"title":"Big.Brother.AU.s10e28-29-30.PDTV.x264.Hector (READ DESC)","uid":8861952,"size":396897440,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b86fb6ddc3cd4f44107cf8c5cd2ba06ed1a917c6&amp;dn=Big.Brother.AU.s10e28-29-30.PDTV.x264.Hector+%28READ+DESC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xgimpyx","files":1,"time":1377797759,"description":"Okay here's what's going on. As you can see there are no episodes 28 or 29. This is because Hectors caps were having the numbering changed (NOT BY ME) to coincide with the numbering the Scene groups were using. Hector is numbering his caps to coincide with the BBAU website. The website has the Confidential episodes numbered seperately even though they have been capped with the Wednesday Daily episodes. Since Scene groups have apparantely either stopped capping this series or just gotten very lazy with keeping up to date on them, I am going to go with Hectors numbering going forward. He seems to be very committed to bringing us all of the episodes and releases them very quickly. So if you get your BBAU episodes from multiple places this might get confusing, but if you get them exclusively from here then you will not have a problem. I\nhope that because of the lack of Scene caps that all of the people posting this series will get on board with the proper numbering as well. Thanks again to Hector who truly does seem to be the only reliable capper of this series. Your hard work is greatly appreciated! ","torrent":{"xt":"urn:btih:b86fb6ddc3cd4f44107cf8c5cd2ba06ed1a917c6","amp;dn":"Big.Brother.AU.s10e28-29-30.PDTV.x264.Hector+%28READ+DESC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b86fb6ddc3cd4f44107cf8c5cd2ba06ed1a917c6","infoHashBuffer":{"type":"Buffer","data":[184,111,182,221,195,205,79,68,16,124,248,197,205,43,160,110,209,169,23,198]},"announce":[],"urlList":[]}}