{"title":"Treasure Of The Sierra Madre (Humphrey Bogart) [1948] @  .avi","uid":4993532,"size":1045167940,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8733ef410f6cbe1df6260d0b483e04777cd2c3d&amp;dn=Treasure+Of+The+Sierra+Madre+%28Humphrey+Bogart%29+%5B1948%5D+%40++.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alien99","files":1,"time":1247164181,"description":"\n\tHumphrey Bogart\t... \tDobbs\n\tWalter Huston\t... \tHoward\n\tTim Holt\t... \tCurtin\n\tBruce Bennett\t... \tCody\n\tBarton MacLane\t... \tMcCormick (as Barton Mac Lane)\n\tAlfonso Bedoya\t... \tGold Hat\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0040897/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0040897/&lt;/a&gt;\n\nUser Rating   8.5/10\n\nAlthough John Huston's directing is absolutely equal to the screenplay, winning Oscars for both, it is the performance level of the actors that makes &quot;Treasure of The Sierra Madre&quot; the classic film that it is. Beginning and ending with Walter Huston's award winning role of the worn-out old miner who is looking for one last big score, Humphrey Bogart and Tim Holt are equal to the task and draw us in to this tale of need and greed. So convincing is Walter's portrayal of the seasoned old prospector, we come to believe that he is a gold digger by trade who only acts in movies so that he can dig and pan for gold again and again. His knowledge of mining and the lifestyle it demands and forces upon those who partake, is so thorough that Bogart and Holt seem like school kids in awe of a new hero. Of course, we know that his son John, did much research in preparation for writing the screenplay; but we are nevertheless plunged into a sure belief that this old miner must surely have been there age upon age, mine upon mine, and has therefore, a thousand tales to tell.\n\nWhen, in the course of the story, Walter is taken away, somewhat without choice, to work the magic of a healer for a Mexican village, we are again convinced that he is a medical doctor hiding out as a prospector. This is the acting craft in full bloom. Walter becomes whatever is called for in the story. However, if one views his other films, the effect is the same. He is one of Hollywood's most under rated actors of all time. Those who have not seen this film have a joyous experience awaiting them. Great story, great screenplay, great acting. This is why we love movies the way we do. \n\n640 X 480\nduration  2:06:08\naudio bit rate 128kbps\naudio format MPEG Layer-3\nframe rate 23\ndata rate 1078kbps\n24 bit\nXVID","torrent":{"xt":"urn:btih:b8733ef410f6cbe1df6260d0b483e04777cd2c3d","amp;dn":"Treasure+Of+The+Sierra+Madre+%28Humphrey+Bogart%29+%5B1948%5D+%40++.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8733ef410f6cbe1df6260d0b483e04777cd2c3d","infoHashBuffer":{"type":"Buffer","data":[184,115,62,244,16,246,203,225,223,98,96,208,180,131,224,71,119,205,44,61]},"announce":[],"urlList":[]}}