{"title":"Playing With Planets","uid":7958783,"size":3560266,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8be939e784c40a5a6c8a6acb25314eb1c18a253&amp;dn=Playing+With+Planets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"imarion","files":-1,"time":1356521599,"description":"Gerard 't Hooft, &quot;Playing With Planets&quot;\n2008 | pages: 252 | ISBN: 9812793070 | PDF | 3,4 mb\n\n\nIf you think the future is a mystery, think again. With a solid foothold in realism, an extraordinary insight into scientific and technological developments, and a dry sense of humor, Nobel laureate Professor Gerard t Hooft confidently dissects fact from fiction and shows us what our future might really hold. Professor t Hooft takes the reader firmly by the hand and, within the boundaries of solid physics and proven laws of nature, takes us on a ride into the world of the future, which holds remarkable surprises for us all. &quot;Do you dream of intergalaxy space travel, time warps, and mini-mes?&quot; t Hooft asks. &quot;Then please, get yourself some more science fiction books, for fiction it is. But for those who are interested in the real world, let me tell you what we CAN expect for the future.&quot; We meet robots with a sense of irony, ride elevators into space, and build floating cities; let us just say that Playing with Planets, which is translated from the original Dutch edition by Professor t Hooft s daughter Saskia, supports the old adage that truth is indeed stranger than fiction. ","torrent":{"xt":"urn:btih:b8be939e784c40a5a6c8a6acb25314eb1c18a253","amp;dn":"Playing+With+Planets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8be939e784c40a5a6c8a6acb25314eb1c18a253","infoHashBuffer":{"type":"Buffer","data":[184,190,147,158,120,76,64,165,166,200,166,172,178,83,20,235,28,24,162,83]},"announce":[],"urlList":[]}}