{"title":"HISTORY OF POP AND ROCK MUSIC - part 384","uid":7282434,"size":431755737,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b91f85832879edf170f3819a542a79a5b76c4c7a&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+384&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1337471231,"description":" INFO  384\n\n\n\nGNARLS BARKLEY  -  Crazy  (2006)    \nGNARLS BARKLEY  Vs..RAZE - Crazy.4.Love  (Pomatic.Mashup.Mix.) \nGNARLS BARKLEY  -  Who's Gonna Save My Soul   (2008)\n\n\n\n\n         Gnarls Barkley is an American soul duo composed of the artists Brian Joseph Burton (known professionally as Danger Mouse) and Cee Lo Green. Their first studio album St. Elsewhere was released in 2006; along with its first single &quot;Crazy&quot;. It became a top ten hit throughout Europe, North America and Australia, in the first half of 2006, reaching number one of the single charts in the United Kingdom, Ireland, Denmark, Canada, New Zealand and other countries. The song was leaked in late 2005, months before its regular release, and consequently received massive airplay on BBC Radio 1 in the United Kingdom, most notably by radio DJ Zane Lowe, who also used the song in TV ads for his show. When it was finally released in March 2006, it became the first single to top the British charts on download sales alone. The song remained at number one in the United Kingdom for nine weeks (which no other song had achieved in over ten years, and was only surpassed by Rihanna's &quot;Umbrella&quot; in July 2007) before the band and their record company decided to remove the single from British stores so people would &quot;remember the song fondly and not get sick of it.&quot; In spite of this deletion, the song became the UK's best selling single of 2006. Due to continued download sales, it reached a million sales in January 2011.\n       \n         &quot;Who's Gonna Save My Soul&quot; is the third and final single taken from hip-hop duo Gnarls Barkley's second studio album, The Odd Couple. It is played in a slow and sad soul style. The single was released in late 2008. The song's official music video was directed by Chris Milk and was released on July 25, 2008. \n                 On December 3, 2008, the video was nominated for the Grammy Award for Best Short Form Music Video. Sintay won an 2009 D&amp;AD Yellow Pencil Award for Music Video Animation.\n\n\n","torrent":{"xt":"urn:btih:b91f85832879edf170f3819a542a79a5b76c4c7a","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+384","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b91f85832879edf170f3819a542a79a5b76c4c7a","infoHashBuffer":{"type":"Buffer","data":[185,31,133,131,40,121,237,241,112,243,129,154,84,42,121,165,183,108,76,122]},"announce":[],"urlList":[]}}