{"title":"Max payne from 1c","uid":3932420,"size":702440002,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bab6aab22839b3bcb346e07a471c579f8c8574ed&amp;dn=Max+payne+from+1c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POSTal6","files":71,"time":1197569982,"description":"Developer\tRemedy Entertainment (WIN)\nEngine\tMAX-FX\nVersion\t1.05\nReleased\tJuly 25, 2001\nGenre\tThird-person shooter\nMode(s)\tSingle player\nRatings\tESRB: M (Mature)\nBBFC: 15\nOFLC: MA15+\nCERO: Z (Adults only)\nPlatform(s)\tWindows, Xbox, PlayStation 2, Game Boy Advance, Mac OS\nMedia\t1 CD-ROM (WIN)\n1 DVD (PS2), (Xbox)\n1 cartridge (GBA)\nSystem requirements\tWindows \n450 MHz CPU,\n96 MB RAM,\n16 MB video card RAM,\n4X CD-ROM drive, DirectX 8.0,\nWindows 95 (WIN)\nInput methods\tWindows \nKeyboard and mouse\n\nPlayStation 2 and Xbox\nGamepad\n\n\nThe Max Payne series has a major cinematic influence: the Hong Kong action movie genre, particularly the work of director John Woo, which features a great deal of slow-motion violence and gunfights, almost resembling ballet. &quot;John Woo&quot; is in fact the password that the mobsters must recite to enter their laundromat hideaway. The series is also often perceived to have been greatly influenced by The Matrix, but in actuality, this is not the case. Although the first game was released two years after The Matrix came out, this is a coincidence; Max Payne was already in development long before The Matrix became a household name, and slow-motion was a major gameplay element from the beginning. While the movie certainly influenced public perception of the game, it did not have a great impact on the game itself, although calling the slow-motion effect &quot;bullet time&quot; was probably inspired by the term being used to describe the similar effect in The Matrix. Max Payne is also said to have influenced Dead to Rights.\n\nThe game has other parallels to The Matrix. The detonation of the subway/bank door is similar to the cartwheeling elevator door in the movie. The start of the &quot;Nothing to Lose&quot; level is similar to the famous lobby shootout scene in the film.\n\nThe games&amp;#039; stylish cinematography and choreography is combined with heavy film noir, pulp noir, and pulp fiction influences in characters and dialogue. Rather than rendered or digitized cinematic movies for cutscenes, the story is told instead with &quot;graphic novels&quot; which are similar to comics and pulp fiction. Accordingly, Max Payne is rife with artistically orchestrated, often strangely graceful gunplay. The games are dark and noir-style, following Max Payne, a troubled cop with internal and external conflicts in a dark, sinister New York City.\n\nWithin the games, there are mini-plots in the form of television shows that the player can follow. Several of the shows are based on other, real-life shows.\n\nMax Payne focuses exclusively on the story and single-player experience, so it lacks multiplayer in contrast to other contemporary shooters. As a result, Max Payne ranks low on replayability with some reviewers suggesting that there are only 10-20 hours of gameplay from it.\n\nA MAX-FX level editor was also included.\n\nEnd-user modifications are very popular within Max Payne franchise due to the extensibility of the gameplay system. The most well-known are The Family, and several Kung-Fu and Matrix modifications.\n\n","torrent":{"xt":"urn:btih:bab6aab22839b3bcb346e07a471c579f8c8574ed","amp;dn":"Max+payne+from+1c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab6aab22839b3bcb346e07a471c579f8c8574ed","infoHashBuffer":{"type":"Buffer","data":[186,182,170,178,40,57,179,188,179,70,224,122,71,28,87,159,140,133,116,237]},"announce":[],"urlList":[]}}