{"title":"Santana/3 Original Album Classics[1974,1979,1980][2010][320KBPS]","uid":11436808,"size":352934192,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bb3a9473b860cc62babfdcc9e5efcb5d63e7c16d&amp;dn=Santana%2F3+Original+Album+Classics%5B1974%2C1979%2C1980%5D%5B2010%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":44,"time":1415761209,"description":"Santana - 3 Original Album Classics [3 CD's][1974/1979/1980/2010]\n\n\n\n\n\nDisc 1 [Illuminations][1974]\n\n \n01. Guru Sri Chinmoy Aphorism  \n02. Angel Of Air / Angel Of Water  \n03. Bliss: The Eternal Now  \n04. Angel Of Sunlight \n05. Illuminations  \n\n\n\nDisc 2 [Oneness: Silver Dreams Golden Reality][1979]\n\n  \n01. The Chosen Hour  \n02. Arise Awake  \n03. Light Versus Darkness  \n04. Jim Jeannie  \n05. Transformation Day \n06. Victory  \n07. Silver Dreams Golden Smiles  \n08. Cry Of The Wilderness  \n09. Guru's Song  \n10. Oneness  \n11. Life Is Just A Passing Parade  \n12. Golden Dawn  \n13. Free As The Morning Sun  \n14. I Am Free  \n15. Song For Devadip \n\n\n \nDisc 3 [The Swing Of Delight][1980]\n\n  \n01. Swapan Tari  \n02. Love Theme From &quot;Spartacus&quot;  \n03. Phuler Matan  \n04. Song For My Brother  \n05. Jharna Kala  \n06. Gardenia  \n07. La Llave  \n08. Golden Hours  \n09. Sher Khan, The Tiger \n\n\n\n\n320 KBPS [CBR]\nCover Art\n\nFrom Wikipedia:\n\n\n\n Carlos Santana (born July 20, 1947) is a Mexican and American musician who first became famous in the late 1960s and early 1970s with his band, Santana, which pioneered a fusion of rock and Latin American music. The band's sound featured his melodic, blues-based guitar lines set against Latin and African rhythms featuring percussion instruments such as timbales and congas not generally heard in rock music. Santana continued to work in these forms over the following decades. He experienced a resurgence of popularity and critical acclaim in the late 1990s. In 2003 Rolling Stone magazine listed Santana at number 20 on their list of the 100 Greatest Guitarists of All Time. He has won 10 Grammy Awards and three Latin Grammy Awards.\n\nCarlos Santana became a naturalized US citizen in 1965.\n\nOn October 19, 2007, his wife of 34 years, Deborah Santana, filed for divorce citing &quot;irreconcilable differences&quot;.\n\nCarlos Santana became engaged to drummer Cindy Blackman, after proposing to her during a concert of the Universal Tone Tour at Tinley Park in Chicago, Illinois, on July 9, 2010. The two were married in December 2010. They currently live in Las Vegas.\n\n--------------------------------------------------------------------------------\n\nIlluminations is a 1974 collaboration between Carlos Santana and Alice Coltrane. Jazz musicians Jules Broussard, Jack DeJohnette and Dave Holland also contributed to the record, on saxophone, flute, drums and bass. Alice Coltrane delivers some harp glissando, while the string orchestra adds a serene mood to the music. Carlos Santana (whose Indian name &quot;Devadip&quot; appears on the sleeve) plays electric guitar in his own fashion, utilizing feedback, long notes and simple melodies, letting much space to the other instruments. The album is conceived as an instrumental jazz album, with lengthy solos on guitar, saxophone and keyboards. The introduction to &quot;Angel of Air&quot;, with its violins, has been sampled by the Cinematic Orchestra. It is his first of three solo albums (the others being Oneness and The Swing of Delight) to be released under his temporary Sanskrit name Devadip Carlos Santana, given to him by Sri Chinmoy.\n\n--------------------------------------------------------------------------------\n\nOneness: Silver Dreams - Golden Reality is a 1979 album by Carlos Santana. It was his second of three solo albums (the others being Illuminations and The Swing of Delight) to be released under his temporary Sanskrit name Devadip Carlos Santana, given to him by Sri Chinmoy. The album features members of the band Santana, and consists mostly of instrumental songs and ballads.\n\n--------------------------------------------------------------------------------\n\nThe Swing of Delight is a 1980 double album by Carlos Santana. It was the last of three solo albums (the others being Illuminations in 1974 and Oneness in 1979) to be released under his temporary Sanskrit name Devadip Carlos Santana, given to him by Sri Chinmoy","torrent":{"xt":"urn:btih:bb3a9473b860cc62babfdcc9e5efcb5d63e7c16d","amp;dn":"Santana%2F3+Original+Album+Classics%5B1974%2C1979%2C1980%5D%5B2010%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb3a9473b860cc62babfdcc9e5efcb5d63e7c16d","infoHashBuffer":{"type":"Buffer","data":[187,58,148,115,184,96,204,98,186,191,220,201,229,239,203,93,99,231,193,109]},"announce":[],"urlList":[]}}