{"title":"Afterlife - Season 1","uid":9082888,"size":2201859167,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbdc6931b09011459eaae21707b75ae9d46da985&amp;dn=Afterlife+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"claudiatannahill","files":12,"time":1382409385,"description":"Afterlife Season 1 2005\n\nThe main characters of the series are the psychic, Alison Mundy (played by Lesley Sharp) and the academic who becomes involved with her due to his skeptical interest in the paranormal, Dr Robert Bridge (Andrew Lincoln). Set in Bristol, each of the six one-hour episodes of the first series sees Alison become involved in the appearance of a spirit and attempting to discover why it has come back to haunt the living. Robert becomes involved in the first episode, when Alison first moves to Bristol and her activities inadvertently result in the suicide of one of his students.\n\nFollowing this, Robert decides to study Alison for a book. Alison's interest in Robert stems from her ability to see the spirit of his young son, whom Robert cannot see. Throughout the series a recurring theme is Alison's attempt to have Robert fully come to terms with the death of his son so that the boy's spirit can be eased and he can fully move on. In the first series it is learnt that Alison was seriously injured in a train crash several years before. The other survivors of the train crash seek her out to contact their own lost loved ones in the final episode of the first series, almost causing Alison's own death. Later, in the second series, it is established that Alison had these powers since she was little, the first 'ghost' she saw was her grandfather.\n\nDuring the second series, Robert is diagnosed with cancer. He dies in the series finale, after having spent much of the series helping Alison to overcome mental problems brought about by the ghost of her mother. He also reconciles her with her father. ","torrent":{"xt":"urn:btih:bbdc6931b09011459eaae21707b75ae9d46da985","amp;dn":"Afterlife+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbdc6931b09011459eaae21707b75ae9d46da985","infoHashBuffer":{"type":"Buffer","data":[187,220,105,49,176,144,17,69,158,170,226,23,7,183,90,233,212,109,169,133]},"announce":[],"urlList":[]}}