{"title":"Lyle Mays FLAC Image","uid":4913922,"size":224016025,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bbf5a6f8b06f66c7c5abeb95cdea34f8796f46bd&amp;dn=Lyle+Mays+FLAC+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gregavi","files":3,"time":1243333634,"description":"5 STAR *****FLAC Image w/ Cue Sheet and Cover jpg\n\nLYLE MAYS was the first solo effort from the keyboardist and founding member of the Pat Metheny Group. He assembled a stellar group of supporting musicians to present this collection of jazz/fusion compositions.\n\nMays's acoustic piano ...    Full Descriptionsparkles on the opening &quot;Highland Air,&quot; followed by his signature solo synthesizer sound, a sort of flute/whistle with wide vibrato. Mays seems to be more interested in creating spacious tonal landscapes than exploring the blues, giving the proceedings a new age feel. Billy Drewes' restrained soprano saxophone on &quot;Teiko&quot; is shadowed by the ghostly twang of Bill Frisell's guitar. They trade solo lines over a synthesized orchestra. The effect is controlled, otherworldly, and beautiful. The shifting harmonic bed on &quot;Slink,&quot; delineated by Frisell's guitar arpeggios and Mays' piano, is unlike the vast majority of fusion music before or since in its originality, unpredictability, and sheer breathtaking loveliness. Bassist Marc Johnson shines, while drummer Alex Acuna provides the music with subtle rhythmic drive. Mays himself, in addition to his groundbreaking synthesizer work, shows himself to be a world class pianist. LYLE MAYS deserves its reputation as an all time classic.\n\n\nPersonnel: Lyle Mays (autoharp, piano, synthesizer); Billy Drewes (soprano &amp; alto saxophone); Patrick Sky (Uillean pipes); Bill Frisell (guitar); Marc Johnson (acoustic bass); Alejandro N. Acuna (drums); Nana Vasconcelos (percussion).\n","torrent":{"xt":"urn:btih:bbf5a6f8b06f66c7c5abeb95cdea34f8796f46bd","amp;dn":"Lyle+Mays+FLAC+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf5a6f8b06f66c7c5abeb95cdea34f8796f46bd","infoHashBuffer":{"type":"Buffer","data":[187,245,166,248,176,111,102,199,197,171,235,149,205,234,52,248,121,111,70,189]},"announce":[],"urlList":[]}}