{"title":"Earth: Final Conflict Season 2","uid":5638659,"size":8106520292,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd62b85f8b706b81b4af780931dffb86cc97b43a&amp;dn=Earth%3A+Final+Conflict+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Rotok","files":-1,"time":1276990710,"description":"for some reason, ep 9 seems to take place after ep 10, yet on TV.com, it is listed as the correct order &gt;.&gt;\n\nHere it is my friends, the season that I myself have been searching for in DVD-quality for years. Finally got pissed and ordered it from Australia \n(for 49.99 plus 20 in shipping, but I figure I need to contribute back eventually lol)\nStraight DVD-rip from my PAL Disks, then frameserved and filtered over to Xvid\nThey look amazing, even if they are PAL.\nBusted my rear for a week getting them all converted and rewatched them all to ensure audio syncs and no glitches or artifacts, so please comment\non whether they were worth the effort :-P\n720x576, 25 fps, Xvid Mpeg-4 codec, ac3 to wave to mp3 LAME audio tweaked up 6 db because the dvd max volume wasnt even midrange\n- Rotok\n\n\n\nand now for your entertainment, straight from wikipedia...\n\nEarth: Final Conflict - Season 2\n\n    &quot;They are the Companions. Aliens come to Earth on a mission of peace. Their true mission, the secrets they hide, forever alter humanity. \nCaught in the struggle between these Taelon Companions and the Human Resistance is Liam Kincaid. A man who is more than human. \nThe mysteries of his past hold the key to Earth's future and the fate of mankind. On Earth Final Conflict.&quot;\n\n        ÃƒÂ» Season 2 introduction\n\nBeckett gives birth as the Resistance is saddened by the news that Boone has died. The protector's baby is a Kimeran/human hybrid and grows\n at a rapid rate. He takes the name &quot;Liam Kincaid&quot; and immediately takes action as an adult. Beckett's memory is wiped and she is sent back to \nthe Taelons. The recovered fiancÃŽËœe is really a replicant of the mysterious probe, which is from another alien race known as the Jaridians. The\n probe replicant kills the leader of the Taelon Synod. Liam saves Da'an and is recruited to become his new protector. Liam joins the Resistance\n but doesn't get along with Doors. Lili is forced to work under Sandoval but continues her double agent duties. Zo'or becomes the new Taelon \nleader, with Sandoval becoming his personal protector.\n\nDa'an realizes who and what Liam is, and the two become good friends. Da'an and Zo'or battle over each other's ideologies. Zo'or believes \nhumans should serve the Taelons, while Da'an thinks humanity should be their equal. The Taelons prepare Earth for war with the Jaridians, \nwho believe humans have sided with the Taelons.\n\nThe Resistance finds out that the CVI's motivational imperative wears off after a time, leaving the protectors restored to their own wills. Liam \nsenses that his mother, Protector Siobhan Beckett's, CVI has malfunctioned and attempts to locate her. Beckett has to deal internally with all \nthe wrongs she has committed while in an altered mental state. Also concerned, Zo'or sends Sandoval to locate Beckett, but Liam locates her\n first. He joins his dying mother and shares with her energetically/telepathically revealing his true origin. She realizes who he is as she passes\n away.\n\nDoors decides to take the Resistance above ground and runs for President. The Resistance members are pardoned in a deal Doors is able to \nmake. Former Resistance members come to Lili and Augur concerned over humanity's protection. The Resistance is reformed under Liam's \nleadership. Da'an, who knows, doesn't betray Liam, yet thinks reforming the Resistance is a bad idea.\n\nZo'or sets the Resistance and Doors up when he has an assassination attempt made on President Thompson. Thompson survives and declares\n martial law. The Resistance members are targeted and many are brought to the Taelon Mothership. Liam and Augur try to rescue Doors but \nare pinned down. Lili tries to destroy the mothership in a last ditch effort to save Earth.\n\n","torrent":{"xt":"urn:btih:bd62b85f8b706b81b4af780931dffb86cc97b43a","amp;dn":"Earth%3A+Final+Conflict+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd62b85f8b706b81b4af780931dffb86cc97b43a","infoHashBuffer":{"type":"Buffer","data":[189,98,184,95,139,112,107,129,180,175,120,9,49,223,251,134,204,151,180,58]},"announce":[],"urlList":[]}}