{"title":"Someone Still Loves You Boris Yeltsin ~ Fly By Wire","uid":8860421,"size":61465184,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bdccc645c2af79b40fd913ecfa3a0bf9ec83e3cd&amp;dn=Someone+Still+Loves+You+Boris+Yeltsin+%7E+Fly+By+Wire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheAurelius.","files":11,"time":1377759982,"description":"Someone Still Loves You Boris Yeltsin - Fly By Wire (2013)\n-------------------------------------------------------------------------\n\nTRACKLISTING :\n\n1. Harrison Ford\n2. Young Presidents\n3. Cover All Sides\n4. Lucky Young\n5. Ms. Dot\n6. Loretta\n7. Unearth\n8. Bright Leaves\n9. Nightwater Girlfriend\n10. Fly By Wire\n\n--------------------------------------------------------------------------\n\nABOUT THESE GUYS and this PIECE OF WORK !!!!\n\n\nFrom the Press Release: For this new album, the members of SSLYBY returned to the attic where they made their debut full-length Broom, but first they took a 5000 mile detour. After the Boris Yeltsin Foundation in Yekaterinburg, Russia extended an invitation to the band, Phil Dickey, Will Knauer, and Jonathan James spent a whirlwind six days in their namesake's home country this past January: meeting with Yeltsin's close friends and personal translator (who gifted them seven bottles of expensive Russian vodka) and performing at an elementary school after the U.S. consulate named them cultural ambassadors for a day. The trip concluded with a set at Old Nu Rock, making SSLYBY the first American group to play at Russia's largest winter rock festival.\n\nDespite all of its empowering moments, this once-in-a-lifetime adventure also marked a turning point for SSLYBY.&quot;I used to joke that we would break up if Boris Yeltsin ever found out about our band,&quot; says Dickey. &quot;So I figured this was either the death or rebirth of the band.&quot; Happily, it turned out to be the latter. With no one pressuring them to start work on a new album, SSLYBY decided to anyway for the best reason of all - because they simply wanted to. Rejuvenated by the sights they saw and people they met, the three musicians returned home eager to start work on a new full-length. With this desire in mind, there was no better location for Fly By Wire to come together than in the place that started it all: the attic of Knauer's parent's house where SSLYBY recorded their breakout debut album, Broom. The band is releasing a documentary about their life-changing trip this summer, called Discussions With Russians.\n\nDrawing as much from the pop-punk power chords their brains were wired to love as teens in the late 90s, as the multi-layered pop of the 60's and 7'0s they strive to emulate, SSLYBY has been writing songs for over a decade based on the timeless principles of beautiful melodies and good harmonies. From the scuzzy-paired-with-sunny guitar rhythms on handclap-aided first single, &quot;Nightwater Girlfriend,&quot; to the mid-tempo electro-pop of &quot;Harrison Ford,&quot; the songs on Fly By Wire are just plain fun to listen to. As a result, the music they create is nothing if not universal. And even though it took a trip to Russia for the band to be reminded of this, one listen to Fly By Wire is all you'll need.","torrent":{"xt":"urn:btih:bdccc645c2af79b40fd913ecfa3a0bf9ec83e3cd","amp;dn":"Someone+Still+Loves+You+Boris+Yeltsin+%7E+Fly+By+Wire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdccc645c2af79b40fd913ecfa3a0bf9ec83e3cd","infoHashBuffer":{"type":"Buffer","data":[189,204,198,69,194,175,121,180,15,217,19,236,250,58,11,249,236,131,227,205]},"announce":[],"urlList":[]}}