{"title":"The Cruel Sea (ISO DVD Image file)","uid":5410310,"size":4112428359,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bf30d7a346b9a53b4dee0578981f4ee920fb76fa&amp;dn=The+Cruel+Sea+%28ISO+DVD+Image+file%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"towerelect","files":5,"time":1267733441,"description":"Eight years after the end of the 2nd World War, Ealing Studio's of England brought Nicholas Monsarrat's best selling novel 'The Cruel Sea' to the big screen, launching the careers of Donald Sinden (Lt Lockhart), Viginia McKenna (Wren Hallam) and establishing Jack Hawkins (Captain Ericson) as a major Star.\n\nComdr. Ericson (Jack Hawkins) is made captain of the Corvette Compass Rose, a small escort vessel used to guide and protect convoys travelling though the Atlantic.   Ericson had his confidence serverly shaken during his last command, in which he lost his ship and most of his men to a U boat.   As he leads a new and largely inexperienced crew, Ericson is once again thrown into a life-and-death dilemma that forces him to shoose between destroying an enemy ship and sparing the lives of his own men in the water.\n\nI consider this one the the very best War films ever made.  Without tugging unfairly at your heartstrings it does not shy away from highlighting the horrow and psychological damage inflicted by combat and this film is also truely remarkable in its stressing of the utter futility of War.   With acting and dialogue of a standard simply never seen in most modern films this will move and shake you without any of the special effects and digital action considered a must by the Hollywood we know today.\n\nIt is a Classic, up there with Casablanca, Gone with the Wind and the Sound of Music and if you have never seen it before, here is your chance in its original DVD quality.   You can play back an ISO file using the free VLAN media player available here: http://www.videolan.org/vlc/\n\nSource Studio Canal DVD 4 release.\n\nStarring:\n \nJack Hawkins\nDonald Sinden\nDenholm Elliott\nVirginia McKenna\n\n1953 Black and White (excellent quality having been fully restored)\n4:3 screen ratio\n122 Min Region 2 Pal (but will play back on any PC using Videolan media player)\nMono\n\nEnjoy Rigmar Radio","torrent":{"xt":"urn:btih:bf30d7a346b9a53b4dee0578981f4ee920fb76fa","amp;dn":"The+Cruel+Sea+%28ISO+DVD+Image+file%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf30d7a346b9a53b4dee0578981f4ee920fb76fa","infoHashBuffer":{"type":"Buffer","data":[191,48,215,163,70,185,165,59,77,238,5,120,152,31,78,233,32,251,118,250]},"announce":[],"urlList":[]}}