{"title":"Dance Derailism Volume 11 to 20 (Club/House/Electro)","uid":6820870,"size":1890979030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bfd51fe42bf15af18eb8779bae465f6b299f134e&amp;dn=Dance+Derailism+Volume+11+to+20+%28Club%2FHouse%2FElectro%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Derailist","files":-1,"time":1321382263,"description":"Hi all, this is a compilation of the Dance Derailism compilations 11 to 20.\n\nAdd me on twitter: @derailist\n\n\n06-07-11 - Dance Derailism Vol. 20\n\nOh, I found some time and motivation! It has been a while!\n\nBitrate: 320kbit | Size:  181.3 MB | Length: 78:44\n\n    Sariah - All About Sex (Digital Dog Club Mix)\n    Chris Brown - Beautiful People (Sex Ray Vision Remix)\n    Christina Aguilera - Bobblehead (Tonic Remix)\n    SoundGirl - Don't Know Why (Ian Carey Extended Mix)\n    Fabricio Lampa - Everybody Now (HytraxX Remix)\n    Britney Spears - I Wanna Go (Aleko's Retrovirus Club Mix)\n    Lady GaGa - Judas (Dark Intensity Remix)\n    Pryda - Pjanoo (Fred Del Mar Sax Edit)\n    Mike Candys - Together Again (TonyTweaker Rework)\n    Daruso - When The Morning Comes (Hi Def Club Mix)\n    Sylvio Tosun &amp; DV - World Keeps Turning (David Vendetta RmX)\n    Steve Angello, Axwell &amp; Sebastian Ingrosso - Leave The World Behind (Hard Zone Remix)\n    Junior Caldera Ft. Sophie Ellis Baxtor - Can't Fight This Feeling (Bombs Away Remix)\n\n\n01-06-11 - Dance Derailism Vol. 19\n\nGet ready for Dance Derailism Volume 19! Last night is one of my favorite tracks till date!\n\nBitrate: 320kbit | Size:  182.2 MB | Length: 79:11\n\n    Avicii - Good Morning Sweden (Avicii Coloseum Mix)\n    Bruno Mars - Grenade (Afonsoamaral Remix)\n    TiÃƒÂ«sto - I Will Be Here (Stas Rich Remix)\n    Fergie - London Bridge (Mishock Exclusive Electric Mix)\n    Sander Van Doorn Ft. Carol Lee - Love Is Darkness\n    N Dubz -Morning Star (Matt Nash &amp; Dave Silcox Remix)\n    Syke'N'Sugerstarr Ft. Cosmo Klein - No Satisfaction (Main Mix)\n    The Coolbreezers - Spies *Dj's From Mars Club Remix)\n    Wanessa - Stuck On Repeat (Dave Aude Club Mix)\n    David Guetta - The Word Is Mine '11 (Christ Remix)\n    Roger Sanchez Ft. GTO - Turn On the Music (Andrew Diverson &amp; Davies Soldberg Remix)\n    Wolfgang Gartner Vs. Who Da Funk - SpaceBalls (Francis Preve '11 Booty)\n    Ian Carey Ft. Snoop Dogg &amp; Bobby Anthony - Last Night (Dani L. Mebius Remix)\n    Lady Gaga - Born This Way (Alex Rose &amp; Sound Brothers Project Remix)\n\n\n19-05-11 - Dance Derailism Vol. 18\n\nI'm actually not in a creative mood. Shame on me. I've finally found a decent remix of On The Floor by Jennifer Lopez en Pitbull and a good mix of Right Round which is pretty old already. Anyways, here is Dance Derailism Volume 18! Enjoy!\n\nBitrate: 320kbit | Size:  182.4 MB | Length: 79:24\n\n    Rebecca &amp; Fiona - Bullets (Adrian Lux &amp; Nause Club Remix)\n    Beyonce &amp; Jay Z. - Crazy In Love (Stylezz Remix)\n    L2 - Criminal In Bed (Mike Rizzo Funk Generation. Club Mix)\n    SoundGirl- I'm The Fool (Bimbo Jones Club Mix)\n    Hyper Crush - Kick Us Out (Kuo Extended Rough Mix)\n    Flo Rida - Right Round (Greysound Club Mix)\n    Adele - Rolling In The Deep (Dan Clare Extended Mix)\n    Filo &amp; Peri Ft. Audry Gallagher - This Night (Dash Berlin Remix)\n    Swedish House Mafia Ft. Marco Torzevsky - Victoria\n    Jennifer Lopez &amp; Pitbull - On The Floor (Slava Grafiti Remix)\n    Funky Truckerz Ft. Gathan Cheema - You Are The One For Me (Dr. Kucho! Remix)\n    Markus Schulz Ft. Jennifer Rene - Not the Same (Carlo Resort Remix)\n    Kirsty Hawkshaw &amp; Kinky Roland - Fine Day Reloaded (Super Stylers Remix) \n\n\n13-05-11 - Dance Derailism Vol. 17\n\nYeah so, I couldn't sleep. Here's to counting volumes instead of sheep! Insta-epic 'shape of my heart' included! Because those who speak know nothing.\n\nBitrate: 320kbit | Size:  181.7 MB | Length: 78:58\n\n    The Scumfrog Ft. Davey La - All Go Down (Kevin Sunray Remix)\n    E-Type - Back 2 Life (Ultra Dj's Remix)\n    TiÃƒÂ«sto &amp; Marcel Woods - Don't Ditch\n    Ottomix &amp; D.J. Groovy - Tiko Tiko (Remix)\n    Natalia Kills - Mirrors (DeviceSounD Remix)\n    September - Resuscitate Me (Buzz Junkies Club Remix)\n    Ayo Ft. Alex Martin - Miracle (Manhattan Clique Extended Mix)\n    Sting - Shape Of My Heart (Glabasha '11 Remix)\n    Porter Robinson &amp; Lazi Rich Ft. Sue Cho - Hello (Digital Freq RmX)\n    Chris Brown - Yeah Yeah Yeah (Justin Sane &amp; Mikael Wills Remix)\n    Michael Mind Project Ft. Mandy Ventrice &amp; Carlprit - Hook Her Up\n    Late Night Alumni - Empty Streets (Carl Hanaghan &amp; Ted Nilsson Remix)\n    The Saturdays - Forever Is Over (Romeyboy's Especially For Anouk Remix) \n\n\n12-05-11 - Dance Derailism Vol. 16\n\nIt's peanut butter jelly time! And yes, we were made for loving you! Another fine remix of Seek Bromance has risen above all others, this one is worth listening!\n\nBitrate: 320kbit | Size:  183.7 MB | Length: 79:48\n\n    Cassie Ft. Akon - Let's Get Crazy (Blueice Remix)\n    Kiss - I Was Made For Loving You (Dr. Kucho! Rework)\n    Tim Berg - Seek Bromance (Elevic Remix)\n    Akcent - Love Stoned (Otherview Extended Mix)\n    Ray Horton - Remember The Time (XM &amp; Zvukoff Electro Remix)\n    Jes - Awaken (Helium Afterburn Remix)\n    Riz Ft. Pitbull - Dance With Me (Jump Smokers Explicit Mix)\n    Sean Ensign - Disappear (7th Heaven Club Mix)\n    Tim Berg - Exodus\n    Dada Life - Fight Club Is Closed\n    Kot Vs. Aenoism - Finally Shimmer (Patrick Hagenaar Bootleg)\n    Pitbull Ft. Ne-Yo, Afrojack &amp; Nayer - Give Me Everything (Mikael Wills &amp; Justin Sane Remix)\n    The Teachers Ft. Linda Newman - Let the Music Play (Cleveland Remix)\n\n\n10-05-11 - Dance Derailism Vol. 15\n\nAfter spending a few days being wasted the time has come for volume 15! It includes a neat remix of Love Story by Taylor Swift. That's just because I like that track though.. Enjoy!\n\nBitrate: 320kbit | Size:  173.3 MB | Length: 76:42\n\n    Taylor Swift - Love Story (Sound Freak 'Private' Remix)\n    Swedish House Mafia - Show Me Love\n    Inna - Sun Is Up (Ilario Estevez Mix)\n    Adele Ft. Gilbere Fore - Set Fire To The Rain (Remix)\n    Snoop Dogg &amp; David Guetta - Sweat (Funk D. Remix)\n    Eva Ft. Gucci Mane - Not My Daddy (Skeet Skeet Extended Mix)\n    Black Eyed Peas - Just Can't Get Enough (Aylen Remix)\n    Jeremiha Ft. 50 Cent - Down On Me (Disco Fries Remix)\n    Martin Solveig - Hello (Benjamin Bates Bootleg)\n    Narcotic Thrust - I Like It (Demon Rus Remix)\n    Adele - Someone Like You (eSquire Vs. OFFbeat Dj Intro Remix)\n    Chris Brown Ft. Benny Benassi - Beautiful People (Disco Fries Remix)\n    David Guetta &amp; Taio Cruz - Little Bad Girl (GrooveshakerZ &amp; Whilliam Rise Remix)\n    Ginuwine Ft. Timbaland &amp; Missy Elliott - Get Involved (Rico Bernasconi Remix)\n    LMFAO - Smack The Paparazzi\n\n\n28-04-11 - Dance Derailism Vol. 14\n\nThe first release after the updates of previous releases! Call on me was always a nice track on it's own but it just got better. Lick It is an antique with epic lyrics, add a decent flow and get the party started! Enjoy Dance Derailism Volume 14!\n\nBitrate: 320kbit | Size:  176.7 MB | Length: 76:57\n\n    Jay Sean Ft. Lil Wayne - Hit The Lights (Mikael Wills Club Mix)\n    Ellie Goulding - Lights (Rollin' Stars Ft. D-Seven Remix)\n    Jorg Schmid - I Just Died (Solovey Remix)\n    Bomba Vs. Alex M. - Crazy Pipe '11 (Crockett &amp; Tubbs Remix)\n    Rihanna - S&amp;M (Fabiano 2 Essy Remix)\n    20 Fingers - Lick It (Dron Remix)\n    Eric Prydz - Call On Me (Haipa &amp; Dima Voice Remix)\n    Britney Spears - Hold It Against Me (Mikael Wills &amp; Kelly M. Remix)\n    Scarlette Fever - Crash &amp; Burn (Loverush UK Club Remix)\n    Edward Maya Ft. Vika Jigulina - Desert Rain (Maya Club Mix)\n    Kylie Minogue - Get Outta My Way (The Prieto Brothers Omm Remix)\n    Alex Gaudino Ft. Kelly Rowland - What A Feeling (I'm Still In Love Mix)\n\n\n25-04-11 - Dance Derailism Vol. 13\n\nOh yeah! Another one up the stream. The Glitch Mob remix of Waiting For The End is sweet!\n\nBitrate: 320kbit | Size: 176.1 MB | Length: 77:54\n\n    S&amp;H Project Ft. Jades - Summer's Gone (Spencer &amp; Hill Remix)\n    Linkin Park - Waiting For The End (The Glitch Mob Remix)\n    Kat DeLuna - Party O'Clock (Romeyboy Remix)\n    Xonia Ft. Deepcentral - Hold On\n    Jay Sean Ft. Lil Wayne - Hit The Lights (Jump Smokers Remix)\n    Britney Spears - Till The World Ends (Funk3d Extended Mix)\n    Jesus Luz - Every Single Girl Tonight (Yves Larock Remix)\n    Far East Movement - Like A G6 (DeviceSounD &amp; GreySounD Remix)\n    Future Frog - Disco Dancer (Ftampa Remix)\n    Hannah &amp; Miami Calling - Taking Over Now (Dr. Kucho! Club Mix)\n    Yasmin - On My Own (Steve Smart &amp; WestFunk Club Mix)\n    Adele - Someone Like You (Happy HotDog Club Mix)\n    Kat DeLuna - Dancing Tonight (86 &amp; Soundset Remix)\n\n\n23-04-11 - Dance Derailism Vol. 12\n\nMore of the good stuff! Volume 12! Found this awesome background online, had to make a cover out of it. The Japanese Popstars sure don't sound as expected, stupid prejudice of mine. Last night sure describes the average club night of mine, only most clubs don't play my style of music, which is a shame. \n\nBitrate: 320kbit | Size: 184 MB | Length: 79:44\n\n    ATB - Twisted Love\n    Adam Kancerski Ft. Aneym - It Takes Time (Filo &amp; Peri Remix)\n    The Saturdays - One Shot (eSQUIRE Remix)\n    Inna - Sun Is Up (Cahill Club Mix)\n    The Japanese Popstars - Song For Lisa (Benny Benassi Mix)\n    Above &amp; Beyond Ft. Richard Bedfort - Sun &amp; Moon (Club Mix)\n    Activ - Without You (Neo Remix)\n    Booty Luv - Shine (Kevin Forbes Remix)\n    Hurts - Sunday (Tom Flynn Club Mix)\n    Kaskade Ft. Mandy Gledhill - All That You Give (Justin Michael &amp; Kemal Remix)\n    Armin Van Buuren Ft. Laura V. - Drowning (Mylon &amp; Shane 54 Classic Club Mix)\n    Ian Carey Ft. Snoop Dogg &amp; Bobby Anthony - Last Night (Spencer &amp; Hill Remix)\n\n\n20-04-11 - Dance Derailism Vol. 11\n\nIt has been a while, busy doing useless stuff! Volume 11 has arrived, \n\nthe mayor bomb is the Wonderman Remix! This is the release I started overhauling my website, I think it has been improved much. Pretty time consuming, but that's what hobby's do right?\n\n \n\nBitrate: 320kbit | Size: 182.5 MB | Length: 79:17\n\n    ZoÃƒÂ« Badwi - Accidents Happen (Liam Keegan Club Mix)\n    Tinie Tempah Ft. Ellie Gouldling - Wonderman (Dirty Duvall Mix)\n    Britney Spears - Till The World Ends (LÃƒÂ«o MartÃƒÂ­ Club Mix)\n    Eiffel 65 - Blue (Jerry Rekonius '11 Remix Bootleg)\n    I Like It Electric - Do You Want To Or Not (WaWa Club Mix)\n    Linkin Park - Waiting For The End (DrewG &amp; Brian Cua Club Mix)\n    Luke Bingham - Nothing 2 Lose (Dan Clare Extended Mix)\n    New Boyz &amp; The Cataracs &amp; DEV - Backseat (Mikael Wills Remix)\n    Sirens - Good Enough (Liam Keegan Extended Mix)\n    Kaskade - All You\n    Chicco Secci &amp; Graham Wheeler - Fly With You (Benny Benassi Club Mix)\n    Diddy Dirty Money Ft. Skylar Grey - Coming Home (Pierce Fulton Unofficial Remix)\n    Armin Van Buuren &amp; Sharon Den Adel - In And Out Of Love (Max Maikon Club Mix)","torrent":{"xt":"urn:btih:bfd51fe42bf15af18eb8779bae465f6b299f134e","amp;dn":"Dance+Derailism+Volume+11+to+20+%28Club%2FHouse%2FElectro%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfd51fe42bf15af18eb8779bae465f6b299f134e","infoHashBuffer":{"type":"Buffer","data":[191,213,31,228,43,241,90,241,142,184,119,155,174,70,95,107,41,159,19,78]},"announce":[],"urlList":[]}}