{"title":"Echo.Prime-TiNYiSO","uid":10315269,"size":700609120,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1213cd371236cba184d426cd5119b1761908cc0&amp;dn=Echo.Prime-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1402233749,"description":" Echo Prime (c) Robot Entertainment\n\nRelease On: 8 june 2014\nDisk Amount/Format: 1 DVD ISO\nType of Game: Action Media\nProtection: Steam\nFight your way across the galaxy in this epic action game from the makers\nof the 2011 AIAS Strategy Game of the Year &quot;Orcs Must Die!&quot; and the 2012\nAIAS Mobile Game of the Year &quot;Hero Academy.&quot;\n\nBattle hordes of dangerous alien creatures, space pirates, and killer\nmercenaries with blaster and blade as you travel from star to star,\nuncovering the secrets of the multiverse.\n\nMake contact with the Echoes, mysterious beings from alternate universes\nwho will lend you their abilities and aid you in your quest to save\nhumanity from an alien menace. Acquire a myriad of powerful weapons and\narmor, watch your abilities grow to unmatched levels, and prepare to\ntake on the most fearsome opponents in the galaxy!\n\nIncludes the complete &quot;Echo Prime&quot; Soundtrack!\n\nFeatures:\n\nRemastered for PC New maps, new enemies, retuned economy, visual\nenhancements, and new PC controls.\n\nNew Hardcore Mode - Test your mastery. How far can you get without dying?\n\nUpgrade Your Arsenal Over 100 pieces of gear with a diverse mix of\ndeadly effects, from fire to toxic, all unlockable at no additional cost.\n\nEchoes of the Multiverse Discover and unlock dozens of Echoes, alien\nlife forms from alternate universes. Echoes will offer you powers and\nabilities to help you on your missions.\n\nShare Echoes Use your friends Echoes in combat to help them level-up,\nand level up your Echoes when your friends use them!\n\nRandom Campaign Generation Every players experience is different!\n\nIncludes the Full Soundtrack All 14 tracks of the Echo Prime soundtrack\nare included when you buy the game!\nBurn/mount, install, copy crack, play!\n\nNOTE: Use launcher.exe, if you want other language than english.","torrent":{"xt":"urn:btih:c1213cd371236cba184d426cd5119b1761908cc0","amp;dn":"Echo.Prime-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1213cd371236cba184d426cd5119b1761908cc0","infoHashBuffer":{"type":"Buffer","data":[193,33,60,211,113,35,108,186,24,77,66,108,213,17,155,23,97,144,140,192]},"announce":[],"urlList":[]}}