{"title":"What the Tortoise Taught Us: The Story of Philosophy","uid":6578685,"size":1367536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c16c79cfe84f6a99bda6277e65cbbc820d40a461&amp;dn=What+the+Tortoise+Taught+Us%3A+The+Story+of+Philosophy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1312317656,"description":"What the Tortoise Taught Us offers a lively, concise journey through western philosophy that explores the lives of major philosophers, their ideas, and how their thinking continues to influence our lives today. Using a chronological approach, Burton Porter shows how various philosophers address life's big questions. By putting each philosopher and their ideas into historical context, he helps us understand how certain ideas developed based on the thinking of the time, and how those ideas have influenced our modern perceptions. Using familiar language and interesting anecdotes, Porter provides us with an extremely readable and lively history that takes themes that characterize each age to reflect on the greater human experience. The book includes the philosophies and lives of the ancient philosophers such as Socrates, Plato and Aristotle, and continues through time into the Middle Ages with St. Thomas Aquinas, to the Renaissance, and beyond. Porter explores the metaphysics of Descartes and Hobbs; the epistemology of Hume and Berkeley, and the ethics of Kant and Mill among others. Finally he concludes with contemporary issues, including racism, abortion and modern feminism. Porter is able to explain these complex ideas in a clear, simple, and straightforward way. What the Tortoise Taught Us is a balanced and approachable look at life's basic questions through the eyes of the philosophers that have helped shape modern thought. \n\nNovember 2010\nPublisher: Rowman &amp; Littlefield Publishers, Inc.\nFormat: Hardcover 200pp\n","torrent":{"xt":"urn:btih:c16c79cfe84f6a99bda6277e65cbbc820d40a461","amp;dn":"What+the+Tortoise+Taught+Us%3A+The+Story+of+Philosophy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c16c79cfe84f6a99bda6277e65cbbc820d40a461","infoHashBuffer":{"type":"Buffer","data":[193,108,121,207,232,79,106,153,189,166,39,126,101,203,188,130,13,64,164,97]},"announce":[],"urlList":[]}}