{"title":"Icehouse - Electric Blue  (2nafish)","uid":5563399,"size":151787524,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c1a42fe58bb278bcf91db7993e1912096078fd91&amp;dn=Icehouse+-+Electric+Blue++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1273909244,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Electric Blue&quot; is a 1987 hit single by the Australian  rock  / synthpop  band Icehouse and was co-written by Iva Davies of Icehouse and John Oates of the U.S. band Hall &amp; Oates. The single reached number one on the Australian singles chart on 16 November 1987, number seven on the American Billboard Hot 100 chart the same year, and number 53 on the UK singles charts. Released in August it was the second single from their number one album Man of Colours on Regular Records in Australia and, with a slightly different cover, on Chrysalis Records for European and North American releases. It is played regularly on Australian radio stations and remains one of their most popular songs according to listeners of Triple M in 2007.\n\nThe video clip for Electric Blue was shot on the roof of 189 Liverpool Street, Sydney City, Australia. It is now the YWCA Hotel aka &quot;Y On The Park&quot;.\n\nJohn Oates became involved with Davies after contacting him to state he was a fan. The resulting collaboration produced this song and Oates has stated that if Davies had not released the song under the Icehouse name then it would have been a Hall and Oates track.\n\nIn Australia, &quot;Electric Blue&quot; was available for a limited time on 7 inch blue vinyl.\n\nA remix version by Skipraiders was released on the Icehouse album Meltdown in 2002. In July 2007, it was covered by pop artist Steve Ward at the Pink Lemonade Breast Cancer Foundation fundraiser.\n\nMan Of Colours is Australian rock  synthpop  band Icehouse's best-selling album, which was released in September 1987 on Regular Records / Chrysalis Records. The album peaked at #1 on the Australian album charts for 11 weeks from 5 October 1987 and has sold over 700,000 copies. &quot;Electric Blue&quot; was their only Australian #1 single, the release of the album and its singles marked the zenith of Icehouse's commercial success, both locally and internationally.\n\nFounding Icehouse member Iva Davies (vocals, guitars, keyboards, Fairlight CMI, Cor Anglais) was joined by Robert Kretschmer (guitars), Andy Qunta (keyboards, piano), Simon Lloyd (reeds, brass, keyboards, programming), Stephen Morgan (bass guitar) and Paul Wheeler (drums, percussion) in recording the album from February 1987.\n\nIt was the first Australian album to supply five top 30 hit singles &quot;Crazy&quot; (3# in July), &quot;Electric Blue&quot; (co-written by Davies and John Oates of US band Hall and Oates)(#1, October), &quot;My Obsession&quot; (#5, December), &quot;Man of Colours&quot; (#28, February 1988) and &quot;Nothing Too Serious&quot; (#29, May 1988). With US chart success for &quot;Crazy&quot;, which reached #14 on the Billboard Hot 100 and #10 on its Mainstream Rock chart, and &quot;Electric Blue&quot; (#7 Hot 100, #10 Mainstream), the album Man of Colours reached #43 on the Billboard 200.\n\nMan of Colours was lauded in Australia during 1988. The album won two ARIA Awards, 'Album of the Year' and 'Highest Selling Album'; the associated song &quot;Electric Blue&quot; won 'Most Performed Australasian Popular Work' at the Australasian Performing Right Association (APRA) Music Awards for its writers Davies and Oates.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c1a42fe58bb278bcf91db7993e1912096078fd91","amp;dn":"Icehouse+-+Electric+Blue++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1a42fe58bb278bcf91db7993e1912096078fd91","infoHashBuffer":{"type":"Buffer","data":[193,164,47,229,139,178,120,188,249,29,183,153,62,25,18,9,96,120,253,145]},"announce":[],"urlList":[]}}