{"title":"Dont_Starve_Update_Rev_89685-FLTDOX","uid":9219072,"size":40279945,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1e1270d3c01b80343fc5e38199def55a7d27c26&amp;dn=Dont_Starve_Update_Rev_89685-FLTDOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":3,"time":1384907021,"description":"\n           ___________   ___________  ________/   ____________ _____\n    +----- _  _____ /_____  _____/ -_______  _____  /_   |/    / -+\n    |      /  ___/  /    /    /       /    /    /     /   /  _/   _/   |\n    |   __/   /   _/    /    /     __/  __/    /   __/   /       _   |\n    |       /_____    /    /          ______/_____    /_____    /   |\n    +---   / ----   /   / ------   / ----------   / -----   / ---+\n          /        /   /          /              /         / (nw!)\n                       FairLight DOX Division Presents:\n\n             Dont Starve Update Rev 89685 (c) Klei Entertainment\n\n:   Cracked by:  FAiRLiGHT            : :  Release Date: 19-11-13            :\n    Packaged by: FAiRLiGHT                 # of Options: N/A\n    Type: [ ] Manual/Reference Card                Type: Crack\n          [ ] CD/Box Covers\n          [ ] Walkthrough\n          [ ] Strategy Guide\n:         [X] Content                                                        :\n:         [X] Patch\n    Number of archives: x\n\n\n  Update Notes:\n  =============\n\n  November 14, 2013 - Bugfix / Performance update Edit\n\n  Gameplay fixes\n\n  * Add naughtiness to smallish tallbird\n  * shadow maxwells scare rabbits\n  * wilson is invincible while sleeping\n  * fix recipe prototyping to work with new tech level splits\n  * fix for Winter is generated in spite of the Season preset setting  being\n    set to Only Summer. in the World Menu\n  * fix for wolfgang saying how mighty he is and totally ruining everything in\n    the intro NIS\n  * Make telelocator check for water when teleporting randomly\n  * prevent infinite loot fountain from beaver-gnawed spiky tree\n  * Stumps can now be lit on fire after loading.\n  * Stumps now propagate fire.\n  * fix for placing structures after eating a glow fruit\n  * fix maxwell mine visibility\n  * heatrocks work in backpacks\n  * instead of clearing followers from saveindex on load which can  result  in\n    them being lost, clear followers on any save that is not an ascend/descend\n  * fix crash when lureplants eat bees\n  * Now reset the colour cube on load to deal with loading and saving  between\n    insane and non insane games.\n  * made evergreens and cave  entrances  non-clickable  when  they  are  first\n    worked to stop you from interacting with them by accident\n  * Planted pine cone has different name from unplanted\n  * Abigail is is now tagged as a &quot;character&quot;, additionally the tentacle  will\n    retaliate against anything in range that is attacking it\n  * lantern swap bug fix\n  * lantern cant be turned on in pocket\n  * killing a baby beefalo is very naughty\n  * Made a &quot;SelfStacker&quot; component and added it to  the  houndstooth,  monster\n    meat and spoiledfood to improve base clenliness and  performance  in  very\n    long games\n  * Rubble no longer crashes\n  * Armour will always return 0 damage if the absorb percent is &gt;= 1.\n  * There is now only one &quot;Sinkhole&quot; room per task. This will remove the  case\n    of regularly seeing two cave entrances near each other.\n  * Made &quot;characterspecific.lua&quot; a component for items that are only  supposed\n    to be on one character. Added it to all character specific items.\n  * fix bug where nightmare stuff was getting turned on in second overworlds\n  * fix for occasional cave gen fail\n  * Fix for wes talking\n  * Walrus blow dart is no longer targettable/inspectable during flight\n  * Fix for two bugs: Leif not exiting frozen  once  hit  and  minotaur  being\n    stunlockable.\n  * Made beefalo poop in the old way, and fixed a problem  with  their  babies\n    never showing up\n  * Catcher now makes sure  the  projectile  its  tracking  is  valid  before\n    attempting to preform functions with it.\n  * Combat function now ensures that the entity its on is still around before\n    calling GetDistSqToInst.\n  * Ham bat no longer loses durability from being used, but  does  spoil  over\n    time\n  * Ham bat and flower hat both display  spoilage  graphics  instead  of  text\n    percentages in order to reflect that they are spoiling over time\n  * fixed occasional invisible maxwell intro bug\n  * properly report farm plot fertilization success\n  * make the build placers opaque so that they show up better\n  * make burnt trees more visible when they are highlighted\n  * Deerclops will knock down anything he collides with that is tagged &quot;tree&quot;,\n    allowing him to pass through.\n  * Divining rod will not disappear when attacking.\n  * made hambat non-edible to avoid interface confusion. Gave it higher damage\n    to compensate.\n  * flower hat is not edible to reduce interface confusion\n  * make dusk announcement more generic, so that it doesnt mention fire.\n  * Inventory items that also have brains will now hibernate  while  they  are\n    held by an owner.\n  * Bees no should no longer buzz while in a container.\n  * Fix for mandrake crash when travelling between cave levels.\n  * Use consistent language for the settings screen in FE and pause menu\n  * Fix for inventory items getting into a bad state when you try to put  them\n    into an already-full chester\n  * Birds can no longer be killed while flying away.\n  * Shadow Creatures will not trigger tooth traps.\n  * Fix woodie, chester contents, and beard issues when time catches  up  when\n    leaving / entering caves\n  * Fix for dropping equippable tools under full-container conditions\n  * Maxwells Shadows will now die when he does.\n  * Fix bee spawn schedule\n\n  Controller stuff\n\n  * Added a controller debug menu\n  * Improved attack/interaction picker\n  * Added vibration (it can be toggled off)\n  * added controller hints to  the  front  end  screens  and  made  them  more\n    consoleish when a controller is attached\n  * When using dpad to use un-equipped item on  the  scene,  it  will  now  be\n    equipped if required\n  * Fix for item-on-item interactions with controller\n  * Fix &quot;for science!&quot; button controller focus when you beat the game\n  * Inventory hint stays up longer\n  * Added trigger tooltips to inventory and crafting bars\n  * Controller tips for inventory and container items  are  at  more  sensible\n    offsets\n  * add louder controller focus change sound\n  * added repeat rate for controller page/value changes\n  * hooked up sounds to page flips\n  * dont play scrolling sounds after the ends of the crafting menu\n  * When using a controller pressing the &quot;INVENTORY_USEONSELF&quot; bind  will  now\n    first toggle deployable mode on (if applicable) a 2nd press  will  execute\n    any action related to the bind if deployable mode was triggered.\n  * Keep the crafting menu open as you open and close the map\n  * make controller scrolling move a page at a time in  the  character  select\n    screen\n  * changed the sense of the rotation buttons to be more logical\n  * controller focus movement in FE has repeat when held\n  * Use the correct string (based on type, not index) to name  the  controller\n    youre configuring on the controls screen\n  * Added default PS3 controller bindings on OSX\n  * Added various missing control bindings across platforms\n  * Split ui focus controls from movement\n  * Split prev/next controls from prev/next page, bound to spinner\n  * Controls screen listens for pgup/pgdown, scrolls by  half-screens  so  you\n    can see some paired controls better\n  * Deprecated &quot;custom control&quot; values which  are  unused  inhouse,  hopefully\n    unused in mods\n  * Increment control mapping version,  invalidating  users  current  mapping\n    settings (sorry!)\n  * When hovering a stackable item over a stack of the same type the hint  now\n    says &quot;Put&quot; instead of &quot;Swap&quot; to match the behaviour\n\n  Performance\n\n  * Re-enabled mipmapping on pc - the game should look  much  cleaner  at  low\n    resolutions now\n  * Set up better timer code for osx and linux\n  * Lots of GPU / shader optimizations - the game should run better  on  older\n    cards\n  * made killer bee brains cheaper\n  * made controller button popup checker cheaper\n  * Fire fighting ) - Perf improvement with burning trees (lights in general).\n    Light buffer is now quarter res (actually its fixed res)\n  * Lua spike prevention - no defered userdata cleanup, timeslicing &quot;built-in&quot;\n\n  UI fixes\n\n  * disable crafting/inventory opening when you are a beaver\n  * adjust recipe description text over slightly\n  * properly pause game when prompting the player  to  confirm  activation  of\n    adventure portal so that controller input isnt picked up by the game\n  * The audio settings are automatically changed when starting a new game on a\n    fresh install\n  * fix scrolling issue with crafting UI\n  * Fix mousewheel zoom on map screen\n  * clock is now more legible\n  * Dont stop FE music when a character is selected\n  * Updated fonts in inventory bar for legibility\n  * Spoilable inventory items now also have a highlight outline  behind  their\n    icon/text\n  * fix text cut-off in crafting menu\n  * replaced big arrow button anims with image buttons\n  * hide hud and squelch interaction when going through wormhole\n  * map screen panning is smooth instead of chunky\n  * Remove non-functional open/close prompt for equipped containers when using\n    controller\n  * arrow added to hud for backpack\n  * inventory bg is one solid image\n  * move chester open menu up to the top of the screen\n  * opening chester will close chests and vice-versa (so they dont overlap)\n  * Display deaths recorded as &quot;unknown&quot; as &quot;shenanigans&quot; instead\n\n  Misc\n\n  * Did full string pass - there should be no more missing strings\n  * Player character Art is high-res for nicer closeups\n\n\n  Instructions:\n  =============\n\n  * This release requires the following updates installed before you begin:\n\n    Dont_Starve_Update_Six_Feet_Under-FLTDOX\n    Dont_Starve_Update_Alls_Well_That_Maxwell-FLTDOX\n\n  * Now unrar the update.exe and run it ( point to your installation\n    folder if required )\n\n  * Play the game\n\n                                                            /TEAM FAIRLIGHT\n\n\n                +-+  Kindest regards - FairLight DOX 2013 +-+\n","torrent":{"xt":"urn:btih:c1e1270d3c01b80343fc5e38199def55a7d27c26","amp;dn":"Dont_Starve_Update_Rev_89685-FLTDOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1e1270d3c01b80343fc5e38199def55a7d27c26","infoHashBuffer":{"type":"Buffer","data":[193,225,39,13,60,1,184,3,67,252,94,56,25,157,239,85,167,210,124,38]},"announce":[],"urlList":[]}}