{"title":"EvolutionX Build 3935","uid":3628802,"size":3057080,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:c2a4cfb0a9d71ffd390c09910350c117607d1208&amp;dn=EvolutionX+Build+3935&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"def_fred","files":1,"time":1172688928,"description":"EvolutionX is a very confusing xbox program for novice xbox modders. The reason for this confusion is because EvolutionX is actually two separate programs. It is both an alternative dashboard for the Xbox, as well as a hacked bios. The problem is that the term ?EvolutionX? is often used interchangeably with the term ?EvoX?. EvoX and EvolutionX are the same thing, but you won?t need to worry about installing the BIOS part of EvolutionX unless you purchase a mod chip that does not come pre-installed with a bios (such as the Matrix mod chip or X-ecuter 2 Pro mod chip).\n\nYou will however need to install the EvolutionX dashboard, regardless of which mod chip you purchase. The dashboard is what appears when you turn on your Xbox console without a disc in the disc tray. The dashboard will let you adjust system settings, including audio, video, language and memory management. The EvolutionX dashboard is an integral component to Xbox modding because in order to connect to the Xbox from your PC you must replace the default Xbox dashboard with the EvolutionX dashboard.","torrent":{"xt":"urn:btih:c2a4cfb0a9d71ffd390c09910350c117607d1208","amp;dn":"EvolutionX+Build+3935","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a4cfb0a9d71ffd390c09910350c117607d1208","infoHashBuffer":{"type":"Buffer","data":[194,164,207,176,169,215,31,253,57,12,9,145,3,80,193,23,96,125,18,8]},"announce":[],"urlList":[]}}