{"title":"Coding for Penetration Testers","uid":7941375,"size":10361021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3c98b1ecc4993316673faab9af5859d4af45b7e&amp;dn=Coding+for+Penetration+Testers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1355995197,"description":"Coding for Penetration Testers: Building Better Tools\n\nPublication Date: October 7, 2011 | ISBN-10: 1597497290 | ISBN-13: 978-1597497299 | Edition: 1 | Format: PDF\n\nTools used for penetration testing are often purchased or downloaded from the Internet. Each tool is based on a programming language such as Perl, Python, or Ruby. If a penetration tester wants to extend, augment, or change the functionality of a tool to perform a test differently than the default configuration, the tester must know the basics of coding for the related programming language. Coding for Penetration Testers provides the reader with an understanding of the scripting languages that are commonly used when developing tools for penetration testing. It also guides the reader through specific examples of custom tool development and the situations where such tools might be used. While developing a better understanding of each language, the reader is guided through real-world scenarios and tool development that can be incorporated into a testers toolkit.\n\nDiscusses the use of various scripting languages in penetration testing.\n\nPresents step-by-step instructions on how to build customized penetration testing tools using Perl, Ruby, Python, and other languages.\n\nProvides a primer on scripting including, but not limited to, Web scripting, scanner scripting, and exploitation scripting.","torrent":{"xt":"urn:btih:c3c98b1ecc4993316673faab9af5859d4af45b7e","amp;dn":"Coding+for+Penetration+Testers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3c98b1ecc4993316673faab9af5859d4af45b7e","infoHashBuffer":{"type":"Buffer","data":[195,201,139,30,204,73,147,49,102,115,250,171,154,245,133,157,74,244,91,126]},"announce":[],"urlList":[]}}