{"title":"Imam Anwar al-Alwiki Lectures on Islam and Jihad","uid":9234691,"size":4216943686,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c41e9d799a07031f6028c328715cdb938e6b2541&amp;dn=Imam+Anwar+al-Alwiki+Lectures+on+Islam+and+Jihad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bamboo_Delight","files":2,"time":1385148148,"description":"Imam Anwar al Alwiki was blown up into tiny little pieces by a CIA drone. (Hooray for the CIA!)\n\nFortunately, for the free people of the world, this murdering Muslim pig left a series of English language lectures telling the world just how bizarre, demented and evil Islam really is. No, of course, Alwiki didn't actually believe this to be the case because he was a Muslim cleric who had delved into the fables and lies of Muslim literature to tell us all how wonderful it is. But his delusion about want Islam really is, does not prevent the un-biased listener from understanding that this really is the case. Islam is a demonic religion of lies, murder, thievery and slavery. It makes big promises about what a Muslim will get in Paradise -- mansions of gold, green gardens full of delicious fruit each as big as a house, 72 virgins to screw for eternity, etc. But in exchange for these amazing promises, the Muslim must murder the people of the world, steal everything he can get his hands on, rape the women of the world, enslave the people of the world, and burn down everything. That's what makes a good Muslim and that's how a Muslim proves to his (demon god) Allah that he is worthy to enter paradise just like the voices in Mohammad's head promised.\n\nThese lectures were not given all sugar-coated to a non-Muslim audience so as to deceive them into accepting Islam. These lectures were given to English-speaking Muslim audiences in London and Los Angeles, teaching them the history of Islam and the finer points of killing people through perpetual Jihad. Once you listen to these lectures, you will know everything and every secret about Islam. They were not meant for the non-Muslim; they were meant for the average thieving and murdering Muslim, just like the ones living near you right now.\n\nThese lectures are divided into 12 parts: \n\n1.The Life of Mohammad Part 1 (16 Lectures)\n2.The Life of Mohammad Part 2 (18 Lectures)\n3.Abu Bakr (15 Lectures)\n4.Companions Of The Ditch (6 Lectures)\n5.Lives of the Prophets (64 Lectures)\n6.Umar Ibn al-Khattab (18 Lectures)\n7.Stories from Hadeeths (4 Lectures)\n8.Jihad (11 Lectures)\n9.The Constants of Jihad (6 Lectures)\n10.The Hereafter Part 1 (9 Lectures)\n11.The Hereafter Part 2 (12 Lectures)\n12.Allah is Preparing Us for Victory (2 Lectures)\n\nAfter listening to these lectures, you will understand that (1) Europe, the USA, Australia and all countries of European descent are under assault and (2) what we have been told about Islam is nothing but lies.\n\nThe only difference between a moderate Muslim and a fanatical Muslim is that the fanatical Muslim wants to kill you today while the moderate Muslim is patiently waiting to kill you tomorrow.\n\nLearn the facts about Islam straight from the camel's mouth. Alwiki was a deluded maniac just as all Muslims are deluded by the lies of Mohammad.\n\n\nChristians, Jews, Hindus, Buddhists, and atheists will find these lectures just what you need to defend yourself from one of the world's greatest religious frauds and lies -- the murderous and thieving cult of Islam.\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:c41e9d799a07031f6028c328715cdb938e6b2541","amp;dn":"Imam+Anwar+al-Alwiki+Lectures+on+Islam+and+Jihad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c41e9d799a07031f6028c328715cdb938e6b2541","infoHashBuffer":{"type":"Buffer","data":[196,30,157,121,154,7,3,31,96,40,195,40,113,92,219,147,142,107,37,65]},"announce":[],"urlList":[]}}