{"title":"samurai champloo full hd english sub","uid":6288895,"size":4094480384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4885c9c5e6998829939b7260ef1b65ccc4a6c8c&amp;dn=samurai+champloo+full+hd+english+sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"achyu1","files":26,"time":1301724446,"description":"Synopsis\n\n\nA young woman named Fuu is working as a waitress in a tea shop when she is harassed by a band of samurai. When a mysterious rogue named Mugen enters the shop, he offers to get rid of the band of samurais in exchange for food, but instigates in a brawl instead. Jin, a young ronin in samurai garb, enters the tea house in the midst of the fight. Mugen attacks Jin after he proves to be a worthy opponent and they begin fighting one another, ignoring a fire that started during the brawl. They both faint from smoke inhalation. When they awaken, they find they have been arrested for the murder of Shibui Tomonoshina, the magistrate's son who had burned to death in the fire, and are to be executed. With help from Fuu, they escape and Fuu asks them to travel with her to find &quot;the samurai who smells of sunflowers,&quot; a mysterious man Fuu can give little description of, but who she insists she must find as she thinks he's her long lost father. They agree to join her, with Fuu making in the condition that they are not to duel one another until the journey is done","torrent":{"xt":"urn:btih:c4885c9c5e6998829939b7260ef1b65ccc4a6c8c","amp;dn":"samurai+champloo+full+hd+english+sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4885c9c5e6998829939b7260ef1b65ccc4a6c8c","infoHashBuffer":{"type":"Buffer","data":[196,136,92,156,94,105,152,130,153,57,183,38,14,241,182,92,204,74,108,140]},"announce":[],"urlList":[]}}