{"title":"Tiny_XP for USB Flash or External HD","uid":4310523,"size":300326645,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c5ee41b87b0bb77edf5d182a130381a5f1f76bab&amp;dn=Tiny_XP+for+USB+Flash+or+External+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Protocol22","files":7,"time":1216789494,"description":"************************************************************************\n*                                                                      *\n* IMPORTANT : EVEN THOUGH THIS CAN BE INSTALLED TO FLASH DRIVES IT IS  *\n* NOT INTENDED FOR SUCH USE --- THIS IS DESIGNED FOR EXTERNAL/PORTABLE *\n* HARD DRIVES ONLY --- THIS IS NOT AN OFFICIAL eXPerience RELEASE BUT  *\n* MODIFIED BY Protocol22 TO ENABLE INSTALLATION TO USB DRIVES.         *\n*                                                                      *\n*  Thanks To:                                                          *\n*                                                                      *\n*    eXPerience For Fantastic XP-Release Upon Which This Is Built.     *\n*                                                                      *\n************************************************************************\n\n\n\n\n\n\n\n\nThis is Tiny_XP SP2 by eXPerience modified so it can be installed\nto an External Hard Drive, (USB External/Portable Drive)\nWhy ? You may ask...\n\nPersonally I run Linux on my laptop and when I need to use XP I simply\nplug my External (HDD) Drive into a USB port and Boot it up.\n\nBut if you use Linux why don't you just install XP on VMWare or something ...\nWouldn't that be a lot more practical ? ...(You may ask)\n\n\nI did it because Microsoft designed it Not to be done like this...\nWhat more can I say ?\n\n\n\n---------------------------------------\n\nFiles Modified in Tiny XP ISO (I386 Folder)\n\nDOSNET.INF\nTXTSETUP.SIF\nUSB.IN_\nUSBPORT.IN_\nUSBSTOR.IN_\n\nADDED: USBBOOT.INF\n\n\nThese modifications allow this version of Tiny XP to\nbe installed on an external hard drive or usb flash disk.\n\n\n\nAlso included are two utilities to &quot;properly&quot; format your target\npartition on an external hard drive or USB Flash Key.\n\n1) lexar_usb_format which contains bootit.exe - This is useful for\n   &quot;flipping&quot; a USB Flash Drive so that Windows will see it as a \n fixed drive and not a removable drive anymore - This works with\nabout 50% of the Flash drives on the market.\nWhen using bootit.exe make sure to tick the checkbox not to copy \nsystem files.\n\n2) SP27608.exe which is the HP USB Drive Format Utility to format\nyour external drive or USB Flash device.\n\n\n------------------------------------------\n            INSTRUCTIONS\n------------------------------------------\n\nBurn TinyXP_4_USB_Drive.iso to a blank CD or DVD.\n\n\nPrepare your External Drive (USB Drive) :\n\nFormat it as an NTFS partition - Installations on Flash Drives (NOT RECOMMENDED) are noticeably\nslower than on external USB Pata or Sata drives - You may be able to\ninstall onto a FAT32 partition on external HDD's but it is advisable to\nuse NTFS for formatting - Flash drives have to be formatted as NTFS to \ntake this installation. (They are usually FAT32 originally) \n\n\nDisconnect all your hard-drives on your computer - This will ensure the Master\nBoot Record is not overwritten on these drives - If you leave your hard drive\nconnected the installation may well write the BOOT.INI file to the main HD - You\nneed everything written to the USB Drive to enable it to be Bootable afterwards.\n\nBoot your computer from CD and install as normal - when Windows Installation reaches\nthe partition stage you should see only your USB drives partition and choose this as\ntarget for installation.\nOnce you pick the partition and start installation the rest is unattended - This is\nbecause this version is based on Tiny_XP by eXPerience (without driverpacks) \n\nWhen Windows starts for the first time you will get a Message stating that the PageFile\ndoes not exist or is too small - This is no problem - Simply go to Control Panel - System \nand than to Advanced where you can set the size in MB's for your PageFile - You should set\nthis as recommended or 150% - 200% of your RAM - i.e. If you have 1GB Ram, set it for \n1536MB-2048MB - If using a small USB Flash you can also opt not to use any PageFile system -\nIt should run smoothly once the option is set.\n\nThat's it ... When you wish to run XP simply plug your External HD or Flash into a USB port\nand set your computers BIOS to boot from the USB drive (Most Bios have option of USB-Zip and/or\nUSB-HDD in advanced BIOS settings.)\n\n\nGOOD LUCK !\n\n\n------------------------------------------\n\n\n\nThese are the MD5 and SHA1 Sums of TinyXP_4_USB_Drive.iso Image file.\n\n\nMD5SUM :    c8ba3acfaf9a71c9c8bdf36da5a3af5\n\n\n\nSHA1SUM :    417bfcaf56afbc64acf6e56b441b631f21fe7f89\n\n\n\n\n","torrent":{"xt":"urn:btih:c5ee41b87b0bb77edf5d182a130381a5f1f76bab","amp;dn":"Tiny_XP+for+USB+Flash+or+External+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5ee41b87b0bb77edf5d182a130381a5f1f76bab","infoHashBuffer":{"type":"Buffer","data":[197,238,65,184,123,11,183,126,223,93,24,42,19,3,129,165,241,247,107,171]},"announce":[],"urlList":[]}}