{"title":"Sword of the Samurai [PAL &amp; NTSC], Ps2","uid":5896956,"size":1073614043,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c63d7ee1e163f76b7bb32559530e8a10135161c8&amp;dn=Sword+of+the+Samurai+%5BPAL+%26+NTSC%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1287531248,"description":"Sword of the Samurai for the Ps2                                    Rel. 02/14/2003\n\n\n\nFormat:        DVD5 PAL &amp; NTSC\nLang.:         English\nDiscs:         2\nImage:         MDS/ISO\nGenre.:        RPG\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes: This ps2 game was released only in pal. This upload contains the \n               original pal game, and a Ntsc Patched Version for the rest of us to \n               enjoy. There is one glitch with the NTSC version the beginning \n               cutscene or other cutscenes are a little choppy. This is because \n               the game plays better in pal.\n\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nSword of the Samurai is a story-driven sword fighting game that allows players to create a character and train their fighter in a variety of fighting techniques as they work their way to finally become the ultimate Bushido Master. Players will experience their character's growth as they develop their own sword-fighting style and learn new skills by receiving authentic advice and instruction from expert Dojo Masters. Players will fight multiple opponents including 30 of the most famous Japanese sword-fighting grandmasters, going on a variety of missions to learn new sword fighting skills and amass a collection of more than 100 authentic swords with individual statistics. Sword of the Samurai is the ultimate sword fighting game, featuring awesome combat in a feudal Japanese atmosphere.\n\nThe gameplay focuses on improving and enhancing your somewhat terrible sword skill technique. As at the beginning of the game your sword play starts with what seems like &quot;swinging a bat&quot; rather than a sword technique, you improve your skill and techniques by &quot;stealing&quot; techniques by dueling with other swordsmen of which you add to your own library of sword techniques and customize which techniques suit your purposes.\n\nThe &quot;semi-RPG&quot; elements refer to the &quot;skill and techniques&quot; development of your character. The more duels, missions and bouts your character accomplishes, the more sword techniques your character will eventually learn as well as gradually increasing your character stats.\n\nThus dueling is the essence of the gameplay, may it be a friendly match with wooden swords or unofficial death matches using your steel sword (katana). \n\nSwordplay techniques are extremely complicated at first, comprising of detailed forms: Stances, each with different types of attacks; Parrying and the ability to counter attack after a correct block; Stance Attack, the ability for a surprise attack against a correct stance and much more.\n\n\n\nFeatures:\n\n* Develop a unique fighter from appearance to individual skills and sword fighting \n  style with a combination of various defense and attack stances.\n\n* Utilize a variety of sword mastery fighting styles and strategies, including\n  direct attacks, parries and other sword techniques.\n\n* Fight multiple opponents simultaneously - one versus multi opponents or \n  traditional one-on-one scenarios.\n\n* Take on missions and fight in tournaments, including assassination, defend,\n  rescue, and guard and protect.\n\n* Fight against 30 famous, historical Japanese sword masters with accurately  \n  modelled weapons and realistic sword techniques all based on real Japanese sword \n  schools. \n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:c63d7ee1e163f76b7bb32559530e8a10135161c8","amp;dn":"Sword+of+the+Samurai+%5BPAL+%26+NTSC%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63d7ee1e163f76b7bb32559530e8a10135161c8","infoHashBuffer":{"type":"Buffer","data":[198,61,126,225,225,99,247,107,123,179,37,89,83,14,138,16,19,81,97,200]},"announce":[],"urlList":[]}}