{"title":"The Origin Of Ideas - Blending, Creativity And The Human Spark (","uid":9539836,"size":10958558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6ac2e1384d46af44dd59c7bb9d3eeba43d03cec&amp;dn=The+Origin+Of+Ideas+-+Blending%2C+Creativity+And+The+Human+Spark+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391017615,"description":"The Origin of Ideas: Blending, Creativity, and the Human Spark by Mark Turner\n\n\nFormat: mobi/epub/azw3\nLength: 311 pages\nGenre: Non-Fiction/Psychology/Evolution\nDate: 2 January 2014\n\nFor anyone interested in how and why our minds work the way they do, The Origin of Ideas offers a wealth of original insights--and is itself a brilliant example of the innovative thinking it describes. \n\nWhile other species do what we cannot: fly, run amazingly fast, see in the dark-only human beings can innovate so rapidly and widely. Turner argues that this distinctively human spark was an evolutionary advance that developed from a particular kind of mental operation, which he calls &quot;blending&quot;: our ability to take two or more ideas and create a new idea in the &quot;blend.&quot; Turner begins by looking at the &quot;lionman,&quot; a 32,000-year-old ivory figurine, one of the earliest examples of blending. Here, the concepts &quot;lion&quot; and &quot;man&quot; are merged into a new figure, the &quot;lionman.&quot; Turner argues that at some stage during the Paleolithic Age, humans reached a tipping point. Before that, we were a bunch of large, unimaginative mammals. After that, we were poised to take over the world. \n\nOnce biological evolution hit upon making brains that could do advanced blending, we possessed the capacity to invent and maintain culture. Cultural innovation could then progress by leaps and bounds over biological evolution itself, leading to the highest forms of human cognition and creativity. \n\nAuthor:\n\nMark Turner, Ph.D., is Institute Professor and Professor of Cognitive Science at Case Western Reserve University. He is the founding director of the Cognitive Science Network and co-director of the Red Hen Lab. His most recent book publications are Ten Lectures on Mind and Language and two edited volumes, The Artful Mind: Cognitive Science and the Riddle of Human Creativity and Meaning, Form, &amp; Body, edited with Fey Parrill and Vera Tobin.\n","torrent":{"xt":"urn:btih:c6ac2e1384d46af44dd59c7bb9d3eeba43d03cec","amp;dn":"The+Origin+Of+Ideas+-+Blending%2C+Creativity+And+The+Human+Spark+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ac2e1384d46af44dd59c7bb9d3eeba43d03cec","infoHashBuffer":{"type":"Buffer","data":[198,172,46,19,132,212,106,244,77,213,156,123,185,211,238,186,67,208,60,236]},"announce":[],"urlList":[]}}