{"title":"Gnomoria v0.8.48","uid":8762119,"size":206375078,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c6ac31aebbd4f922d4aad202783d100e9354731d&amp;dn=Gnomoria+v0.8.48&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1375264080,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n-Procedurally generated world - Every game is different\n-Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n-Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n-Crafting - Tons of items to craft at different workshops\n-Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nGnomoria v0.8.48\n\nGeneral:\n-Added Wheelbarrows. Gnomes will use wheelbarrows to stock multiple items at once. They can be crafted at the Carpenter's workshop\n(Please note that some people on the official forums are experiencing crashes and odd behaviour with wheelbarrows)\n\nFixed:\n-Grass growing causing performance issues and freezing. It effected some save games more than others. For those save games the first time loading will be much longer.\n\nSystem requirements:\nOS: Windows XP, Vista, 7, 8\nProcessor: 2.0 Ghz\nMemory: 1GB\nHard Disk Space: 150MB\nVideo Card: 128mb Video Memory\nDirectX: 9.0c or Greater\n\nXNA Framework 4.0 and .NET Framework 4.0 are included in the _CommonRedist folder. (Install these first.)\n\nYou can help the developer and buy the game on steam here: http://store.steampowered.com/app/224500/\n","torrent":{"xt":"urn:btih:c6ac31aebbd4f922d4aad202783d100e9354731d","amp;dn":"Gnomoria+v0.8.48","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ac31aebbd4f922d4aad202783d100e9354731d","infoHashBuffer":{"type":"Buffer","data":[198,172,49,174,187,212,249,34,212,170,210,2,120,61,16,14,147,84,115,29]},"announce":[],"urlList":[]}}