{"title":"the Blue Lagoon (Greek Subs).mkv","uid":9801220,"size":1198118464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c6d96cfe1d68608e30e322098942101e3c0cf81b&amp;dn=+the+Blue+Lagoon+%28Greek+Subs%29.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nik51","files":-1,"time":1395381340,"description":" Return to the Blue Lagoon (1991)  &quot;Epistrofh sth Galazia limnh&quot;  me Greek Subs.\n\nSkhnothesia: William A. Graham\nMe : Milla Jovovich, Brian Krause, Lisa Pelikan, Courtney Barilla, Garette Ratliff Henson, Nana Coburn, Brian Blain\n\nMia gynaika, h mikrh ths korh kai ena agoraki kataligoyn s' ena erhmonisi. H gynaika tha ginei daskala ton paidion, mexri ton thanato ths kai tha toys didaxei na exoyn arxes....\nTa dyo paidia tha synexisoyn na zoyn mona toys sthn agria fysh mexri th stigmh poy ena ploio tha ftasei sto nisi kai tha toys anakalypsoyn. \nOi kyries diafores poy entopizonte (apo thn proth tainia) einai oti ta paidia edo den anakalyptoyn ton erota, alla ton vionoyn gnorizontas ti einai kai tis proektaseis toy, akoma oi gnoseis, pia, ton paidion gia tis sxeseis sthn koinonia, alla kai h paroysia allon anthropon pano sto erhmonhsi apo ta mesa ths tainias kai meta.\nAnthropoi vgalmenoi apo ta protypa ths epoxhs k epireasmenoi me ta strava mias koinonias poy eprepe na isoropisei ta prepei me ta thelo. Kai etsi sto telos prepei na epilexoyn anamesa ston apomonomeno paradeiso k ton politismeno kosmo. . (Pistevo na katalavate ti epelexan ..xa) \nGia thn Ifigenia75.\n\n- Kalh Theash kai an thelete kante ligo SEED... giati exo megalo provlhma me thn taxythta (kai poy exo internet sthn perioxh poy vriskomai poly moy einai).\n\n...PROSEXOS...(san ta kala sinema) thn allh vdomada tha anevaso mia POLY KALH tainia poy vasizetai se pragmatika gegonota. ","torrent":{"xt":"urn:btih:c6d96cfe1d68608e30e322098942101e3c0cf81b","amp;dn":"+the+Blue+Lagoon+%28Greek+Subs%29.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d96cfe1d68608e30e322098942101e3c0cf81b","infoHashBuffer":{"type":"Buffer","data":[198,217,108,254,29,104,96,142,48,227,34,9,137,66,16,30,60,12,248,27]},"announce":[],"urlList":[]}}