{"title":"The Secret Cases of Sherlock Holmes","uid":6434050,"size":218656735,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c7430f722a99d8ff152278a21800701152ebc229&amp;dn=The+Secret+Cases+of+Sherlock+Holmes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":10,"time":1306715141,"description":"The Secret Cases of Sherlock Holmes\nby Donald Thomas\nnarrated by John Telfer\nMono 44.1 Hz / 48 kbps\n\nThis audiobook is not new to Demonoid, Peterg23 has uploaded it in the past, but this version has one mp3 for each story whereas Peterg23's torrent has sequential mp3s - The Secret Cases part 1, part 2 etc. I am also in the process of changing a couple of my own Holmes torrents which used the same method to name the files - ie. the book's name part1, part 2 etc.\nI managed to remove all the 'end of CD1', 'start of CD2' etc announcements as well.\nedit\nBecause of one of the posts I'll point out that I edited Peter's torrent in lossy mode instead of lossless which would of been 'the right way'. But for me lossless editing is the right way to do it if this was music. For spoken word like this I just don't find it important enough. I'm adding this edit reluctantly. The right thing to do? I guess. Does it matter? If it did I think those people would be better off buying the CD set themselves or doing the edit to separates themselves.\n\nAbout the book...\nThis compelling collection brings Baker Street's celebrated resident and his cohort, Dr Watson, out of retirement to investigate seven of the most notorious mysteries in the annals of true crime, from the murder of a London prostitute to the 1907 theft of the Irish Crown Jewels.\nIn Paris, Holmes and Watson become embroiled in the suspicious death of the French president; in Yokohama, they solve a mystifying case of poisoning. And on at least one occasion, the formidable powers of the great detective save the English monarchy, government, and nation.\n\nKirkus review:\nDonald Thomas (Dancing in the Dark, 1993, etc.) drags the inimitable detective out of retirement still again to investigate seven mysteries closely based on historical fact, from the alleged bigamy of George V (a case that brings him to the attention of Professor Moriarty) to the theft of the Irish crown jewels from an impregnable strongroom. Holmes journeys with a grumbling Watson to Paris to vindicate Captain Dreyfus (embroiling himself in the death of French President Flix Faure), books passage to Yokohama for the second of two cases of arsenic poisoning, and allies himself with the pyrotechnical barrister Sir Edward Marshall Hall for two cases closer to home. Holmes's repeated defense of hopeless cases casts him as an unlikely Perry Mason, and the cases themselves--spacious and leisurely, unfolding over a period of months or years--do more justice to history than to Holmes. But dedicated Sherlockians will appreciate the novelty of the great detective's incursion into real-life crimes that don't involve Jack the Ripper.\n\nThe Secret Cases 1of9 A Letter to Posterity from John H. Watson, MD\nThe Secret Cases 2of9 The Ghost in the Machine\nThe Secret Cases 3of9 The Case of the Crown Jewels\nThe Secret Cases 4of9 The Case of the Unseen Hand\nThe Secret Cases 5of9 The Case of the Blood Royal\nThe Secret Cases 6of9 The Case of the Camden Town Murder\nThe Secret Cases 7of9 The Case of the Missing Rifleman\nThe Secret Cases 8of9 The Case of the Yokahama Club\nThe Secret Cases 9of9 Author's Note\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c7430f722a99d8ff152278a21800701152ebc229","amp;dn":"The+Secret+Cases+of+Sherlock+Holmes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7430f722a99d8ff152278a21800701152ebc229","infoHashBuffer":{"type":"Buffer","data":[199,67,15,114,42,153,216,255,21,34,120,162,24,0,112,17,82,235,194,41]},"announce":[],"urlList":[]}}