{"title":"Jehovah's Witnesses - A Non Prophet Organisation","uid":4136192,"size":161678336,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:c76671b9da3d769e3ec59f390e06b827b6bc94ab&amp;dn=Jehovah%5C%27s+Witnesses+-+A+Non+Prophet+Organisation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BUBBBAS","files":1,"time":1208278973,"description":"Interviewer: &quot;In your expert opinion Mr Mulrooney (sp?), are they in fact a cult?&quot;\nInterviewee: &quot;Yes, Jehovah&amp;#039;s Witnesses definitely fit the description of a cult, despite their denials. A cult always has a strong central figure demanding absolute authority. They even admit in the Proclaimer&amp;#039;s Book that a cult developed around Charles Taze Russell, their founder.\nNarrator: &quot;Charles Taze Russell was born in Allegheny, Pennsylvania in 1852. From age 11 he worked in the family clothing store and he became a successful businessman. At age 17 he came under the influence of the Early Second Adventists, who were setting dates for the end. He soon broke ties with the Adventists and launched out on his own, publishing the magazine now known as &amp;#039;The Watchtower&amp;#039;. His following grew, but trouble was brewing on the home front&quot;.\nNarrator: &quot;In 1906 after a number of marital battles, Russell was divorced from his wife Maria. Instead of sharing his personal assets with her, he transferred them to the Watchtower Bible and Tract Society which he totally controlled. The Proclaimer&amp;#039;s Book mentions this transfer in a tiny footnote, but we don&amp;#039;t read the obvious there: Pastor Russell had cheated his wife. The Proclaimer&amp;#039;s Book makes the repeated point that Pastor Russell was not found guilty of adultery, this was true only because his wife did not bring charges of adultery against him - instead she accused him of immorality with a young girl who was residing in their home&quot;.\nMaria: &quot;It was late in the evening, about eleven o&amp;#039;clock, he put his arms around her and kissed her. This was in the vestibule before they entered the hall, and he called her &amp;#039;his little wife&amp;#039; - but she said &amp;#039;I am not your wife&amp;#039;, and he said &amp;#039;I will call you daughter, and a daughter has nearly all the privileges of a wife&amp;#039;&quot;.\nQuestioner: &quot;And what other terms were used?&quot;\nMaria: &quot;Then he said: &amp;#039;I am like a jellyfish, I float around here and there, I touch this one and that one; and if she responds I take her to me, and if not I float on to others&amp;#039;. And she wrote that out so that I could remember it for sure when I would speak to him about it, and he confessed that he had said those things&quot;.\nNarrator: &quot;Why would The Proclaimer&amp;#039;s Book say that Maria Russell was seeking prominence for herself, when in reality the court stated: &amp;#039;He says himself that she is a woman of perfect moral character, and his own testimony is a strong confirmation of her allegations&amp;#039;. The judgment described his behaviour as cruel and barbarous treatment, adding: &amp;#039;His course of conduct toward his wife evidenced such insistent egotism and self-praise that would necessarily render the life of any sensitive Christian woman a burden, and make her condition intolerable&amp;#039;&quot;.\nSpeaker: &quot;I was surprised to find out many strange things about Pastor Russell when I did independent research on him. Here in the finished &amp;#039;Mystery Book&amp;#039; he taught that the churches of Christendom were started by bald-headed men with smoke on their brains. He thought that if a dog&amp;#039;s head were shaped like a man&amp;#039;s the dog could think like a man. He gave health advice that was pure quackery - for example he taught that appendicitis was caused by fighting worms in the colon. He sold so-called &amp;#039;miracle wheat&amp;#039; at greatly inflated prices to his gullible followers. None of these things are brought out in the Proclaimer&amp;#039;s Book&quot;.......\n","torrent":{"xt":"urn:btih:c76671b9da3d769e3ec59f390e06b827b6bc94ab","amp;dn":"Jehovah%5C%27s+Witnesses+-+A+Non+Prophet+Organisation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c76671b9da3d769e3ec59f390e06b827b6bc94ab","infoHashBuffer":{"type":"Buffer","data":[199,102,113,185,218,61,118,158,62,197,159,57,14,6,184,39,182,188,148,171]},"announce":[],"urlList":[]}}