{"title":"Calibre 2.46.0 Win &amp; Mac + Portable","uid":12964355,"size":281633800,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c7eb69a2d2bda83499f5a8ad47ff9cf494d4ba71&amp;dn=Calibre+2.46.0+Win+%26amp%3B+Mac+%2B+Portable+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"V3N0Ms","files":7,"time":1449877324,"description":"Calibre 2.46.0 Win &amp; Mac + Portable\r\n\r\nimage\r\n\r\nSize: 268 MB\r\n\r\nRequires: Win and Mac\r\n\r\nimage\r\n\r\nCalibre is designed to be an all-in-one open source tool for all of your e-books.\r\nLibrary Management\r\nIt manages your e-book collection for you. It is designed around the concept of the logical book, i.e., a single entry in your library that may correspond to actual e-book files in several formats.\r\nE-book conversion\r\nIt can convert from a huge number of formats to a huge number of formats. It supports all the major e-book formats. The full list of formats can be found here.\r\nThe conversion engine has lots of powerful features. It can rescale all font sizes, ensuring the output e-book is readable no matter what font sizes the input document uses. It can automatically detect/create book structure, like chapters and Table of Contents. It can insert the book metadata into a &quot;Book Jacket&quot; at the start of the book.\r\n\r\nSyncing to e-book reader devices\r\nIt has a modular device driver design that makes adding support for different e-reader devices easy. At the moment, it has support for a large number of devices, the complete list of which is here. Syncing supports updating metadata on the device from metadata in the library and creation of collections on the device based on the tags defined in the library. If a book has more than one format available, calibre automatically chooses the best format when uploading to the device. If none of the formats is suitable, calibre will automatically convert the e-book to a format suitable for the device before sending it.\r\nDownloading news from the web and converting it into e-book form\r\nIt can automatically fetch news from websites or RSS feeds, format the news into a ebook and upload to a connected device. The e-books include the full versions of the articles, not just the summaries. calibre has over three hundred news sources and the news system is plugin based, allowing users to easily create and contribute new sources to calibre. As a result the collection of news sources keeps on growing!\r\nComprehensive e-book viewer\r\nIt has a built-in ebook viewer that can display all the major ebook formats. It has full support for Table of Contents, bookmarks, CSS, a reference mode, printing, searching, copying, customizing the rendering via a user style sheet, embedded fonts, etc.\r\nContent server for online access to your book collection\r\nCalibre has a built-in web server that allows you to access your ebook collection using a simple browser from any computer anywhere in the world. It can also email your books and downloaded news to you automatically. It has support for mobile devices, so you can browse your collection and download books from your smartphone, Kindle, etc.\r\n\r\nNew Features:\r\n\r\nPDF Input: Add support for PDF outlines (bookmarks), if present, they are used as the metadata Table of Contents.\r\nBook polishing: Add tool to losslessly compress images in the book in order to reduce its filesize, without affecting image quality\r\nEdit Book: Add a new tool to compress images in the book losslessly, accessed from the Tools menu\r\nKobo driver: add support for new Kobo firmware\r\nBulk metadata edit dialog: Allow entering fractional numbers into the series number start with control.\r\nSpeed up moving libraries by using hardlinks instead of file copies when moving to a location on the same filesystem\r\nGet Books: Disable the Amazon EU stores, at Amazon’s request\r\n\r\nBug Fixes:\r\n\r\nFix moving libraries via calibre leaving behind a copy of the metadata_db_prefs_backup.json file in the original library folder\r\nMOBI Input: Warn about corrupted trailing data entries, instead of aborting. Getting some, even partially corrupted text is better than no text.\r\nBook details: Fix single value custom text column not clickable.\r\nSaving to disk: Fix custom date column being rendered in GMT instead of the local time zone when used in a save to disk template.\r\nImproved news sources:\r\nNew York Review of Books\r\nCaravan Magazine\r\n\r\n* Open with winrar/winzip.. (compressed file)\r\n\r\n* Just Run to use...\r\n\r\n* Enjoy!","torrent":{"xt":"urn:btih:c7eb69a2d2bda83499f5a8ad47ff9cf494d4ba71","amp;dn":"Calibre+2.46.0+Win+%26amp%3B+Mac+%2B+Portable+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7eb69a2d2bda83499f5a8ad47ff9cf494d4ba71","infoHashBuffer":{"type":"Buffer","data":[199,235,105,162,210,189,168,52,153,245,168,173,71,255,156,244,148,212,186,113]},"announce":[],"urlList":[]}}