{"title":"KSP Kerbal Space Program 0.14","uid":7081988,"size":157672396,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c80c66f298d48b0d91b9a1f238874416670b8bae&amp;dn=KSP+Kerbal+Space+Program+0.14&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"justbrowsing11","files":7,"time":1331065247,"description":"-- Buy the game if you can! At http://kerbalspaceprogram.com/kspstore/ --\n\nThis game is under heavy development. Also due to the fact they can not keep their servers up for more than 5 seconds, this is here. The updater WILL NOT WORK if you have not actually bought the game but you are free to delete it. Nothing bad will happen if you do.\n\nKerbal Space Program is a game focusing on making your own space program. Yes, that's it. But it does not end there, oh no; even though there are currently only three engines (more can be added with mods) it's the almost endless combinations possible that makes this so enjoyable to play. You see, much like real space rockets this game features multistage rockets that you design and create. Setting up these multistages is easy, though it can become rather complicated when your rocket has a gazillion stages.\n There is no real goal. You might want to achieve a stable orbit around the planet or just reach for the stars. You can also satisfy your competetive side of yourself and challenge your friends to a game of &quot;who-can-reach-the-highest-altitude&quot; or &quot;can-you-get-to-the-moon-and-back-safely?&quot;.\n And have you ever wanted to prove to NASA how lousy their space rockets are? This is the time to prove to them how wrong they are in their designs!\n\n","torrent":{"xt":"urn:btih:c80c66f298d48b0d91b9a1f238874416670b8bae","amp;dn":"KSP+Kerbal+Space+Program+0.14","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c80c66f298d48b0d91b9a1f238874416670b8bae","infoHashBuffer":{"type":"Buffer","data":[200,12,102,242,152,212,139,13,145,185,161,242,56,135,68,22,103,11,139,174]},"announce":[],"urlList":[]}}