{"title":"Jonathan Kellerman 7 Boeken (E-Books)NLT-Release","uid":7017731,"size":3909647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c872f96e3d9adeb6f81d6d5c097a3d04d2b3e9af&amp;dn=Jonathan+Kellerman+7+Boeken+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1328720675,"description":"Jonathan Kellerman 7 Boeken (E-Books)NLT-Release\n\n\n\nBiografie\n\nJonathan Kellerman (New York, 9 augustus 1949) is afgestudeerd kinderpsycholoog, gespecialiseerd in traumabehandeling bij kinderen die het slachtoffer zijn geworden van een zwaar misdrijf of ongeluk.\n\nIn 1981 volgt Breekpunt, de eerste thriller, maar het duurt nog tot 1985 voor het boek wordt uitgegeven. Breekpunt wordt bekroond met de Edgar Allen Poe Award, de prijs voor de beste Amerikaanse misdaadroman. Jonathan besluit zijn bloeiende carriÃƒÂ¨re als kinderpsycholoog op te geven en zich volledig te richten op het schrijven van psychologische thrillers, waaronder diverse met de sympathieke psycholoog Alex Delaware in de hoofdrol. Naast thrillers heeft Jonathan Kellerman psychologieboeken, kinderboeken en non-fictieboeken over gewelddadige kinderen geschreven\n\n\nPrivelerares.\n\nBeschrijving\nElise Freeman wordt dood aangetroffen in haar bad. Op een dvd die in haar boekenkast wordt gevonden, beschuldigt ze drie mannen van ernstige mishandeling. Zij zijn net als Elise docenten op een van Los Angeles elitescholen. Voor het onderzoek probeert rechercheur Milo Sturgis door te dringen in deze school, maar de elite sluit de rijen, beducht voor een schandaal. Als er ÃƒÂ©ÃƒÂ©n moment is waarop Sturgis de kundigheid van zijn vriend, psycholoog Alex Delaware, kan gebruiken is het nu. Het slachtoffer zelf had veel te verbergen en er zijn verdachten te over. Wanneer Alex en Milo de druk op hen een minnaar, studenten, collegas opvoeren, blijkt er ÃƒÂ©ÃƒÂ©n bereid om nogmaals te doden\n\nEngel Des Doods\n\nBeschrijving\nEldon Mate 'hielp' zieke mensen zelfmoord plegen en zag zichzelf daarom als een weldoener. Nu is deze 'Engel des doods' vermoord. Alles wijst erop dat iemand het niet met zijn ideeÃƒÂ«n over barmhartigheid eens was.\nRechercheur Milo Sturgis wordt op de zaak gezet en roept de hulp in van psycholoog Alex Delaware. Alex worstelt echter met een gewetenskwestie, die hij moet oplossen voor hij weer met Milo kan samenwerken. Dit zorgt voor nog meer spanningen in het toch al zo ingewikkelde onderzoek.\nJonathan Kellerman, kinderpsycholoog in Los Angeles, weet als geen ander de duistere diepten van de menselijke geest bloot te leggen. Hij is een van de meest succesvolle auteurs van psychologische thrillers.\n\n\nBroedertwist.\n\nBeschrijving\nTegen wil en dank vormen de halfbroers Moe Reed en Aaron Fox een team om een vermiste studente op te sporen. De twee mannen verschillen als dag en nacht van elkaar. Moses is een jonge rechercheur bij het L.A. Police Departement en Aaron is een geslaagde privÃƒÂ©detective.\n\nWanneer Aaron ontdekt dat een beroemde acteur die bekendstaat om zijn drugsmisbruik iets te maken heeft met het vermiste meisje, lijkt er zicht op een doorbraak in de zaak. Hun onderzoek brengt ze in de verleidelijke wereld van glamour, geld en macht, waar rijke filmsterren het contact met de werkelijkheid verloren zijn.\n\n\nBoze Tongen.\n\nBeschrijving\nHoe kan een psychopaat die is opgesloten in een zogenaamd veilige inrichting voor moordenaars de gewelddadige dood van een aantal mensen in de buitenwereld voorspellen? Dat is de vraag die psycholoog Alex Delaware en rechereur Milo Sturgis bezighoudt. Het eerste slachtoffer is een derderangs acteur die dood in de kofferbak van een auto, keurig in tweeÃƒÂ«n gezaagd. Maanden later komt een psycholoog op een even gruwelijke wijze om het leven. Beide moorden zijn voorspeld door Ardis Peake, een psychiatrisch patiÃƒÂ«nt die al tientallen jaren achter slot en grendel zit. Niemand heeft ooit aandacht besteed aan zijn onsamenhangende uitspraken, maar nu zijn voorspellingen zijn uitgekomen, willen sommigen wel luisteren.\n\n\nHet scherpte van de Snede.\n\nMidden in de nacht krijgt de kinderpsycholoog Alex Delaware een verward telefoontje van zijn ex-patiÃƒÂ«nt Jamey Cadmus, een jongen met een beangstigend hoog I. Q. en een lange geschiedenis van emotionele problemen. Voordat Alex hem kan bereiken verdwijnt hij, om weer op te duiken op de plek van een gruwelijke moord. Is Jamey de moordenaar of is hij het slachtoffer van een nietsontziend complot?\n\n\nTijdbom.\n\nBeschrijving\nOp het speelplein van een school in CaliforniÃƒÂ« verstomt\nplotseling: er vallen schoten. Geen van de kinderen raakt gewond, maar de sluipschutter wordt neergeschoten door de lijfwacht van een politicus die een bezoek aan de school brengt, Rechercheur Milo Sturgis vraagt kinderpsycholoog Alex Delawarc de kinderen te helpen niet het verwerken van deze traumatische ervaring. delaware raakt meer en meer bij de zaak zijn ondderzoek wordt door en instanties bemoeilijkt. Hij probeert te peilen wat -voor komplot er zou kunnen schuilen achter de ogenschijnlijke kamikaze-actie een enkele labiele geest...\n\n\nDoodgezwegen.\n\nBeschrijving\nTijdens een party ontmoet kinderpsycholoog Alex Delaware zijn ex-vriendin Sharon Ransom die hem zes jaar geleden plotseling in de steek liet. Alex negeert Sharon, ondanks haar toespelingen dat ze hulp nodig heeft. De volgende dag is ze dood. Vol schuldgevoel start Alex een verbeten speurtocht naar haar verleden\n\n\nMet dank aan de originele uploader en scanner.\n\n\n\nHashcode:\nC872F96E3D9ADEB6F81D6D5C097A3D04D2B3E9AF\n\n\nVOOR DE NIEUWSTE FILMS, MUZIEK EN BOEKEN GA JE NAAR NLT-RELEASE;\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday\n\n","torrent":{"xt":"urn:btih:c872f96e3d9adeb6f81d6d5c097a3d04d2b3e9af","amp;dn":"Jonathan+Kellerman+7+Boeken+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c872f96e3d9adeb6f81d6d5c097a3d04d2b3e9af","infoHashBuffer":{"type":"Buffer","data":[200,114,249,110,61,154,222,182,248,29,109,92,9,122,61,4,210,179,233,175]},"announce":[],"urlList":[]}}