{"title":"Jimmy McGriff - At The Apollo - Jazz Organ","uid":11314946,"size":106076034,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c876da41b3d4a5544f10f78f5f3e273a96ac26fc&amp;dn=Jimmy+McGriff+-+At+The+Apollo+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1414541684,"description":"Jimmy McGriff - At The Apollo - Jazz Organ\n\nJimmy McGriff and company cook up some steaming blues grooves on this 1963 live date.\n\nTracklisting:\n01. There'll Never Be Another You (6:17)\n02. We Four (6:50)\n03. A Thing For Jug (5:45)\n04. Red Sails In The Sunset (4:40)\n05. Lonely Avenue (5:42)\n06. Frame For The Blues (5:47)\n07. Blip Time (Bonus Track) (3:21)\n08. One Of Mine (Bonus Track) (4:37)\n\nTotal Time: 43:01\n\n\nPersonnel:\n- Rudolph Johnson, sax \n- Jimmy McGriff, organ\n- Larry Frazier, guitar\n- Willie &quot;Saint&quot; Jenkins, drums\n\nRecorded live at the Apollo Theater, New York City, 1963.\n\nSue LP-1017\nCollectables COL-CD-5126 (CD)\n\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nReview by Jim Todd\nThere's no question; organist Jimmy McGriff and company cook up some steaming blues grooves on this live date. Beyond that, though, there is little that distinguishes this set from countless others in the same mold. McGriff and his band are a dynamo when they unite in churning, bluesy bluster. As individual players, however, no one here generates much in the way of a memorable performance. Next to the roar of the leader's Hammond, guitarist Larry Frazier's fills and rhythm work sound slight. He's better when he steps forward to solo in a frenetic Chicago blues style. Saxophonist Rudolph Johnson honks and barks with a spirited, but limited, vocabulary of licks. Drummer Willie Jenkins clatters away with vigorous abandon, but never at the expense of the groove. To McGriff's credit, he pulls these talents together so they total something more than the sum of the parts. The band shines brightest on the McGriff original &quot;We Four&quot; and &quot;Lonely Avenue.&quot; This is where Frazier, Johnson, and Jenkins most effectively combine forces with the leader's meat-and-potatoes music and groove-bound B-3 to do what they do best -- play the blues. Amen.\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ","torrent":{"xt":"urn:btih:c876da41b3d4a5544f10f78f5f3e273a96ac26fc","amp;dn":"Jimmy+McGriff+-+At+The+Apollo+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c876da41b3d4a5544f10f78f5f3e273a96ac26fc","infoHashBuffer":{"type":"Buffer","data":[200,118,218,65,179,212,165,84,79,16,247,143,95,62,39,58,150,172,38,252]},"announce":[],"urlList":[]}}