{"title":"The Berlin Defence (Igor Lysyj &amp; Roman Ovetchkin)","uid":8791037,"size":4739786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8808ca2156d2f34812daafdbe313f844f4f05cd&amp;dn=The+Berlin+Defence+%28Igor+Lysyj+%26amp%3B+Roman+Ovetchkin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1375947240,"description":"From the Preface by Igor Lysyi: &quot;I worked hard at mastering 1...e7-e5 for Black and the results were very fruitful in the 2011 World Cup, where I had no problems at all after 1.e2-e4. I was especially happy with the outcome of the opening battle against the outstanding theoretician M. Kobalia. In fact, in one of the main tabias of the anti-Berlin system I found an order of moves which I believe to be among my best analytical achievements.\n\nIn this book Roman Ovetchkin and I have decided to illustrate the theoretical section with model games and thorough analysis of these will undoubtedly help the reader to gain a better grasp of the finer points of this system and orientate himself among the enormous amount of information available.&quot;\n\n\n-- About the authors --\n\nRoman Ovetchkin is an international grandmaster and an experienced coach and trainer. He was part of the team which enabled Ekaterina Kovalevska to become a vice-champion of the world in 2004. In 2007 he coached the &quot;ABC&quot; team and they shared 1st-2nd place in the European Cup for women. He was the winner of numerous international chess competitions. \n\nIgor Lysyi is an international grandmaster. He won many times the students' championships and the Russia Universiades, both as an individual and as a member of the team of the Ural University. He participated in the team of Russia which won the World Students' Championship in 2008. He was the winner of numerous international chess tournaments.","torrent":{"xt":"urn:btih:c8808ca2156d2f34812daafdbe313f844f4f05cd","amp;dn":"The+Berlin+Defence+%28Igor+Lysyj+%26amp%3B+Roman+Ovetchkin%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8808ca2156d2f34812daafdbe313f844f4f05cd","infoHashBuffer":{"type":"Buffer","data":[200,128,140,162,21,109,47,52,129,45,170,253,190,49,63,132,79,79,5,205]},"announce":[],"urlList":[]}}