{"title":"The Beast Stalker (2008) DVDr-sailo1","uid":4670983,"size":4629694464,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c9686359126a0d2a2cd52b9b6c1685c974deb2ee&amp;dn=The+Beast+Stalker+%282008%29+DVDr-sailo1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"fed_cri","files":-1,"time":1232733295,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1330525/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1330525/&lt;/a&gt;\n\nTrailer:  &lt;a href=&quot;\nhttp://thebeaststalker.emp.hk/en_main.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thebeaststalker.emp.hk/en_main.html&lt;/a&gt;\n\nBeast Cops director Dante Lam returns to his best genre with the 2008 crime thriller The Beast Stalker. Playing cop again after Invisible Target, Nicholas Tse faces off against Nick Cheung (Connected) whose turn as a relentless kidnapper earned him the 2008 Hong Kong Film Critics Society Best Actor Award. Featuring action direction by Stephen Tung Wai (Painted Skin, Purple Storm), this gritty, tightly knit thriller loads in the high-speed car chases and intense action scenes amid the fatalistic cycle of crime, coincidence, and consequence that ties the story's perpetrators and victims together. Zhang Jingchu (Protege) co-stars as the kidnap victim's mother, along with character actor Liu Kai Chi, television star Derek Kwok, and Nick Cheung's real-life wife, television actress Esther Kwan, who does the Cantonese dubbing for his onscreen wife Miao Pu. Screened at the 59th Berlin Film Festival, The Beast Stalker has turned into a hit both at the box office and with critics. Sergeant Tong (Nicholas Tse) allows no room for error or weakness when it comes to crimefighting, until he himself commits a mistake he can never forgive. His dogged pursuit of a robbery getaway car escalates into a dangerous pile-up and shoot-out, and the accidental death of a little girl. Months later, Tong is still haunted by the girl's death, comforted only by his friendship with the victim's twin sister Ling (Wong Suet Yin). In a twisted coincidence, Cheung (Philip Keung), the mastermind behind the robbery, is facing trial, and the prosecutor is none other than Ling's mother, Ann Gao (Zhang Jingchu). Tragedy repeats itself when Cheung hires Hung (Nick Cheung) to kidnap Ling and blackmail Ann. Witnessing the kidnapping, Tong sets out in a desperate race against time and tide to save Ling.\n\nLanguage: Mandarin, Cantonese DD5.1\nSubtitles: English, Traditional Chinese, Simplified Chinese\nPicture Format: NTSC\nAspect Ratio: 1.78 : 1\nWidescreen Anamorphic: Yes\n","torrent":{"xt":"urn:btih:c9686359126a0d2a2cd52b9b6c1685c974deb2ee","amp;dn":"The+Beast+Stalker+%282008%29+DVDr-sailo1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9686359126a0d2a2cd52b9b6c1685c974deb2ee","infoHashBuffer":{"type":"Buffer","data":[201,104,99,89,18,106,13,42,44,213,43,155,108,22,133,201,116,222,178,238]},"announce":[],"urlList":[]}}