{"title":"David Sloan Wilson - Darwin's Cathedral_Evolution, Religion, and","uid":11518463,"size":1154324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9c4f1de5b75a07ba0b89e3f658c8d79297fb9e8&amp;dn=David+Sloan+Wilson+-+Darwin%27s+Cathedral_Evolution%2C+Religion%2C+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Papushi","files":-1,"time":1416463857,"description":"One of the great intellectual battles of modern times is between evolution and religion. Until now, they have been considered completely irreconcilable theories of origin and existence. David Sloan Wilson's Darwin's Cathedral takes the radical step of joining the two, in the process proposing an evolutionary theory of religion that shakes both evolutionary biology and social theory at their foundations.\n\nThe key, argues Wilson, is to think of society as an organism, an old idea that has received new life based on recent developments in evolutionary biology. If society is an organism, can we then think of morality and religion as biologically and culturally evolved adaptations that enable human groups to function as single units rather than mere collections of individuals? Wilson brings a variety of evidence to bear on this question, from both the biological and social sciences. From Calvinism in sixteenth-century Geneva to Balinese water temples, from hunter-gatherer societies to urban America, Wilson demonstrates how religions have enabled people to achieve by collective action what they never could do alone. He also includes a chapter considering forgiveness from an evolutionary perspective and concludes by discussing how all social organizations, including science, could benefit by incorporating elements of religion.\n\nReligious believers often compare their communities to single organisms and even to insect colonies. Astoundingly, Wilson shows that they might be literally correct. Intended for any educated reader, Darwin's Cathedral will change forever the way we view the relations among evolution, religion, and human society","torrent":{"xt":"urn:btih:c9c4f1de5b75a07ba0b89e3f658c8d79297fb9e8","amp;dn":"David+Sloan+Wilson+-+Darwin%27s+Cathedral_Evolution%2C+Religion%2C+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c4f1de5b75a07ba0b89e3f658c8d79297fb9e8","infoHashBuffer":{"type":"Buffer","data":[201,196,241,222,91,117,160,123,160,184,158,63,101,140,141,121,41,127,185,232]},"announce":[],"urlList":[]}}