{"title":"A Year with Aslan - C. S. Lewis.epub","uid":9430277,"size":1339925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9df74de87d58a3d78a93f07750c6d2fbb40719c&amp;dn=A+Year+with+Aslan+-+C.+S.+Lewis.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1388784260,"description":"For more than fifty years, the world C. S. Lewis created in Narnia has captured our hearts and imaginations. Both children and adults have discovered that rereading the books leads to entirely new experiences and insights. In the midst of these breathtaking stories of adventure, betrayal, and discovery in a magical land are profound messages about the true meaning of life. Whether it is Eustace struggling with his dragon skin, Digory debating obedience to Aslan versus saving his mother, or Edmund facing his shame after his rescue from the White Witch, the questions and dilemmas facing the characters are surprisingly relevant to us today. By pondering the world of Narnia, we better understand our own.\n\nIn the first book of its kind, A Year with Aslan offers 365 of the most thought-provoking passages from all seven books, paired with reflective questions that get at the heart of what matters most. An unprecedented way to experience the magic of Narnia every day of the year, A Year with Aslan allows us all to go &quot;Further up and further in!&quot;","torrent":{"xt":"urn:btih:c9df74de87d58a3d78a93f07750c6d2fbb40719c","amp;dn":"A+Year+with+Aslan+-+C.+S.+Lewis.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9df74de87d58a3d78a93f07750c6d2fbb40719c","infoHashBuffer":{"type":"Buffer","data":[201,223,116,222,135,213,138,61,120,169,63,7,117,12,109,47,187,64,113,156]},"announce":[],"urlList":[]}}