{"title":"The End of the Spear [2005][XviD] EngSub [Verifire]","uid":6770177,"size":744546304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ca5d63056c2c108b03778dcff5fd5fc4807dde20&amp;dn=The+End+of+the+Spear+%5B2005%5D%5BXviD%5D+EngSub+%5BVerifire%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1319503798,"description":"Hi there..\n\nI uploaded this as a Nordic DVD-ISO a while back, but English speaking viewers and those who are hearing impaired will not really have gotten everything out of this movie since quite a big part of the dialog is in a Amazon tribe's tongue..\n\nSo I searched, and found this somewhere a while back, recoded it to narrow the size [great quality though.. ;-) ], and hereby upload it.\n\n---------\n\nI found this review on IMDb and let it speak for the upload:\n\n&quot;[b]A wonderful movie for your eyes and your heart[/b].\n(Author: Philip Lindquist from United States)\n\nEnd of the Spear is a beautifully crafted movie about one of the great missionary stories of the 20th century, but it is not a preachy kind of movie.\n\nThe story is simply told and allowed to stand on its own. The story is one of those that would not be believable on the big screen if it were not true in all of its essential points. The beautiful jungle scenery (the movie was shot in Panama) is well worth the price of the ticket. But the story will make you think about how self-giving love is more powerful than violence. \n\nThe story also shows that extraordinary risks taken for peace can pay dividends beyond imagination. \n\nThis will be a movie that people will be talking about, and watching again and again, far into the future..\n\n..You'll also wonder why an independent film company can make such a wonderful movie when Hollywood is making bad movies based on old TV shows. &quot;\n\nSo there you go. Hope you like it.\n\nV.\n-------------\nE-mail: verifiremail@gmail\n\n&quot;Personally I've found the hope of deliverance and enlightenment through Yeshua Ha'Mashiach to be the greatest mystery and riddle, shrouded in the shadows of shame, but revealed to those who seek the Truth, no matter the cost.&quot;","torrent":{"xt":"urn:btih:ca5d63056c2c108b03778dcff5fd5fc4807dde20","amp;dn":"The+End+of+the+Spear+%5B2005%5D%5BXviD%5D+EngSub+%5BVerifire%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca5d63056c2c108b03778dcff5fd5fc4807dde20","infoHashBuffer":{"type":"Buffer","data":[202,93,99,5,108,44,16,139,3,119,141,207,245,253,95,196,128,125,222,32]},"announce":[],"urlList":[]}}