{"title":"Topgrl--I Choose You Part Two  Hazel Hypnotic","uid":10384385,"size":3899100400,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ca85627f4c316b6b43768658e8264fba30900878&amp;dn=Topgrl--I+Choose+You+Part+Two++Hazel+Hypnotic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1403119780,"description":"\nI Choose You Part Two | Hazel Hypnotic \n\nJune 16, 2014\n\n\niPod, Low and High MP4.\n\n\nI am in the mood to dig deeper...\n\nHazel is a very reserved girl. She doesn't talk much, she doesn't anger quickly, she doesn't express herself often... unless she is in bondage. It is then, when Hazel can let go. Relax. Express herself a bit. \n\nBut I am interested in finding out more than she is probably wanting to give. I like intimacy. Closeness. I like seeing others vulnerable and transparent in nature.\n\nHazel's pussy is first up for further contemplation. For that to happen, Hazel sits, highly exposed, stopped to a wooden &quot;chair.&quot; Both she and I know that her pussy is on display. As with any exploration, I begin from the outside and work my way in. Blood is forced to her cunt as her lips are sucked into a pussy pump. It's fun to watch her pussy expand and fill the cup. Hazel squeals. I smile. After some time, Hazel's labia lips are grabbed with clover clamps and stretched wide to allow for deeper contemplation. Eventually, though, I must enter her. As that is the only true way to understand another human. To become one with them. I ask her if she trusts me, which she answers affirmatively. This is important, as what I am doing requires a connection between her body and mind. I must have Hazel accept me for the full connection to be complete - Hazel and I are united as one inside her cunt with my entire fist. \n\nExamining one's body is only the beginning. The mind is much more interesting to me. Exploring someone's mind is possible in a variety of ways, but on this day, I am interested in using fear as a means of uncovering the truth. For, through fear, one can get to the core. With the aide of a gas mask and rebreathing bag, I set out to see what Hazel is made of. How much control does she actually have over herself? Can she control her breathing enough to stay in the mask - or does she suck all the oxygen out of her allotted air supply like the greedy bondage slut that she is? What happens when Hazel's pussy is introduced to an electrified vibrator? I doubt you've ever heard an ear-piercing scream quite like the one Hazel makes in response to this toy. Watch as Hazel become increasingly stressed by her conditions.\n\nWhat is Hazel made of? You be the judge. \n \nScreens &lt;a href=&quot;\nhttp://topgrl.com/female/bondage/2014/06_16hhypnotic2/TopGrl-Hazel-Hypnotic-I-Choose-You-Part-Two.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://topgrl.com/female/bondage/2014/06_16hhypnotic2/TopGrl-Hazel-Hypnotic-I-Choose-You-Part-Two.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:ca85627f4c316b6b43768658e8264fba30900878","amp;dn":"Topgrl--I+Choose+You+Part+Two++Hazel+Hypnotic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca85627f4c316b6b43768658e8264fba30900878","infoHashBuffer":{"type":"Buffer","data":[202,133,98,127,76,49,107,107,67,118,134,88,232,38,79,186,48,144,8,120]},"announce":[],"urlList":[]}}