{"title":"The Prodigal Son (1934) Depression America Luis Trenker","uid":8878080,"size":1249323882,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cad3a6c2b2173c349d7f9d9ac66eaa4333f1aeb0&amp;dn=The+Prodigal+Son+%281934%29+Depression+America+Luis+Trenker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tzuhalem","files":1,"time":1378259692,"description":"I had a great response to The Emperor of California, so here is another Luis Trenker American classic. This one starts in an alpine village, where the woodcutter Tonio is bored of the humdrum life and dreams of going to America. There's an amusing scene where he looks at a globe, and a friend says &quot;see how much space there is in Canada&quot;! But Tonio is a cad who prefers the fleshpots of New York. One day he is seemingly whisked there, then he has to endure eviction, unemployment, park bench sleeping, stealing food etc. There are some great shots of him staring hungrily through restaurant windows - worth the price of admission. Suddenly he is whisked back to Bavaria, in time to celebrate carnival in the comfort of his village.\n\nThe village and alpine scenes are merely generic, Fanck and Riefenstahl did this sort of thing much better. The New York scenes are very moving, on the same level as City Lights (1931). There's a wonderful shot where the rocky alpine pinnacles fade into the skyscrapers of Manhattan.\n\nNo subtitles, but almost half the movie is in English. Reseeded from somewhere or other. There is some pixellation blurring, but it's quite tolerable.","torrent":{"xt":"urn:btih:cad3a6c2b2173c349d7f9d9ac66eaa4333f1aeb0","amp;dn":"The+Prodigal+Son+%281934%29+Depression+America+Luis+Trenker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cad3a6c2b2173c349d7f9d9ac66eaa4333f1aeb0","infoHashBuffer":{"type":"Buffer","data":[202,211,166,194,178,23,60,52,157,127,157,154,198,110,170,67,51,241,174,176]},"announce":[],"urlList":[]}}