{"title":"Neal Boortz - 2007 - Somebody's Gotta Say It - 64kbps","uid":9593345,"size":217734766,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cd019e7e3ae6814ecfbcee5bc684fea00665ad3b&amp;dn=Neal+Boortz+-+2007+-+Somebody%27s+Gotta+Say+It+-+64kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WillKane","files":47,"time":1391958813,"description":"Somebody s Gotta Say It\nNeal Boortz\n06:01:19\n64kbps\nFebruary 20 2007\n\nIve come to the conclusion that roughly 50 percent of the adults in this country are simply too ignorant and functionally incompetent to be living in a free society.\n\nYou might think Im off base, but every day around half the people in this country go out of their way to prove me right. --from Somebodys Gotta Say It\n\nThink youve got it all figured out? Think again.\n\nNeal Boortz--the Talkmaster, the High Priest of the Church of the Painful Truth--has been edifying, infuriating, and entertaining talk radio audiences for more than three decades with his blend of straight talk and twisted humor. Now, the author of the smash number one bestseller The FairTax Book returns to gore every sacred cow in the pasture, from the subversive agendas behind childrens books to the scam artists behind High Art.\n\nIn Somebodys Gotta Say It, Boortz warms up for the coming political season with a preemptive strike in the War on the Individual: The Democrats theme for 2008 will be The Common Good. I cant speak for you, but I am an individual. Government exists to protect my rights, not to order my life. And I damn sure dont exist to serve government. He takes on liberal catchphrases like giving back (Nobody--especially not the evil, wretched rich--actually earns anything anymore. Why do liberals think this way? Because they find it impossible to acknowledge that people work for money), our rampant civic idiocy (We are not a democracy. Never were. Werent supposed to be. And we shouldnt be), and Big Brother (We have smoke-free workplaces. We have drug-free school zones. I say lets start establishing government-free oases, where we can be free to leave our seat belts unbuckled, and peel the labels off anything we choose). And somehow, along the way, he finds room for pop quizzes, cat-chasing contests, and an answer, once and for all, to the eternal question, Neal, why dont you run for president?--in a chapter called No Way in Hell.\n\nFull of irresistible wisecracks and irrefutable libertarian wisdom, Somebodys Gotta Say It is one mans response to America at a time when the government overreaches, the people underperform--and the truth hurts.","torrent":{"xt":"urn:btih:cd019e7e3ae6814ecfbcee5bc684fea00665ad3b","amp;dn":"Neal+Boortz+-+2007+-+Somebody%27s+Gotta+Say+It+-+64kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd019e7e3ae6814ecfbcee5bc684fea00665ad3b","infoHashBuffer":{"type":"Buffer","data":[205,1,158,126,58,230,129,78,207,188,238,91,198,132,254,160,6,101,173,59]},"announce":[],"urlList":[]}}