{"title":"Macross Uber Collection Complete - Jap with Eng Sub 50gb","uid":5809156,"size":54280140497,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd2da2e2983e45a8307289dd9dd4f0c47d390e1a&amp;dn=Macross+Uber+Collection+Complete+-+Jap+with+Eng+Sub+50gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"XenoJoker","files":143,"time":1283554929,"description":"OK got tired of tracking down all the Macross Movies and OVAs so made this large collection to make your life easy - but its a large download (i know!)\nMade this torrent after weeks of searching the net and compiling the best available (English sub/audio version) downloads for all the macross anime.\nFiles are avi/divx/xvid as far as i recall with mkv containers in most cases. Use K-Lite standard codec pack 630 or later to play all of these with no problem.\n\nNote: There is another large Macross collection torrent out there made about 3 years ago (~ 2007) which did not have Macross Frontier.\nSome of the comparable files were also of lower quality probably to save the file size.\n\nIn (release order) the collection has: (* denotes Jap with Eng subs / ^ denotes 640x480 res)\n\nNone of the robotech junk which was hashed together from Macross and other anime by US broadcasters.\nNone of the movies or episodes are split across multiple files, each is contained in a single file\n\nThe Super Dimension Fortress Macross - full series*^\nThe Super Dimension Fortress Macross: Do You Remeber Love - movie*^\nThe Super Dimension Fortress Macross: Flash Back 2012*^\nMacross Plus - OVA full*^\nMacross Plus - Movie Internationa Version* 1440x1080\nMacrossII Lovers Again - Probably the movie version, but it has all 6 OVAs stiched together with English audio - i checked with alternate downloads^\nMacrossII creditless opening and ending^\nMacross 7 - OVA full*^\nMacross 7 The Galaxy Is Calling Me - Movie*^\nMacross 7 Encore - All three episodes correctly numbered*^\nMacross Dynamite 7 - OVA full*^\nMacross 7 Special - 1 short*^\nMacros Zero - OVA full* 1280x720\nMacross Frontier - full series* 1280x720\n\nNOT INCLUDED (as there are no decent rips or yet to be released):\n\nMacross Frontier The Movie: The False Diva\nMacross Frontier Movie: The Wings of Goodbye\n\nCollection compiled September 2010\n\nFor more information on the collection, download and run the torrent and select only the &quot;Collection Index.txt&quot; file.\nIf you download the full torrent, the folder numbering system reflects the chronological release order.\n\nCompiled by a macross fan for all macross fans\n\nAcknowledgment: \nThanks to all the individual Macross fans out there who made the actual original rips\nThanks to all the individuals who have made torrents and shared the rips\nAND most of all thanks to all those individuals who have made the english subs","torrent":{"xt":"urn:btih:cd2da2e2983e45a8307289dd9dd4f0c47d390e1a","amp;dn":"Macross+Uber+Collection+Complete+-+Jap+with+Eng+Sub+50gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd2da2e2983e45a8307289dd9dd4f0c47d390e1a","infoHashBuffer":{"type":"Buffer","data":[205,45,162,226,152,62,69,168,48,114,137,221,157,212,240,196,125,57,14,26]},"announce":[],"urlList":[]}}