{"title":"The Church - Under The Milky Way (2nafish)","uid":5925632,"size":185456644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cddbdb858dd01714ace03a075df0dd8bfe8cec5e&amp;dn=The+Church+-+Under+The+Milky+Way+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1288595824,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Under the Milky Way&quot; is a single by Australian alternative rock band The Church released in February 1988 with their album, Starfish. The song was written by bass guitarist and vocalist Steve Kilbey and his then girlfriend, Karin Jansson (ex-Pink Champagne). It charted in the Top 30 on the Australian Singles Chart and US Billboard Hot 100 and won an ARIA Award in 1989 for 'Single of the Year'.\n\n&quot;Under the Milky Way&quot; was written by the band's vocalist and bassist, Steve Kilbey, and his then-girlfriend Karin Jansson. The song was originally released on The Church's Starfish album and won the Australian ARIA award for 'Single of the Year' in 1989. It was the band's only international hit, staying in the U.S. top 40 for several weeks, and charting in Canada (#69) and the UK (#90). In Australia, &quot;Under The Milky Way&quot; peaked at #22 - however, it was not their biggest homeland hit; the singles &quot;Almost With You&quot; and &quot;Metropolis&quot; charted at #21 and #19 respectively in the Australian charts.\n\nI just stumbled upon it and for some reason it has struck this wonderful sense of universality with people that most of my songs don't&quot;\nSteve Kilbey\n\n&quot;Under the Milky Way&quot; featured a 12-string acoustic guitar melody along with a solo composed with an EBow on a Fender Jazzmaster. According to a press release issued with Starfish, the song was written about an Amsterdam music and cultural venue called Melkweg (Dutch for &quot;Milky Way&quot;), which Kilbey used to frequent.\n\nThe single was released in several configurations worldwide (7&quot;, double 7&quot;, 12&quot;, CD single), with at least five different cover art designs. The main B-sides were &quot;Musk&quot; and &quot;Warm Spell&quot;. Spanish versions added &quot;Anna Miranda&quot; and &quot;Perfect Child&quot;. The music video for the song featured on The Church's video compilation Goldfish (Jokes, Magic &amp; Souvenirs).\n\nIn 2001, the song was featured in the soundtrack for the movie Donnie Darko. In 2006, the song was performed with Melbourne Symphony Orchestra at the opening ceremony of the 2006 Commonwealth Games in Melbourne. Lead singer Steve Kilbey said after the performance that it was as if the song was made for the occasion, though in his blog he was critical of the Commonwealth Games as an event. In September 2008, readers of The Weekend Australian Magazine voted it as the best Australian song of the last 20 years. Sheet music for &quot;Under The Milky Way&quot; was published by Hal Leonard.\n\nThe breakthrough 1988 album by The Church, Starfish has remained the band's most commercially successful release. The first single, &quot;Under The Milky Way&quot;, charted well into the American Top 40, peaking at #24 and #2 on Mainstream Rock Tracks leading to significant exposure of the then relatively underground Australian act.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:cddbdb858dd01714ace03a075df0dd8bfe8cec5e","amp;dn":"The+Church+-+Under+The+Milky+Way+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cddbdb858dd01714ace03a075df0dd8bfe8cec5e","infoHashBuffer":{"type":"Buffer","data":[205,219,219,133,141,208,23,20,172,224,58,7,93,240,221,139,254,140,236,94]},"announce":[],"urlList":[]}}