{"title":"One.Way.Astronaut.1080p.WEBRiP.MP4-ANON","uid":8780290,"size":1384316806,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:ce3214e6130a2175d0e463560383274d4ed64a81&amp;dn=One.Way.Astronaut.1080p.WEBRiP.MP4-ANON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zdubinit","files":1,"time":1375694678,"description":"One Way Astronaut is an independent documentary surrounding people who have signed up to leave Earth to be the first human settlers on the planet Mars. It follows aspiring astronauts Stephan, Sara, Henri and Beatriz who, like tens of thousands of applicants to the Mars One project from around the world, say they are willing to spend the rest of their lives on the red planet. It is the story of Mars One and its founder Bas Lansdorp in the project's early stages. Space experts answer questions about the likelihood of Mars One succeeding and discuss the kind of risks the astronauts will be facing. Worldwide interest in the Mars One mission is a tell-tale of our society today and its hopes for itself.\n\nHalf of the proceeds generated from this documentary will be donated to the Mars One Foundation.\nTetteroo Media\n\nOne Way Astronaut is a film-project by Tetteroo Media. Tetteroo Media regards the Mars One project as a groundbreaking concept of high journalistic value. We thank all the aspiring astronauts who feature in the film, as well as Mars One and the scientists that comment on the idea in the documentary.\nwww.tetteroo.tv\nMars One\n\nThe Mars One Foundation is a not-for-profit organisation that will establish a permanent human settlement on Mars in 2023. The first footprint on Mars will fascinate and inspire generations; it is this public interest that will help finance this human mission to Mars.\nJoin our global effort by sharing our vision with your friends, supporting us and perhaps becoming a Mars astronaut yourself.\nwww.mars-one.com\n\n\n\n\nSupport these guys by donating!!\n &lt;a href=&quot;\nhttp://www.onewayastronaut.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.onewayastronaut.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:ce3214e6130a2175d0e463560383274d4ed64a81","amp;dn":"One.Way.Astronaut.1080p.WEBRiP.MP4-ANON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce3214e6130a2175d0e463560383274d4ed64a81","infoHashBuffer":{"type":"Buffer","data":[206,50,20,230,19,10,33,117,208,228,99,86,3,131,39,77,78,214,74,129]},"announce":[],"urlList":[]}}