{"title":"NubileFilms - Paula (My Love) NEW 27-December-2015","uid":13106949,"size":156931433,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ceb47cd8f7049fa1f99b6a814468ee10511047e7&amp;dn=NubileFilms+-+Paula+%28My+Love%29+NEW+27-December-2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SudoSu","files":1,"time":1451323195,"description":"\nhttp://youpornbook.com\r\n\r\n.......................\r\nScreenshots : \nhttp://imgpremium.com/album/eT\r\n\r\nThe name of the actress: Paula\r\nName movie: My Love\r\nNPP site and the site: NubileFilms.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Big Boobs, Shaved Pussy, Brunette, Long hair, Panties, Hardcore, Outdoors, High Heels, Girl-Boy, Blowjob, European, Girls Finishing the Job, Pussy Licking\r\nDuration: 00:16:30\r\n\r\nPaula knows she's looking hot as she struts her stuff on a windy day. When Dan comes to greet her, the wind has given him a tantalizing view of her ass and panties beneath her miniskirt. Ever the gentleman, Dan offers Paula his jacket for the walk home so that no one else can enjoy the goods that are exclusively his.\r\n\r\nThe second they get in the house, their lips are locked as they make their way towards the bed. Dan helps Paula with the zip on her dress, making it easy to slide the loose material off of her slender body so that he can worship her curves properly. When Dan gets down on his belly and buries his face in Paula's smooth pussy, her moans of pleasure are long and unashamed at the magic he is working with his tongue.\r\n\r\nAfter enjoying his pussy feast for a few minutes, Dan takes things a step further by pressing first one finger and then two into Paula's needy twat. The couple gets flexible when Paula rolls onto her shoulders with her ass held in the air for Dan's pleasure. He continues his leisurely exploration of her creamy twat with his tongue, hitting all the right spots to drive her to the brink of sensual madness and then push her over the edge.\r\n\r\nWhile her body is still throbbing with pleasure at the climax that Dan has just brought her, Paula get son her hands and knees and puts her mouth and soft hands to work sucking and caressing Dan's dick. His thick stiffie is a real treat for Paula, but she would much rather feel his cock buried in another hole. Climbing on top of Dan, Paula holds him in place so that she can slide down on his cock and then give him a cowgirl style ride that starts off slow and gradually speeds up so that Dan can enjoy the view of Paula's generous breasts bouncing.\r\n\r\nLaying down on her back on the bed, Paula spreads her legs so that Dan can continue the pussy party. He takes the invitation gladly, pushing himself deep into her greedy twat and using fast shallow strokes to ignite her passion. When she is all wound up, Paula gets on her hands and knees so that Dan can take her from behind in just the way she craves to bring her to a screaming climax.\r\n\r\nNow that Paula has enjoyed herself thoroughly, she is ready to return the favor for Dan. She settles in to use her magical mouth to bring him off. Dan is not quite finished, yet, and he pulls Paula into a 69 so that he can enjoy the honeyed sweetness of her pussy juices as she works his cock until he shoots his load into Paula's smiling mouth.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 640x360 25fps 1166kbps\r\nAudio: AAC 44100Hz stereo 95kbps","torrent":{"xt":"urn:btih:ceb47cd8f7049fa1f99b6a814468ee10511047e7","amp;dn":"NubileFilms+-+Paula+%28My+Love%29+NEW+27-December-2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb47cd8f7049fa1f99b6a814468ee10511047e7","infoHashBuffer":{"type":"Buffer","data":[206,180,124,216,247,4,159,161,249,155,106,129,68,104,238,16,81,16,71,231]},"announce":[],"urlList":[]}}