{"title":"The SilverBullet v2.0.03 full","uid":13362436,"size":873067135,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:cf6713ba8c3e846f1c494d4329b32d1c91958fc2&amp;dn=The+SilverBullet+v2.0.03+full&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1454139766,"description":"Behold, gamers! The game you've always wanted is here! \r\n\r\n\r\nKali, the legendary &quot;Goddess of Death&quot; in the South America Revolution. She wield two pistols that carve silver on bullets became a secret agent who hunts down demons. She joined Neverlight, the counter-demon organization, after some kind of incident. Kali was investigating a strange case occurred in the Axis-21 Marine Research Plant when she discovers the large and shadowy conspiracy of failed Project Prometheus. Infiltrate the military research lab conspiring with the devil and hunt down the demons!\r\n\r\n- Perfect console-style stealth action game.\r\n- Console-style Hardcore Action\r\n- No gacha\r\n- No in-app purchases\r\n- No advertisements\r\n- No push notifications\r\n- No recommended friend requests\r\n* GameController Supported\r\n\r\n1. Advanced console-style stealth action game\r\nThis game is never easy. By the standards of 2015 games, this is definitely a difficult one. You actually need to put forth an effort and practice to clear the game. This game doesn't give you many tips about game mechanics or skills. But you can overcome any difficulties through repeated attempts and practices.\r\n\r\n2. Free-style dual pistol control\r\nWhy do you use a single pistol when you can wield two? You can aim two targets at the same time and control each hand separately. Touch an enemy on the screen to manually lock on the target and aim, press the Target button to automatically lock on the target, or use the Target button like a pad to move the aiming point.\r\n\r\n3. 45 stages\r\nThere are 45 missions with various patterns. Each mission features a different structure, style and set of bosses. Find out how each mission is played out in the 45 stages of Prometheus.\r\n\r\n4. 19 bosses with various patterns\r\nPrometheus features 19 bosses. Each boss is visually stunning and spectacular, but the real heart of this game is in the ever changing gameplay pattern.\r\n\r\n5. Solid storyline\r\nThe past and present of Kali, the Goddess of Death. The relationship between shadowy organizations. And characters with various stories. Experience the whole new world of Byulbram Studio, the creator of Her Knights and Asura Cross.\r\n\r\n6. Cinematic stage with collapsing floors and changing structures\r\nThe stage setting changes and some parts collapse as you play the game. Experience the spectacle showdown with huge bosses and ever changing environment and the blockbuster animations with no limit.\r\n\r\n7. Automatically created Abyss Dungeon \r\nAbyss Dungeon is for users who want to enjoy the game more even after clearing the whole storyline. A new maze setting is automatically created each time. Prove your skill in Abyss where the difficulty is higher than the campaign mode.\r\n\r\n8. Over 90 achievements\r\nYou can clear this game in various ways. And there are many achievements that you can try. Find hidden achievements and complete them one by one.\r\n\r\nWhat’s new:\r\nMajor Update (version 2.0) !!\r\nNew Levels: Final Chapter Released (up to 46 stages)\r\nGame Controller support\r\nBug Fixes and Performance enhanced\r\n\r\nThis game use a Security module that it won't let you play as long as you have installed Hack and Root tools like Freedom, LuckyPatcher and SuperSU. Remove them as long as you want to play this game.\r\n\r\nUse lucky patcher before launching the game. Do a &quot;Patch to android&quot; task to unlock If your device is rooted. I haven't test on non rooted yet.\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequirements: Android O/S : 2.3+","torrent":{"xt":"urn:btih:cf6713ba8c3e846f1c494d4329b32d1c91958fc2","amp;dn":"The+SilverBullet+v2.0.03+full","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6713ba8c3e846f1c494d4329b32d1c91958fc2","infoHashBuffer":{"type":"Buffer","data":[207,103,19,186,140,62,132,111,28,73,77,67,41,179,45,28,145,149,143,194]},"announce":[],"urlList":[]}}