{"title":"Corbin Fisher - - - Straight Tag Team 2 ((MictrmbL))","uid":5440252,"size":190737334,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:cfa32b7f4e18fe5cd3a438075bdc3433f5fdcc5a&amp;dn=Corbin+Fisher+-+-+-+Straight+Tag+Team+2+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mictrmbl","files":60,"time":1268852540,"description":"From the vaults of Corbin Fisher:\n\n\nIt's been awhile - far too long, actually - since we've had Jude back here to shoot some stuff. I knew I wanted to film something special, and seeing as I'm constantly filming gorgeous young men having scorching hot sex, it can sometimes get tough trying to think of what could make things even hotter. Thankfully, my mind often defaults to Dirty Mode, and throwing a threesome together sounded like a perfect way to spice things up a bit and have some fun. You know me, however, and just a threesome wouldn't quite be enough.\n\nI figured getting Jude back here from his little hiatus and having 2 guys tag team him would be even better. So the calls were made and guys flown in and here ya go!\n\nFor not having taken it up the butt in awhile, Jude proved himself to be quite the trooper. Threeways are amazingly hard to coordinate and manage, especially when the bottom that's set to take on two cocks hasn't had his hole pierced in a long while. But I figured, &quot;What the hell!&quot; and figured I'd assemble a trio of guys, flip the cameras on, let em know that Jude was the designated bottom for the day, and let them have at it. Hope ya like!","torrent":{"xt":"urn:btih:cfa32b7f4e18fe5cd3a438075bdc3433f5fdcc5a","amp;dn":"Corbin+Fisher+-+-+-+Straight+Tag+Team+2+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfa32b7f4e18fe5cd3a438075bdc3433f5fdcc5a","infoHashBuffer":{"type":"Buffer","data":[207,163,43,127,78,24,254,92,211,164,56,7,91,220,52,51,245,253,204,90]},"announce":[],"urlList":[]}}