{"title":"Democracy Now - 08 feb 2012","uid":7017732,"size":456752233,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cfe1fb9f5d6e76068e7ada7ae47497a8614b1a06&amp;dn=Democracy+Now+-+08+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328720699,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 08, 2012\n\n- Santorum Campaign Rises With 3-State Victory\n- Court Overturns California Same-Sex Marriage Ban\n- Komen Exec Behind Planned Parenthood De-Funding Resigns\n- Drone Attack Kills 10 in Pakistan\n- U.S. May Cut Iraqi Embassy Staff By Half\n- CIA to Keep Massive Covert Presence in Iraq, Afghanistan\n- Syria: Dozens Killed as Homs Siege Continues\n- UNICEF: 400 Children Killed in Syria\n- Study: Homegrown Muslim Extremists Pose &quot;Miniscule Threat&quot;\n- South Carolina Sues Justice Dept. to Uphold Voter ID Law\n\n\nSpecial reports\n\n- Santorum Wins GOP Contests in 3 States As Evangelical Vote Surges and Pro-Romney Spending Dips\n\nFormer Pennsylvania Senator Rick Santorum has surged in the Republican presidential contest with wins in the Minnesota and Colorado caucuses, as well as a nonbinding primary in Missouri. Santorum's win appears to have been fueled by evangelical voters, emboldening his claim to be the &quot;true conservative&quot; in the Republican race. The contests in Minnesota, Colorado and Missouri notably differed from earlier states in the absence of a flood of spending backing front-runner Mitt Romney. We get reaction to Santorum's victories from Michael Brendan Dougherty of Business Insider and the American Conservative and Jon O'Brien of Catholics for Choice.\n\n\n- As Contraceptives Rule Enters GOP Race, Will Reproductive Rights Affect 2012 Election?\n\nRick Santorum's three-state victory comes after a week of heavy Republican campaigning against a new Obama administration rule requiring health insurance plans, including those provided by Catholic-affiliated hospitals and universities, to offer free birth control methods. Reproductive rights groups have hailed the measure, which was fueled by research showing birth control is necessary for women's health and well-being. The row over contraceptives comes as a top official at the breast cancer charity Komen has resigned after a controversial decision to defund Planned Parenthood backfires. We look at how reproductive rights could become major issues in the 2012 race with three guests: Michael Brendan Dougherty of Business Insider and the American Conservative; Loretta Ross of the SisterSong Reproductive Justice Collective; and Jon O'Brien of Catholics for Choice.\n\n\n- Ramarley Graham: NYPD Slays Unarmed Black Teen as Outrage Over Targeting of People of Color Grows\n\nThe New York City Police Department is under mounting criticism after police shoot dead an unarmed teenager inside his own home. Eighteen-year-old Ramarley Graham was shot at close range in his parents' apartment in the Bronx after being chased into the house by narcotics detectives. Police said they found marijuana in the home and think Graham may have been trying to flush some down the toilet. The NYPD is coming under criticism not only for shooting Graham, but also for its broader &quot;stop-and-frisk&quot; policy, which critics say disproportionately targets people of color. On Monday, about 500 protesters rallied in the Bronx to condemn the police treatment of black youth. We speak to Jamel Mims, an organizer with the Stop Mass Incarceration Network, which is working to end the practice of stop-and-frisk; and Nicholas Peart, who is serving as a witness in a federal class action lawsuit challenging &quot;stop-and frisk&quot; as racist and unconstitutional.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cfe1fb9f5d6e76068e7ada7ae47497a8614b1a06","amp;dn":"Democracy+Now+-+08+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfe1fb9f5d6e76068e7ada7ae47497a8614b1a06","infoHashBuffer":{"type":"Buffer","data":[207,225,251,159,93,110,118,6,142,122,218,122,228,116,151,168,97,75,26,6]},"announce":[],"urlList":[]}}