{"title":"A Primal Perspective on the Philosophy of Religion (2006) [PDF]","uid":10598143,"size":2745632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d02bda2fdd8d58dbe889c97d42bdb60e1d04f0ef&amp;dn=A+Primal+Perspective+on+the+Philosophy+of+Religion+%282006%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405882066,"description":"Title: A Primal Perspective on the Philosophy of Religion\nAuthor: Arvind Sharma\nCategory: Academic/Religion/Philosophy\nPublisher: Springer; 2006 edition (September 26, 2006)\nLanguage: English\nISBN-10: 1402050135\nISBN-13: 978-1402050138\n\nPromotional info/Publisher's summary - &quot;Philosophy of religion as a discipline first arose in Europe; its subject matter has been profoundly influenced by the practices of European Christianity. While Eastern and Western religions subsequently found a place in these studies, one global religious tradition, namely, the primal tradition, remains unrepresented in its discussions. This book examines the significantly different perspectives offered by primal religions on virtually every theme discussed in the philosophy of religion.&quot;\n\nReviews:\n&quot;Despite the absence of written texts, primal religions have an implicit philosophy. They can offer a fresh perspective on controversial philosophical issues. This study shows how materials of primal religious experience can be incorporated in the categories of modern philosophy of religion. Fourteen chapters offer examples varying from concepts of God and revelation to conflicating truth claims and the problem of human destiny. The book contends that the primal perspective can widen and deepen the horizons of philosophy of religion and enhance the philosophical appreciation of religion as a universal phenomenon.&quot; -Jacobus Waardenburg, University of Lausanne, Switzerland\n\n&quot;Arvind Sharma makes a perfect case for a cross-cultural philosophy of religion in which all world religions, especially primal religions, could effectively participate in the dialogue and conversation about the relevant issues in the quest for the transcendent and the sacred. The work ultimately may be a prolegomena to the study of philosophy of religion of many primal religious traditions, because it provokes debate and responses from scholars of these traditions. This book will certainly begin a broader conversation in the cross-cultural philosophy of religion.&quot; -Jacob Olupona, The University of California, Davis, U.S.A.\n\nThis torrent contains a fully indexed, browse-able and searchable copy of the book in PDF format. The front cover image is also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:d02bda2fdd8d58dbe889c97d42bdb60e1d04f0ef","amp;dn":"A+Primal+Perspective+on+the+Philosophy+of+Religion+%282006%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d02bda2fdd8d58dbe889c97d42bdb60e1d04f0ef","infoHashBuffer":{"type":"Buffer","data":[208,43,218,47,221,141,88,219,232,137,201,125,66,189,182,14,29,4,240,239]},"announce":[],"urlList":[]}}