{"title":"Napoleon Hill - The Law of Success in Sixteen Lessons","uid":5735686,"size":376782207,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d07bcce606bf2fb598eb42b50a86c9139b9b3a23&amp;dn=Napoleon+Hill+-+The+Law+of+Success+in+Sixteen+Lessons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fish78","files":5,"time":1280803034,"description":"Napoleon Hill's The Law of Success in Sixteen Lessons answers every question you could possibly have about what it takes to be successful.\n\nThe Law of Success in Sixteen Lessons has over 1,100 pages of success secrets from 500 of America's most successful people of all time. It took 20 years to write but you can start learning from it soon.\n\nCommissioned by Andrew Carnegie and given personal introductions to the likes of Henry Ford, Thomas Edison, John D. Rockefeller, Alexander Graham Bell and hundreds of others, Napoleon Hill's research and study of successful people made him the best-selling success author of all time.\n\nOf all of his works, none have ever matched his landmark The Law of Success in Sixteen Lessons. First published in 1928, these sixteen lessons became the world's first comprehensive philosophy of personal achievement.\n\nIn Napoleon Hill's own words: &quot;The purpose of the Law of Success course is to enable you to find out how you may become more capable in your chosen field of work. To this end you will be analyzed and all of your qualities classified so you may organize them and make the best possible use of them.&quot;\n\nEndorsed by two U.S. Presidents and countless leaders of business and industry, it's as powerful and effective today as it was 75 years ago. For dedicated students of success, there is no better primer. This is just the tiniest portion of what you'll learn from this remarkable &quot;Encyclopedia of Success&quot;:\n\nIpod Ready \nMPEG-4","torrent":{"xt":"urn:btih:d07bcce606bf2fb598eb42b50a86c9139b9b3a23","amp;dn":"Napoleon+Hill+-+The+Law+of+Success+in+Sixteen+Lessons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d07bcce606bf2fb598eb42b50a86c9139b9b3a23","infoHashBuffer":{"type":"Buffer","data":[208,123,204,230,6,191,47,181,152,235,66,181,10,134,201,19,155,155,58,35]},"announce":[],"urlList":[]}}