{"title":"SOE Agent: Churchill's Secret Warriors","uid":11697925,"size":31240472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d19c08f3d4fb3fab0925965d5c06b01f042814f0&amp;dn=SOE+Agent%3A+Churchill%27s+Secret+Warriors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1423800414,"description":"Osprey's study of Special Operations Executive (SOE) agents during World War II (1939-1945). On average an SOE agent would be dead within three months of being dropped in the field. Terry Crowdy tells the extraordinary story of these agents, some of whom were women as young as 22, following them through their experiences beginning with their recruitment and unorthodox training methods, particularly the unarmed combat training provided by the notorious Fairburn and Sykes partnership. As well as detailing these controversial techniques, the training chapter also covers the tough physical training course and parachute training that all recruits had to endure before being sent into occupied Europe.\n\nCrowdy also examines the SOE's unique system of codes, which included each agent composing their own poem as well as using quotations from famous pieces of literature to convey secret messages, and explores the strengths and weaknesses of this system. Full-color artwork and photographs show the innovative equipment, including the S-Phones and Eureka sets, which allowed the agent to communicate directly with pilots and other agents. Lastly, the book recounts the incredible combat missions of the SOE agents, including operations in the field with Yugoslav and Greek partisans, as well as sabotage missions ranging from blowing up bridges to the raising of full-scale partisan armies as they attempted to fulfill Churchill's directive to set Occupied Europe ablaze","torrent":{"xt":"urn:btih:d19c08f3d4fb3fab0925965d5c06b01f042814f0","amp;dn":"SOE+Agent%3A+Churchill%27s+Secret+Warriors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d19c08f3d4fb3fab0925965d5c06b01f042814f0","infoHashBuffer":{"type":"Buffer","data":[209,156,8,243,212,251,63,171,9,37,150,93,92,6,176,31,4,40,20,240]},"announce":[],"urlList":[]}}