{"title":"A History of Early Southeast Asia - Maritime Trade and social de","uid":11049217,"size":3990818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1dd7049f697d6abfecb39f086ddf1d2334c849b&amp;dn=A+History+of+Early+Southeast+Asia+-+Maritime+Trade+and+social+de&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1410995653,"description":"A History of Early Southeast Asia: Maritime Trade and Societal Development, 100-1500 by Kenneth R. Hall\n\nEnglish | ISBN: 0742567613 | 2011 | PDF | 398 pages | 3,8 MB\n\nThis comprehensive history provides a fresh interpretation of Southeast Asia from 100 to 1500, when major social and economic developments foundational to modern societies took place on the mainland (Burma, Thailand, Cambodia, and Vietnam) and the island world (Indonesia, Malaysia, and the Philippines). \n\nKenneth R. Hall explores this dynamic era in detail, which was notable for growing external contacts, internal adaptations of nearby cultures, and progressions from hunter-gatherer and agricultural communities to inclusive hierarchical states. In the process, formerly local civilizations became major participants in period's international trade networks.\n\nIncorporating the latest archeological evidence and international scholarship, Kenneth Hall enlarges upon prior histories of early Southeast Asia that did not venture beyond 1400, extending the study of the region to the Portuguese seizure of Melaka in 1511. Written for a wide audience of non-specialists, the book will be essential reading for all those interested in Asian and world history.","torrent":{"xt":"urn:btih:d1dd7049f697d6abfecb39f086ddf1d2334c849b","amp;dn":"A+History+of+Early+Southeast+Asia+-+Maritime+Trade+and+social+de","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1dd7049f697d6abfecb39f086ddf1d2334c849b","infoHashBuffer":{"type":"Buffer","data":[209,221,112,73,246,151,214,171,254,203,57,240,134,221,241,210,51,76,132,155]},"announce":[],"urlList":[]}}