{"title":"SPAWN - Armageddon PS2 [PAL]","uid":7843837,"size":1499753464,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d26ec96ca020dde802b44ab9c54097f1f2a3233f&amp;dn=SPAWN+-+Armageddon+PS2+%5BPAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Cerebral222","files":-1,"time":1353419641,"description":"Gameplay focuses on fast and stylish combat (similar to the Devil May Cry and God of War series) gaining high breakable items, Souls, Technique points, comic covers, Time and Ranks. Spawn's main weapon is the Agony Axe (formed by his cape), which can cut through any demon. He is also armed with his trademark chains, which attack with great accuracy and speed. Spawn also finds firearms to use on stronger demons. He is also capable of using various hellish powers, particularly the necroplasm. The game features upgrades; Spawn must collect demon souls in order to buy ammunition, upgrade his weapons and increase his maximum health or necroplasm bar.\n\nPCSX2 v 1.0 with plugins &amp; bios included. My setup pics are included to make it easy for you. \n\nI prefer playing this on PC because the graphics can't be matched by the PS2 console, &amp; also, you can't change the X axis on console (That I know of), you can via the LilyPad setup; just map the Left as Right, &amp; the Right as Left on the right analog stick, same as Star Wars Bounty Hunter.\n\nNOTE: If playing this on PC, I recommend:\n\nCore 2 Duo 2.4 &amp; above.\nWindows XP / VISTA / 7\nGraphics card GeForce GT 8800, or ATI 6 series &amp; above.\n\nUsing single core with basic 128, or 512 graphics card may cause frame rate issues.\nI used Alcohol 120% on PS2 settings to backup this game.\n\n                                   ENJOY","torrent":{"xt":"urn:btih:d26ec96ca020dde802b44ab9c54097f1f2a3233f","amp;dn":"SPAWN+-+Armageddon+PS2+%5BPAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d26ec96ca020dde802b44ab9c54097f1f2a3233f","infoHashBuffer":{"type":"Buffer","data":[210,110,201,108,160,32,221,232,2,180,74,185,197,64,151,241,242,163,35,63]},"announce":[],"urlList":[]}}