{"title":"Total DC Comics for 4/30/2014 (darkhomr) [ALL]","uid":10089479,"size":640232376,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d2d69670702dda6aadf076fa1f229a79e0b172ba&amp;dn=Total+DC+Comics+for+4%2F30%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dadrkhomr","files":12,"time":1399171378,"description":"This is the 9th week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 6 DC Universe comics 2 non-Universe titles and 4 digital titles.  \n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\nBatgirl Annual #2 (CBR 4/29/2014)\n\nIt's the start of a new story arc as Batgirl must unravel a mystery centered around her former BIRDS OF PREY teammate, the woman who betrayed her trust - POISON IVY! \n\nBatman '66 #33 (CBR 4/29/2014)\n\nIn the finale to this three-part story, it's all-out action as Batman, Robin and Batgirl race to stop Joker and Catwoman's plan to put all of Gotham under Joker's mind control! \n\nBatman Eternal #4 (CBR 4/29/2014)\n\nBatman battles Batgirl as Jim Gordon's troubles take a turn for the worse! \n\nBatwoman Annual #1 (CBR 4/29/2014)\n\nBatwoman vs. Mr. Bones! Will the DEO triumph over Kate, or will she cross the line and free herself for good! Lingering questions are answered as long-standing conflicts reach their final resolutions. \n\nFlash Annual #3 (CBR 4/29/2014)\n\nThe start of a major new arc for the Fastest Man Alive! In the future, The Flash is a broken man. His powers have failed him time and again at great cost to him and the city he has sworn to protect. Now he's coming back to 2014 to stop the one event that destroyed his life. Meanwhile, in the present, Barry Allen must contend with thieves trying to capitalize on the devastation of FOREVER EVIL. It's a tale of two timelines that ushers in one of DC's most storied characters - featuring The New 52 debut of WALLY WEST! \n\nForever Evil Aftermath Batman vs. Bane #1 (CBR 4/29/2014)\n\nThe title says it all! FOREVER EVIL is over! Now, Batman has returned to take Gotham City back--by force! The only thing standing in his way? BANE! Get ready for the grudge match of the year! \n\nGreen Lantern New Guardians Annual #2 (CBR 4/29/2014)\n\nDon't miss &quot;CURSE OF THE WHITE LANTERN&quot;! Kyle Rayner is the only being in the universe to survive passing through the Source Wall, the bizarre barrier at the end of space. He should have known there'd be consequences - terrible ones! Kyle's mind now contains the most dangerous secret in all of creation . . . and that secret is desperate to get out and get to Earth! Don't miss the story that plants a crucial seed for the next GREEN LANTERN epic! \n\nHe Man And The Masters Of The Universe #12 (CBR 4/29/2014)\n\nThe dramatic conclusion to 'What Lies Within.' With He-Man captured, it's up to Teela and the rest of their allies to try to overcome their enemy and his overwhelming forces. But what price will come with victory? One hero has already been tragically lost and one will be transformed forever. A major chapter in the history of the Masters of the Universe concludes, as another is about to begin. \n\nJustice League Beyond 2.0 #19 (CBR 4/29/2014)\n\nThe Justice Lords have arrived! As an all-out brawl erupts between the League and the Lords, Lord Superman searches for his wife and Wonder Woman reveals a shocking secret. \n\nSmallville: Lantern #8 (CBR 4/29/2014)\n\nBatman, Nightwing, Green Arrow and the Wonder Woman from the DEO are doing their best, but can they defeat the new bearers of yellow lantern rings on their own? \n\nVertigo Quarterly #1 Cyan (CBR 4/29/2014)\n\nThe four colors that are the basis of comics coloring serve as the jumping-off point for creators to push the boundaries of short graphic fiction in the new VERTIGO QUARTERLY: CMYK series.\n\n Starting with stunningly simple, bold covers, CMYK will defy all conventions of traditional comics anthologies. The unifying color could suggest a mood, a plot point, a coloring technique - limited only by the imagination of the fantastic creators we've lined up. And starting with CYAN, we have tales by some of the best talents in comics - a who's who of creative minds. Jock, Fabio Moon, James Tynion IV, Robert Rodi, Shaun Simon, Amy Chu, Joe Keatinge, Cris Peter, Tony Akins and more will take on the challenge of telling compelling stories that scream cool 'blue.' VERTIGO QUARTERLY: CMYK will continue through 2014 with MAGENTA in summer, YELLOW in fall and finally BLACK in winter. Be prepared to see color as only Vertigo can deliver! \n\n","torrent":{"xt":"urn:btih:d2d69670702dda6aadf076fa1f229a79e0b172ba","amp;dn":"Total+DC+Comics+for+4%2F30%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d69670702dda6aadf076fa1f229a79e0b172ba","infoHashBuffer":{"type":"Buffer","data":[210,214,150,112,112,45,218,106,173,240,118,250,31,34,154,121,224,177,114,186]},"announce":[],"urlList":[]}}