{"title":"Bitext Alignment","uid":6538499,"size":2157091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3b55151b2b0c173e071ec9320d9c22aed706699&amp;dn=Bitext+Alignment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1310594783,"description":"JÃƒÂ¶rg Tiedemann, &quot;Bitext Alignment&quot; \n Mor gan &amp; Cla ypool Pu blishers | 2011 | ISBN: 1608455106 | 166 pages | PDF | 2.05 MB \n\n This book provides an overview of various techniques for the alignment of bitexts. It describes general concepts and strategies that can be applied to map corresponding parts in parallel documents on various levels of granularity. Bitexts are valuable linguistic resources for many different research fields and practical applications. The most predominant application is machine translation, in particular, statistical machine translation. However, there are various other threads that can be followed which may be supported by the rich linguistic knowledge implicitly stored in parallel resources. Bitexts have been explored in lexicography, word sense disambiguation, terminology extraction, computer-aided language learning and translation studies to name just a few. The book covers the essential tasks that have to be carried out when building parallel corpora starting from the collection of translated documents up to sub-sentential alignments. In particular, it describes various approaches to document alignment, sentence alignment, word alignment and tree structure alignment. It also includes a list of resources and a comprehensive review of the literature on alignment techniques.","torrent":{"xt":"urn:btih:d3b55151b2b0c173e071ec9320d9c22aed706699","amp;dn":"Bitext+Alignment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3b55151b2b0c173e071ec9320d9c22aed706699","infoHashBuffer":{"type":"Buffer","data":[211,181,81,81,178,176,193,115,224,113,236,147,32,217,194,42,237,112,102,153]},"announce":[],"urlList":[]}}