{"title":"Whorecraft The Chronicles of Alexstrasza Ep1","uid":8420099,"size":1480710381,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:d4b304c1af544077040560099e829550a20f9b8c&amp;dn=Whorecraft+The+Chronicles+of+Alexstrasza+Ep1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Wisher_SiD","files":-1,"time":1367165239,"description":"This is Whorecraft: The Chronicles of Alexstrasza, a World of Warcraft parody porn game made in the Unreal 3 Engine by Auril. \nIt plays like a regular rpg, you walk around doing quests, collecting items, talking to npcs and of course... Having sex! The sex scenes play mostly in 2 different ways: either its basically a slideshow of images or its animated ingame and you can control the camera or progress the scene.\nNow the game is still W.I.P and this is just the first episode, so its definitely not finished but its playable and quite good as well.\n\n[quote=Auril]\nThe game is divided into five episodes. The full version of each episode will be free, but people who donate 25â‚¬ to develop project will have early access to episodes of the game and gallery on the website. In addition donators can take part in the beta testing of each episode long before its release.[/quote]\n\n\nInstallation:\nJust run the WCv1.6.1r.exe file and install to a location of your choice. \nIf you dont get a shortcut, navigate to WhoreCraftBinariesWin32 and run UDK.exe\n\nNotes:\nQuick save/load has been added in this latest, 1.6.1 version. Press F5 to quick save and F6 to quick load. It only saves one file and overwrites the previous one on next save!\n\n\nCredits:\nAuril - For the great work done on this game and continued development for free. If you have some money to spare and you liked the game, feel free to donate on his website or blog: &lt;a href=&quot;\nhttp://thechroniclesofalexstrasza.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thechroniclesofalexstrasza.com/&lt;/a&gt;\n\n\nIm uploading this game here, even though its free, for the people who are having problems with Auril's affiliate download sites or just can't stand the slow speeds for free users.\n\n\n\n\nIm open for requests. Just PM me a name for any porn/erotic game you would like to see here and ill do my best to get it.","torrent":{"xt":"urn:btih:d4b304c1af544077040560099e829550a20f9b8c","amp;dn":"Whorecraft+The+Chronicles+of+Alexstrasza+Ep1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4b304c1af544077040560099e829550a20f9b8c","infoHashBuffer":{"type":"Buffer","data":[212,179,4,193,175,84,64,119,4,5,96,9,158,130,149,80,162,15,155,140]},"announce":[],"urlList":[]}}