{"title":"EleganceStudios - Pony Girl 1080p","uid":12079616,"size":2092433006,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d61b36db93ec7e77156e5363fcb2a27d5cfcbad9&amp;dn=EleganceStudios+-+Pony+Girl+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":99,"time":1435716253,"description":"EleganceStudios - Pony Girl\n\nStarring: Ariel Anderssen, Michael Stamp, Hywel Phillips \n\n\n1080p MP4 + Pics.\n\n\nThe gymkhana. The village pony show. Horse riding in the afternoons. Going on hacks into the hills. Ariel is a very posh and very horse-y sort of girl.\n\nBut someone has their eyes on her and they are considering her in an entirely different light.\n\nSoon she will discover what it is to be a captured and trained slave, an enforced Pony Girl!\n\nTwo operatives are assigned to her case. The first- a kidnap and take-down specialist. He surprises her in her house, captures her, locks her in chains.\n\nWhen she awakes, he forces her to put in blackout contact lenses which totally blind her! Unable to see, disorientated and scared, he further smashes any resistance or rebellion by forcing her to strip off her riding boots, her jodhpurs, her blouse... and her underwear!\n\nNaked, helpless, bewildered, blindfolded... he has her totally at his mercy! His job is done, he leads her through the halls to where the second specialist awaits- the Pony Trainer!\n\nStrict and severe, he is an expert in training wayward fillies, breaking them in with harness, bridle and big gag until they are resigned to their new lives as sex slave Pony Girls.\n\nThe first training session is harsh and is designed to enforce compliance with the new rules that guide her life as a Pony Girl. She must learn to walk, holding her head high, stepping proudly... and of course, if she talks without permission or refuses an order, she will be punished!\n\nBriefly Ariel fights her trainer, unwilling to accept her new station. She is not fully broken in to the whip as a Pony Girl yet!\n\nThe Pony Trainer will soon disabuse her of any delusions of grandeur. Still completely blinded by the blackout contact lenses, he administers a severe caning to her proud ass, the stripes standing out in perfect contrast to her pale English Rose complexion.\n\nShe still hasn't learnt that talking without permission or refusal of orders will result in swift punishment- further hard strokes of the cane serve to drive that lesson home!\n\nFinally submitting to her trainer's will, she must walk in circles on the chain under his watchful eyes, head high in her Pony Girl harness, silenced by the bit gag and the dreaded horse spoon gag which prevents her talking and makes her drool!\n\nThen it is time for the Pony Girl to be taken to the dungeon to sleep. Good night Pony Girl! And of course, she will only be fed from a nose-bag, like any other Pony!\n\nScreens &lt;a href=&quot;\nhttp://s23.postimg.org/vc340n3yz/Elegance_Studios_Pony_Girl_1080p_mp4_thumbs_20.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s23.postimg.org/vc340n3yz/Elegance_Studios_Pony_Girl_1080p_mp4_thumbs_20.jpg&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n18 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers :-)","torrent":{"xt":"urn:btih:d61b36db93ec7e77156e5363fcb2a27d5cfcbad9","amp;dn":"EleganceStudios+-+Pony+Girl+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d61b36db93ec7e77156e5363fcb2a27d5cfcbad9","infoHashBuffer":{"type":"Buffer","data":[214,27,54,219,147,236,126,119,21,110,83,99,252,178,162,125,92,252,186,217]},"announce":[],"urlList":[]}}