{"title":"Oversights / Mistakes in Blockbuster Movie Eega (Telugu) Naan Ee","uid":8393223,"size":175048031,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:d761cca15398d1a0a75e3a049be27bcf144131d5&amp;dn=Oversights+%2F+Mistakes+in+Blockbuster+Movie+Eega+%28Telugu%29+Naan+Ee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hii.satya","files":-1,"time":1366491674,"description":"Friends, this video is a collection of few mistakes I noticed in this movie. I don't mean to hurt anybody. Created this video as part of my video editing tool study and thought of sharing with you all. We saw the real potential of Mr. Rajamouli with this unique story line and creative approach towards execution of his father's idea. \n\nIt is universal truth that this movie is one if its kind and one of the few unforgettable movies of TFI.\n\nWith all due respect to the entire team behind this movie, I once again convey that I made this video as part of an activity but not with any bad intention. \n\nIt is universal fact that it is not possible to make a movie without mistakes.\n\nAfter I uploaded my initial video on Youtube, Vaishno Media/ Filmy Hungama (intentionally wrote as Flimsy in the introduction of this video) ripped off completely and posted on their channel. So I complained to Youtube because it was not fair. I felt my hard work and knowledge was stolen. In fact, my video was the first on the whole Internet. I was surprised when they (vaishno media) being a reputed company blocked my video and filed for coounter notification about blocking their video.\n\nFriends, you tell me there are lots of clips from this movie on Youtube and Internet but these guys are behind my creative idea and hard work. Please share this video to as many people as you want.\n\nThis video has more oversights/mistakes than my first video. Let me know your thoughts.","torrent":{"xt":"urn:btih:d761cca15398d1a0a75e3a049be27bcf144131d5","amp;dn":"Oversights+%2F+Mistakes+in+Blockbuster+Movie+Eega+%28Telugu%29+Naan+Ee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d761cca15398d1a0a75e3a049be27bcf144131d5","infoHashBuffer":{"type":"Buffer","data":[215,97,204,161,83,152,209,160,167,94,58,4,155,226,123,207,20,65,49,213]},"announce":[],"urlList":[]}}