{"title":"Best in Show: Knit Your Own Dog","uid":9584893,"size":38606275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8c023bcb5b849c7cf801f316d7b88969090e85b&amp;dn=Best+in+Show%3A+Knit+Your+Own+Dog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1391813996,"description":"The perfect gift for dog-lovers who knit!  From a spotted Dalmatian to a wrinkly Bulldog, the step-by-step patterns in Knit Your Own Dog let you knit the dog you've always wanted. \n\nThe knitted dog is indeed the ideal companion: There's no feeding, barking, shedding, or vet's bills, and he'll live forever! Knit Your Own Dog is the irresistible guide to knitting the perfect pup. With patterns for 25 different pedigree pooches, Knit Your Own Dog lets you choose the dog you want, whether it's a pretty Poodle or a loyal Labrador. Or knit them all for a pack of canine fun! \n\nThe patterns are easy-to-follow for both new and veteran knitters. It should take only a few evenings to create a covetable companion for life. And yet each pattern is extremely detailed and includes all of the distinguishing features of each breed, from the startling blue eyes of the Siberian Husky and the long, woolly curls of the Old English Sheepdog to the lolling tongue of the German Shepherd. \n\nAccompanying the patterns are a brief description of each breed, as well as expert tips on choosing yarns, stuffing and sewing the dogs, and adding personality to your creation. Beautiful color photographs of the finished dogs, as well as detail shots, both inspire and instruct. Knit Your Own Dog is the perfect book for knitters and devoted dog lovers. \n\nBreeds include: Afghan Hound, Basset Hound, Border Collie, Cocker Spaniel, Corgi, Dachshund, Dalmatian, English Bulldog, English Bull Terrier, French Bulldog, German Shepherd, Jack Russell, Labrador, Miniature Schnauzer, Old English Sheepdog, Poodle, Portuguese Water Dog, Pug, Red Setter, Rough Collie, Scottish Terrier, Siberian Husky, West Highland Terrier, Whippet, Wire-haired Fox Terrier.","torrent":{"xt":"urn:btih:d8c023bcb5b849c7cf801f316d7b88969090e85b","amp;dn":"Best+in+Show%3A+Knit+Your+Own+Dog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8c023bcb5b849c7cf801f316d7b88969090e85b","infoHashBuffer":{"type":"Buffer","data":[216,192,35,188,181,184,73,199,207,128,31,49,109,123,136,150,144,144,232,91]},"announce":[],"urlList":[]}}