{"title":"Dungeons &amp; Dragons 3rd ed.-four campaign settings","uid":6451973,"size":295084320,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbd716d6451e1a91108caef6b391fc47cdb05340&amp;dn=Dungeons+%26+Dragons+3rd+ed.-four+campaign+settings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thirdaardvark","files":37,"time":1307458866,"description":"This torrent contains four campaign settings for Dungeons &amp; Dragons 3rd. ed:\nMorningstar, from Goodman Games. Thraxis is an idyllic world of high magic. But now extra-planar forces seek to invade Thraxis and harness its powerful magic for their own purposes.\nNeiyar, from Bards and Sages Press. Neiyar is an isolated tropical island inhabited by matriarchal humans and a host of unusual races. It is cut off from the rest of the world by a once benevolent goddess who may be going mad and threatened by the return of an imprisoned demon lord.\nNorthern Crown-New World Adventures, from Atlas Games. A setting inspired by the era of European colonialism in North America (the 1600 &amp; 1700s), with new character classes to fit the setting. The only major race is humanity--the author didn't do anything tacky like make American Indians elves.\nOathbound, from Bastion Press. A world created as a prison for seven powerful spirits, servants of a dead god. Bound there by oaths sworn to the gods who slew their master, they seek to exploit loopholes in their oaths by bringing in people foreign to their world, somewhat after the fashion of Ravenloft, hoping this will someday gives them a means to escape.","torrent":{"xt":"urn:btih:dbd716d6451e1a91108caef6b391fc47cdb05340","amp;dn":"Dungeons+%26+Dragons+3rd+ed.-four+campaign+settings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd716d6451e1a91108caef6b391fc47cdb05340","infoHashBuffer":{"type":"Buffer","data":[219,215,22,214,69,30,26,145,16,140,174,246,179,145,252,71,205,176,83,64]},"announce":[],"urlList":[]}}