{"title":"VA - Dim Lights, Thick Smoke And Hillbilly Music 1945","uid":8057862,"size":220892103,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc1ed2ec0a3ba729c308218b4bc1b380075a34f1&amp;dn=VA+-+Dim+Lights%2C+Thick+Smoke+And+Hillbilly+Music+1945&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"barber9","files":-1,"time":1359008707,"description":"Germany's Bear Family is well known for its stellar box set reissues of country, rock, and rhythm &amp; blues recordings, as well as for single titles by deserving if not necessarily remembered American artists. Their mastering, production, and packaging set the industry standard for excellence. The six-volume Dim Lights, Thick Smoke series was released on CD in December of 2008 and covered the years 1945-1950, a strange and wonderful time in country music history born from of the end of the War Department's restrictions on shellac and the end of the recording ban, all near the end of the second world war. These discs all contain either 27 or 28 tracks, and are lavishly annotated with historical essays and track by track annotation by the esteemed Colin Escott, and contain with photographs of performers and record sleeves where available. \n\nThe 1945 volume is indicative of the rest. Contained here are well-known numbers by legendary artists as well as some relative obscurities - to novices anyway. But anyway you slice it, these tracks were compiled from the best audio sources available. The better-known selections here are Bob Wills' Smoke on the Water and Stars and Stripes on Iwo Jima, Dick Thomas' Sioux City Sue, Phil Harris' Western swing classic That's What I Like About the South, Wesley Tuttle's With Tears in My Eyes, Floyd Tillman's Each Night at Nine, Tex Ritter's You Two Timed Me One Time Too Often, Roy Acuff's We Live in Two Diffr'ent Worlds, Jack Guthrie's stone classic Oklahoma Hills (Woody's uncle), and Spade Cooley's Shame on You, just to name a few. This volume is just a peek into the world that Bear Family opens in the Dim Lights, Thick Smoke series. To add to the bounty: the sound quality here is also unmatched anywhere else. \n(Thom Jurek)\n\n- - -\n\nVA - Dim Lights, Thick Smoke And Hillbilly Music 1945\n(Bear Family Records 2008)\n\n\n     1. Smoke On The Water - Bob Wills &amp; His Texas Cowboys\n     2. At Mail Call Today - Gene Autry\n     3. Shame On You - Spade Cooley &amp; His Orchestra\n     4. That's What I Like About The South - Phil Harris &amp; His Orchestra\n     5. Jenny Lou Carson - Jenny Carson\n     6. Sioux City Sue - Dick Thomas\n     7. Tomorrow Never Comes - Ernest Tubb\n     8. There's A New Moon Over My Shoulder - Jimmie Davis\n     9. Have I Told You Lately That I Love You - Brad Brady\n    10. Headin' Down The Wrong Highway - Ted Daffan\n    11. Oklahoma Hills - Jack Guthrie &amp; His Oklahomans\n    12. Boogie Woogie Boy - Porky Freeman Trio\n    13. Don't Fence Me In - Gene Autry\n    14. Cattle Call, The - Eddy Arnold\n    15. I'm Losing My Mind Over You - Al Dexter and His Troopers\n    16. Each Night At Nine - Floyd Tillman &amp; His Favorite Playboys\n    17. Hang Your Head In Shame - Red Foley\n    18. You Two Timed Me One Time Too Often - Tex Ritter &amp; His Texans\n    19. That's All - Merle Travis\n    20. With Tears In My Eyes - Wesley Tuttle &amp; His Texas Stars\n    21. Stars And Stripes On Iwo Jima - Bob Wills and His Texas Playboys\n    22. It's Been So Long Darling - Ernest Tubb\n    23. Nails In My Coffin - Jerry Irby\n    24. Detour - Paul Westmoreland &amp; His Pecos River Boys\n    25. We Live In Two Diff'rent Worlds - Roy Acuff\n    26. Blue Ranger - Hank Snow\n    27. Guitar Boogie - The Rambler Trio / Arthur Smith / Spade Cooley\n","torrent":{"xt":"urn:btih:dc1ed2ec0a3ba729c308218b4bc1b380075a34f1","amp;dn":"VA+-+Dim+Lights%2C+Thick+Smoke+And+Hillbilly+Music+1945","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1ed2ec0a3ba729c308218b4bc1b380075a34f1","infoHashBuffer":{"type":"Buffer","data":[220,30,210,236,10,59,167,41,195,8,33,139,75,193,179,128,7,90,52,241]},"announce":[],"urlList":[]}}