{"title":"To Heaven And Back - Mary C. Neal.epub","uid":8891907,"size":3391456,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc2593aecb86c10a930098fd885eae83d077554b&amp;dn=To+Heaven+And+Back+-+Mary+C.+Neal.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378600757,"description":"A kayak accident during a South American adventure takes one woman to heaven -- where she experienced God's peace, joy, and angels -- and back to life again.\n\nIn 1999 in the Los Rios region of southern Chile, orthopedic surgeon, devoted wife, and loving mother Dr. Mary Neal drowned in a kayak accident. While cascading down a waterfall, her kayak became pinned at the bottom and she was immediately and completely submerged. Despite the rescue efforts of her companions, Mary was underwater for too long, and as a result, died.\n&quot;To Heaven and Back&quot; is Mary's remarkable story of her life's spiritual journey and what happened as she moved from life to death to eternal life, and back again. Detailing her feelings and surroundings in heaven, her communication with angels, and her deep sense of sadness when she realized it wasn't her time, Mary shares the captivating experience of her modern-day miracle.\nMary's life has been forever changed by her newfound understanding of her purpose on earth, her awareness of God, her closer relationship with Jesus, and her personal spiritual journey suddenly enhanced by a first-hand experience in heaven. &quot;To Heaven and Back&quot; will reacquaint you with the hope, wonder, and promise of heaven, while enriching you own faith and walk with God.","torrent":{"xt":"urn:btih:dc2593aecb86c10a930098fd885eae83d077554b","amp;dn":"To+Heaven+And+Back+-+Mary+C.+Neal.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2593aecb86c10a930098fd885eae83d077554b","infoHashBuffer":{"type":"Buffer","data":[220,37,147,174,203,134,193,10,147,0,152,253,136,94,174,131,208,119,85,75]},"announce":[],"urlList":[]}}