{"title":"Lady Parts - Andrea Martin","uid":11430655,"size":2345205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc3d10915bca45c67bf34b9ad50d1830ec63227e&amp;dn=Lady+Parts+-+Andrea+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1415722962,"description":"Whether lighting up the small screen, stealing scenes on the big screen or starring on the stage, Andrea Martin has long entertained Canadians with her hilarious characterizations and heartwarming performances. An important player in SCTV, the funniest show ever to come out of Canada, Martin helped change the face of television by introducing us to a host of characters, including the indomitable Edith Prickley. Martin has worked stages, sets and even trapezes across North America, playing to houses packed with adoring fans, all of whom instantly recognize the star who has entertained us for nearly forty years.\n\nIn Lady Parts, Martin, for the first time, shares her fondest remembrances of a life in show business, motherhood, relationships, no relationships, family, chimps in tutus, squirrels, and why she flies to Atlanta to get her hair cut. Martin opens up her heart in a series of eclectic, human, always entertaining and often moving essays. Lady Parts will make you giggle and may make you cry--a powerful collection of stories by a woman with a truly storied life","torrent":{"xt":"urn:btih:dc3d10915bca45c67bf34b9ad50d1830ec63227e","amp;dn":"Lady+Parts+-+Andrea+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc3d10915bca45c67bf34b9ad50d1830ec63227e","infoHashBuffer":{"type":"Buffer","data":[220,61,16,145,91,202,69,198,123,243,75,154,213,13,24,48,236,99,34,126]},"announce":[],"urlList":[]}}