{"title":"God's Undertaker - Has Science Buried God? - Dr. John Lennox","uid":11773437,"size":27514133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd1b012cb4a67b2c6c74896312324ba9c49d22ae&amp;dn=God%27s+Undertaker+-+Has+Science+Buried+God%3F+-+Dr.+John+Lennox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427168063,"description":"\nIf we are to believe many modern commentators, science has squeezed God into a corner, killed and then buried him with its all-embracing explanations. Atheism, we are told, is the only intellectually tenable position, and any attempt to reintroduce God is likely to impede the progress of science. In this stimulating and thought-provoking book, John Lennox invites us to consider such claims very carefully. Is it really true, he asks, that everything in science points towards atheism? Could it be possible that theism sits more comfortably with science than atheism? Has science buried God or not? Now updated and expanded, God's Undertaker is an invaluable contribution to the debate about science's relationship to religion.\n\nIntended to provide a basis for discussion, this captivating study evaluates the evidence of modern science in relation to the debate between the atheistic and theistic resource addresses such topics as the origin of life; the genetic code and its origin; the nature and scope of evolution; and the scope and limits of science. Gripping and thoroughly argued, it is an illuminating look at one of man's greatest debates.\n\n\nAbout the author:\nProfessor John Carson Lennox (born 1945) is an Irish mathematician, philosopher of science, and Christian apologist who is Professor of Mathematics at the University of Oxford. He is a Fellow in Mathematics and Philosophy of Science at Green Templeton College, Oxford University. He is also Pastoral Advisor of Green Templeton College and Fellow of Wycliffe Hall. He is a leading voice defending the notion of the relationship between science and religion.[citation needed] Lennox is considered to be a leading figure of the evangelical intelligentsia movement.\n\nUpon completing his doctorate, Lennox moved to Cardiff, Wales, becoming a reader in Mathematics at the University of Wales, Cardiff. During his 29 years in Cardiff he spent a year at each of the universities of W?rzburg, Freiburg (as an Alexander von Humboldt Fellow), and Vienna, and has lectured extensively in both Eastern and Western Europe, Russia and North America on mathematics, apologetics, and the exposition of scripture. He has published over 70 peer-reviewed articles on mathematics and co-authored two Oxford Mathematical Monographs and has worked as a translator of Russian mathematics.\n\nLennox also teaches science and religion in the University of Oxford. He is the author of a number of books on the relations of science, religion, and ethics. He has spoken in many different countries, in conferences, and as an academic fellow, including numerous trips to the former Soviet Union. Lennox has also given lectures at the Veritas forum on topics such as the relationship between science and religion, the existence of God, doubt, and the problems of evil and suffering.\n\nLennox speaks English, Russian, French, German, and Spanish. He is married to Sally and has three children and five grandchildren","torrent":{"xt":"urn:btih:dd1b012cb4a67b2c6c74896312324ba9c49d22ae","amp;dn":"God%27s+Undertaker+-+Has+Science+Buried+God%3F+-+Dr.+John+Lennox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1b012cb4a67b2c6c74896312324ba9c49d22ae","infoHashBuffer":{"type":"Buffer","data":[221,27,1,44,180,166,123,44,108,116,137,99,18,50,75,169,196,157,34,174]},"announce":[],"urlList":[]}}