{"title":"Graphene for Transparent Conductors","uid":15222275,"size":18998865,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dda812eb3d64eb3d30941304b887e2bf51b9bf34&amp;dn=Graphene+for+Transparent+Conductors&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467744485,"description":"Graphene for Transparent Conductors - Qingbin Zheng, Jang-Kyo Kim (Springer, 2015).pdf\r\n\r\nISBN 978-1-4939-2768-5\r\n\r\nThis book provides a systematic presentation of the principles and practices behind the synthesis and functionalization of graphene and grapheme oxide (GO), as well as the fabrication techniques for transparent conductors from these materials.\r\n\r\nTransparent conductors are used in a wide variety of photoelectronic and photovoltaic devices, such as liquid crystal displays (LCDs), solar cells, optical communication devices, and solid-state lighting. Thin films made from indium tin oxide (ITO) have thus far been the dominant source of transparent conductors, and now account for 50% of indium consumption. However, the price of Indium has increased 1000% in the last 10 years. Graphene, a two-dimensional monolayer of sp2-bonded carbon atoms, has attracted significant interest because of its unique transport properties. Because of their high optical transmittance and electrical conductivity, thin film electrodes made from graphene nanosheets have been considered an ideal candidate to replace expensive ITO films.\r\n\r\nGraphene for Transparent Conductors offers a systematic presentation of the principles, theories and technical practices behind the structure–property relationship of the thin films, which are the key to the successful development of high-performance transparent conductors. At the same time, the unique perspectives provided in the applications of graphene and GO as transparent conductors will serve as a general guide to the design and fabrication of thin film materials for specific applications","torrent":{"xt":"urn:btih:dda812eb3d64eb3d30941304b887e2bf51b9bf34","amp;dn":"Graphene+for+Transparent+Conductors","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda812eb3d64eb3d30941304b887e2bf51b9bf34","infoHashBuffer":{"type":"Buffer","data":[221,168,18,235,61,100,235,61,48,148,19,4,184,135,226,191,81,185,191,52]},"announce":[],"urlList":[]}}