{"title":"Grunts: The American Combat Soldier in Vietnam","uid":11739391,"size":1613155,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de2a07f2b59918ccfb484c9e14a1b059889e74a8&amp;dn=Grunts%3A+The+American+Combat+Soldier+in+Vietnam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425711353,"description":"Equally appealing for classroom use and general readers, this book provides a fresh approach to understanding the American combat soldier's experience in Vietnam that integrates such topics as the political culture, the experiences of training, the actual Vietnam experience, and the homecoming. It offers a remarkable overview of the 870,000 grunts who bore the brunt of the fighting in the jungles and highlands of South Vietnam, and eventually Cambodia and Laos. The book addresses many of the stereotypes of the Vietnam combat veteran that have been perpetuated in popular culture, and also considers how Vietnam veterans have been commemorated through memorials and other means, and how the veterans remember each other. Coverage also includes women who served in or near the front lines as well as on the home front. The author draws on memoirs and oral histories including his personal interviews with veterans, but the book conveys a picture of the Vietnam combat soldier's experience far more powerful than what individual memoirs can provide","torrent":{"xt":"urn:btih:de2a07f2b59918ccfb484c9e14a1b059889e74a8","amp;dn":"Grunts%3A+The+American+Combat+Soldier+in+Vietnam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de2a07f2b59918ccfb484c9e14a1b059889e74a8","infoHashBuffer":{"type":"Buffer","data":[222,42,7,242,181,153,24,204,251,72,76,158,20,161,176,89,136,158,116,168]},"announce":[],"urlList":[]}}