{"title":"TRANCE - Dash Berlin with Cerf Mitiska _ Jaren - Man On The Run.","uid":6365694,"size":16184421,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dee78de6fc91f47802d29e95c50290ab7d72f8e8&amp;dn=TRANCE+-+Dash+Berlin+with+Cerf+Mitiska+_+Jaren+-+Man+On+The+Run.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"robynet22","files":1,"time":1304501201,"description":"Dash Berlin with Cerf Mitiska _ Jaren - Man On The Run (Official Music Video) mp4\n\n\n\nRemember that remix Dash Berlin did on Cerf, Mitiska &amp; Jarens You Never Said? It rocked the crowds, all the way from New York to Amsterdam and everywhere in between. And it sure didnt only impress the trance lovers. The track was even nominated for Best EuroDance/Hi-NRG Track at this years International Dance Music Awards, which proves that a combination of their sounds was more than just musical chemistry. Right about time for a collaboration. Dutch producer collective Dash Berlin have now teamed up with the well known trance trio Cerf, Mitiska &amp; Jaren. Matt Cerf and Shawn Mitiska, armed with singer Jaren, have been haunting the trance scene with previous hits Light The Skies and Saved Again. Man On The Run is the result of this exciting team up and the proof that these team players can truly live up to the expectations. Man On The Run is the catchy, piano-driven anthem that again shows how great a heavy bassline, a voice to die for and an emotionally charged melody can shape something beyond listening pleasure. This team has found their perfect match. Man On The Run goes deep, hits high and leaves everyone speechless, if not singing along.\n\n","torrent":{"xt":"urn:btih:dee78de6fc91f47802d29e95c50290ab7d72f8e8","amp;dn":"TRANCE+-+Dash+Berlin+with+Cerf+Mitiska+_+Jaren+-+Man+On+The+Run.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee78de6fc91f47802d29e95c50290ab7d72f8e8","infoHashBuffer":{"type":"Buffer","data":[222,231,141,230,252,145,244,120,2,210,158,149,197,2,144,171,125,114,248,232]},"announce":[],"urlList":[]}}