{"title":"Computational Contact Mechanics {BBS}","uid":6817794,"size":32523268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfe4fabbce6752d8d243ef140eced2e492e6733e&amp;dn=Computational+Contact+Mechanics+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321286851,"description":"Boundary value problems involving contact are important for industrial applications in both mechanical and civil engineering, such as structural foundations, bearings, metal forming processes, rubber sealings, drilling problems, crash analysis of cars, rolling contact between car tyres and the road, cooling of electronic devices, and many more. Other applications are related to biomechanical engineering design, where human joints, implants or teeth are considered. Due to this variety, contact problems today are combined either with large elastic or inelastic deformations, including time-dependent responses. Thermal coupling may also have to be considered, and even stability behaviour has to be linked to contact, such as wrinkling arising in metal forming problems.\n\nThe topic of computational contact is described in depth here, providing different formulations, algorithms and discretisation techniques for contact problems that have been established in the geometrically linear and nonlinear ranges. This book provides the necessary continuum mechanics background. Special geometrical relations needed to set up the contact constraints are derived, and constitutive equations stemming from tribology which are valid at the contact interface are discussed in detail, without going into a numerical treatment. Solid and beam contact is considered, as is contact of unstable systems and thermomechanical contact. The algorithmic aspects cover a broad range of solution methods. Additionally, adaptive discretisation techniques for contact analysis are presented as a modern tool for engineering design simulations.\n\nThis book:\n\n    * applies to a wide variety of industrial applications,\n\n    * starts from a sound continuum mechanics background,\n\n    * introduces new discretisation techniques and algorithms, and\n\n    * includes thermo-mechanical considerations and adaptive methods.\n\nComputational Contact Mechanics has been written not only for graduate, Masters and PhD students, but also for engineers in the car, tyre and packaging industries who simulate contact problems in practical applications and need to understand the theoretical and algorithmic background of contact treatment in modern finite element systems.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 464 pages\n    * Publisher: Wiley; 1 edition (September 23, 2002)\n    * Language: English\n    * ISBN-10: 0471496804\n    * ISBN-13: 978-0471496809","torrent":{"xt":"urn:btih:dfe4fabbce6752d8d243ef140eced2e492e6733e","amp;dn":"Computational+Contact+Mechanics+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe4fabbce6752d8d243ef140eced2e492e6733e","infoHashBuffer":{"type":"Buffer","data":[223,228,250,187,206,103,82,216,210,67,239,20,14,206,210,228,146,230,115,62]},"announce":[],"urlList":[]}}