{"title":"Sexually Broken--21yr old girl brutally skull fuck Melody Jordan","uid":8636929,"size":1092165380,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:dff3a1f947114be5f06a78274bedb7d098abd128&amp;dn=Sexually+Broken--21yr+old+girl+brutally+skull+fuck+Melody+Jordan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1372779559,"description":"21yr old girl next door, brutally skull fuck, bound in splits, vibrator ripping orgasms out of her. | Melody Jordan | Matt Williams\n\nJuly 1, 2013 \n\n\nMP4 only.\n\n \nWe love those innocent looking girl next door types, just as much as you do. We are proud to bring you Melody Jordan as todays update for the best sex and submission site on the net.\n\nWhenever a fresh new girl walks onto our stage we never know what to expect. How good is she at bondage? Can she deep throat? Can she endure a brutal skull fucking? How flexible is she? Is she really into it, or just here for a payday? Thats why we do the &quot;Meet and Greet&quot;. It is an impromptu live bondage session right before your eyes. All bondage on screen, all action made up as we go along. The most realistic bondage and sex scene you will see. \n\nWearing her cute little dress, our custom leather gear and blind fold, Melody find herself on her knees sucking cock. The leather cuffs lock her arms behind her and the strict leather collar keeps her neck stretched and straight. We let her worship the cock with her mouth for a bit before we take over and deliver a face fucking she won't soon forget. \n\nThere is nothing sexier then the girl next door getting her face fucked into oblivion while completely helpless. That look in her eyes when she realizes this is all too real. That look of panic, of helplessness, and despair, as she understands you control when and how she gets air. The cock rams the back of the throat, goes balls deep, and sits there completely blocking air. We own her with cock and she pleads with her eyes for mercy. \n\nWe then move her to the ground and pull her legs out into sitting splits. This one is flexible: a former gymnast, so her legs are spread wide. A vibrator is locked on to her clit and the collar locked to the beam behind her. Now our favorite thing in the world. THROAT BOARDING! It's when a girls head is lock against a beam and has no where to hide from the cock that is going to fuck her face hole into next week. \n\nThe vibrator is ripping orgasms out of her helpless body as the cock is destroying her throat. Melody is overloaded, in subspace and cumming like a common slut. Check out why we are the best bondage and sex site in the world. The most new faces, the best bondage, and hotest realistic action you will find on the net. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_01mjordan/SexuallyBroken-Melody-Jordan-Matt-Williams-21yr-old-girl-next-door-brutally-skull-fuck-bound-in-splits-vibrator-ripping-orgasms-out-of-her.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_01mjordan/SexuallyBroken-Melody-Jordan-Matt-Williams-21yr-old-girl-next-door-brutally-skull-fuck-bound-in-splits-vibrator-ripping-orgasms-out-of-her.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:dff3a1f947114be5f06a78274bedb7d098abd128","amp;dn":"Sexually+Broken--21yr+old+girl+brutally+skull+fuck+Melody+Jordan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dff3a1f947114be5f06a78274bedb7d098abd128","infoHashBuffer":{"type":"Buffer","data":[223,243,161,249,71,17,75,229,240,106,120,39,75,237,183,208,152,171,209,40]},"announce":[],"urlList":[]}}