{"title":"Jim Henson Muppets Living With Dinosaurs, Miss Piggy's Hollywood","uid":10398980,"size":4075158543,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0aeae37ffe3d336e89dfc7df35d9529b7813a64&amp;dn=Jim+Henson+Muppets+Living+With+Dinosaurs%2C+Miss+Piggy%27s+Hollywood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":132,"time":1403323153,"description":"Jim Henson's Muppets:\nLiving With Dinosaurs (PAL VHS, Dutch subs) and Miss Piggy's Hollywood [PAL DVD]\n\nSemi-restored from VHS, DVD and other sources, with special features.\n\nThis is a PAL disc designed for British DVD players and American computers. This will fit on a standard DVD-R if the DVD-ROM folder is removed.\n\n\nLiving With Dinosaurs (PAL VHS, Dutch subs)\n\nLiving With Dinosaurs is a Jim Henson television special that originally aired in the UK on December 30, 1990. &quot;Living with Dinosaurs&quot; was written by Anthony Minghella, and directed by Paul Weiland, both of whom also worked on The StoryTeller. In the special, a socially awkward young English boy named Dom deals with his fears about his unemployed artist father (Lee), his pregnant mother (Vicky), and his asthma, with the help of his favorite doll, a stuffed dinosaur named Dog.\n\nAfter airing in the UK, the special was re-formatted to become an episode of The Jim Henson Hour. However, the series was cancelled before the reformatted version aired in the US.\n\nIn 2000, a pilot script was written for a new series based on Living With Dinosaurs, but it was never produced.\n\nThis semi-restored copy has Dutch subtitles and no end credits, but is otherwise the best copy of this rare special I've come across. I am still looking for a PAL copy without subtitles.\n\nI have also uploaded, on another disc, a lower-quality NTSC copy of the Living With Dinosaurs episode of The Jim Henson Hour, so be on the lookout for that.\n\nWritten by\tAnthony Minghella\nDirector\tPaul Weiland\n\nCast\nMichael Maloney as Lee\nJuliet Stevenson as Vicky\nGregory Chisholm as Dom\nBrian Henson as Dog the Dinosaur\nPatrick Malahide as Uncle Adrian\nDarren Bastable as Victor\nGwyneth Strong as Teacher\n\n------\n\n\nMiss Piggy's Hollywood (PAL DVD)\n\nMiss Piggy's Hollywood originally aired as the second half of episode 105 of The Jim Henson Hour, which first aired on May 14, 1989.\n\nIn this special, Miss Piggy and her associate producer Gonzo attempt to take viewers on a star-studded trip around Hollywood and fail miserably. The concept is built around how Hollywood is home of the &quot;family of the stars,&quot; but Piggy's encounters with actual stars are either near-misses (Bob Hope arrives after she's left) or rather one-sided (cornering George Wendt at his tailor's, while Justine Bateman shoves Piggy into a swimming pool).\n\nMeanwhile, Fozzie Bear tries to find his way to the famous nightclub, the Comedy Store, for a perpetually delayed special report. The show closes with a Miss Piggy-obsessed Dudley Moore finally meeting his idol and singing a duet with her, &quot;Our Love Is Here To Stay.&quot;\n\nFeatured Hollywood and Los Angeles locations include Grauman's Chinese Theater, Universal Studios, Rodeo Drive, the Tail o' the Pup hot dog stand, and even a brief glimpse of the Bullwinkle statue on sunset strip.\n\nMuppet performers: Frank Oz as Miss Piggy and Fozzie Bear, Dave Goelz as Gonzo and a comedian, Richard Hunt as Statler, Jim Henson as Waldorf and Jerry Nelson as an announcer.\n\nSpecial guest stars: Dudley Moore, George Wendt, Justine Bateman, and Bob Hope\n\nWith: Charles Dougherty, Don Draper, Karl Rumberg, Kathleen Wirt\n\nWritten by Bill Prady and Jim Lewis.\nDirected by Peter Harris.\n\n\n------\n\n\nSpecial Features\n\nThe Muppets at Walt Disney World (clip): More More More [VHS]\n\nThe Storyteller's Dog (Brian Henson) on BBC1 Red Nose Day: A Night of Comic Relief 2 (March 10, 1989) (With Lenny Henry,  Griff Rhys Jones) [VHS]\n\nDocurama &quot;Hands Up For More&quot; 10/6/91 clip featuring The Muppet Show and Living With Dinosaurs clips. (The complete show is included as a DVD-ROM extra.) [VHS]\n\nMuppet Babies opening and closing titles (VHS)\n\nA Muppet Family Christmas clips: Snowman, Babies, No Place Like Home, Happy Holidays Singalong (These scenes are omitted from current US DVDs due to music rights issues.) [DVD]\n","torrent":{"xt":"urn:btih:e0aeae37ffe3d336e89dfc7df35d9529b7813a64","amp;dn":"Jim+Henson+Muppets+Living+With+Dinosaurs%2C+Miss+Piggy%27s+Hollywood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0aeae37ffe3d336e89dfc7df35d9529b7813a64","infoHashBuffer":{"type":"Buffer","data":[224,174,174,55,255,227,211,54,232,157,252,125,243,93,149,41,183,129,58,100]},"announce":[],"urlList":[]}}