{"title":"[HotLegsAndFeet / DDFNetwork] Stella Cox , Brigitte (Knock, Knoc","uid":14687746,"size":383747182,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e111f320ea872bca7a2a627eda24391cd53b7267&amp;dn=%5BHotLegsAndFeet+%2F+DDFNetwork%5D+Stella+Cox+%2C+Brigitte+%28Knock%2C+Knoc&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"UniX","files":1,"time":1464158432,"description":"[HotLegsAndFeet / DDFNetwork] Stella Cox , Brigitte (Knock, Knock - It's Me, I'll Lick Your Sexy Feet And Toes!) SD **NEW MAY 25,2016**\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-4549_5745278E.html\r\n \nhttp://imgurx.net/share-8BC1_5745278E.html\r\n\r\nStella knocks on Brigitte’s door, but there’s simply no sign of that sexy brunette! The two wanted to head out, and it’s already late. The blonde Italian sexbomb tries again. This time, Brigitte opens the door. She is definitely not ready to go out, but she looks super sexy in her amazing lingerie, robe, and high heels! Stella is so attracted to her sexy lesbian friend, and after some hesitation, she starts touching that young college student’s silken skin! She gently massages her shaved pussy in the hallway of the hotel room! Slowly, she strokes along her beautiful girlfriend’s legs all the way down to her golden high heels. Stella can’t wait to lick her soles and touch that nylon with the tip of her tongue! Brigitte get’s wet and returns the favor with some foot in pussy sensation. The two hotties slowly take off their clothes and kneel on the red carpet while French kissing each other. The horny foot fetish lovers keep sucking their toes and cramming their shaved little twats with their nylon covered feet! Both babes exchange some pussy licking stimulation before taking off their pantyhose. They enjoy some barefoot sucking and toe licking. What a surprise! Stella brought two vibrators in her purse and the grande finale of today’s DDF Network XXX lesbian scene is an orgasm for both!","torrent":{"xt":"urn:btih:e111f320ea872bca7a2a627eda24391cd53b7267","amp;dn":"%5BHotLegsAndFeet+%2F+DDFNetwork%5D+Stella+Cox+%2C+Brigitte+%28Knock%2C+Knoc","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e111f320ea872bca7a2a627eda24391cd53b7267","infoHashBuffer":{"type":"Buffer","data":[225,17,243,32,234,135,43,202,122,42,98,126,218,36,57,28,213,59,114,103]},"announce":[],"urlList":[]}}