{"title":"Anima (DC Comics)","uid":5225985,"size":370093237,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e1171c29f9b62047e27f06739bcfea75e14172e4&amp;dn=Anima+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1261127043,"description":"Rebellious teenage runaway Courtney Mason acquired her miraculous powers following an attack by parasitic aliens: one of many New Blood superbeings created in this way, as part of the Bloodlines crossover.  Seven extraterrestrial predators had come to Earth and slaughtered thousands of humans by feeding on their spinal fluids. On the run in New Orleans, Courtney was kidnapped by a cult that sacrificed her to two of these insatiable parasites, knows as Pritor and Lissik. But Courtney did not die. Instead, the parasites' bites unleashed the Animus, a sentient-energy creature that can absorb the spirit essences of the living and the dead, which was now able to enter the world through Courtney. She became the embodiment of mankind's rage and masculine drive, and quickly developed awesome physical powers of her own. As Anima, Courtney sought revenge against the cult. She also met the Teen Titans and battled a variety of supernatural menaces. Anima remains a wanderer, traveling from place to place and helping those in need by calling upon the fearsome primal force inside her.\n\nAnima featured prominently in DC Comics' Bloodbath limited series (1993), in which all the New Blood characters teamed up to help defeat the alien parasites who had empowered them. The following year she showed up in the Zero Hour crossover.\n\nAnima's own title, beginning December 1993, ran for 16 months before being cancelled due to low sales (issues numbered 1-15, plus a #0 issue between #6 &amp; #7 in line with Zero Hour). It was an unconventional DC comic book, with the main theme being a war between metaphysical beings who embodied the Jungian archetypes of human psychology - Animus was only one of these. \n\nThe character Anima was nominated for the R.A.C. &quot;Squiddy&quot; Award for Favorite Comics Character in 1995, and the Anima comic series was nominated for the R.A.C. &quot;Squiddy&quot; Award for Favorite Ongoing Comics Series in 1995.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:e1171c29f9b62047e27f06739bcfea75e14172e4","amp;dn":"Anima+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1171c29f9b62047e27f06739bcfea75e14172e4","infoHashBuffer":{"type":"Buffer","data":[225,23,28,41,249,182,32,71,226,127,6,115,155,207,234,117,225,65,114,228]},"announce":[],"urlList":[]}}