{"title":"American Shooter (2012) (Epub and Mobi) Gooner","uid":13247229,"size":2559485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1ca2077614c2605bde0d5d4c45858a5186315fc&amp;dn=American+Shooter+%282012%29+%28Epub+and+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1453128794,"description":"Publisher: Potomac Books (February 1, 2012)\r\nLanguage: English\r\nISBN-10: 1597976903\r\nISBN-13: 978-1597976909\r\n\r\nGun ownership has long been a hot-button topic in the United States, and the National Rifle Association has the reputation of being an organization of primarily politically conservative members. American Shooter provides a unique look at gun ownership, handgun bans, shooting sports, and the controversy over how to interpret the Second Amendment from the point of view of a liberal gun owner and enthusiast. Gerry Souter examines the history of firearms in the United States, from the settlers who carried matchlock muskets ashore at Jamestown to the citizens who purchase guns in record numbers today. Recent Supreme Court decisions that uphold the right to bear arms have galvanized citizens on both sides of the debate, making the gun issue hotter than ever. To provide a personal view, Souter weaves in tales of his own experiences with guns, including sport shooting as a young man, hunting and bonding with his father, and facing the smoking end of a muzzle as an international photojournalist. American Shooter is both a history and a personal journey that traces the path of American gun ownership culture from the Revolution to today. It recounts how the country has lived with guns from the flintlock hung over the fireplace to the concealed-carry, laser-sighted Glock semiautomatic pistol tucked away in the hidden pocket of a mom’s purse","torrent":{"xt":"urn:btih:e1ca2077614c2605bde0d5d4c45858a5186315fc","amp;dn":"American+Shooter+%282012%29+%28Epub+and+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ca2077614c2605bde0d5d4c45858a5186315fc","infoHashBuffer":{"type":"Buffer","data":[225,202,32,119,97,76,38,5,189,224,213,212,196,88,88,165,24,99,21,252]},"announce":[],"urlList":[]}}