{"title":"An Introduction to Rubber Technology - Andrew Ciesielski","uid":12754440,"size":8768998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2511db5ab7be21ca5e475c12c56a3972b1f5d14&amp;dn=An+Introduction+to+Rubber+Technology+-+Andrew+Ciesielski&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1447426213,"description":"An Introduction to Rubber Technology - Andrew Ciesielski (Rapra Technology, 1999).pdf\r\n\r\nISBN: 1-85957-150-6\r\n\r\nAn Introduction to Rubber Technology is the ideal basic guide for anyone who is about to start working with rubber. This handbook has information about every aspect of using rubber from the initial selection of the rubber compound to the measurement of its physical properties. A brief history of the uses of natural and synthetic rubber is included but the bulk of the book concentrates on the compounding and processing of rubber to produce rubber products. The different types of rubbers and their properties are described and a detailed description of how to formulate rubber compounds including the use of additives, fillers, antioxidants and plasticizers is given. There are also chapters on how to process rubber and how to test both cured and uncured rubber. The chemistry, physics and engineering properties of rubber are described and how they relate to the final rubber compound is explained. The final chapter covers the preparation and use of castable polyurethanes. Each chapter is fully referenced and also includes an extensive bibliography","torrent":{"xt":"urn:btih:e2511db5ab7be21ca5e475c12c56a3972b1f5d14","amp;dn":"An+Introduction+to+Rubber+Technology+-+Andrew+Ciesielski","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2511db5ab7be21ca5e475c12c56a3972b1f5d14","infoHashBuffer":{"type":"Buffer","data":[226,81,29,181,171,123,226,28,165,228,117,193,44,86,163,151,43,31,93,20]},"announce":[],"urlList":[]}}