{"title":"Steer Madness w/ Patch 1.01C (May 2005) PC&amp;MAC","uid":6006787,"size":205054958,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e2534d1ab7e36cc9ac8537cccb7d074b0b69d25e&amp;dn=Steer+Madness+w%2F+Patch+1.01C+%28May+2005%29+PC%26MAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VeganFreak","files":-1,"time":1291344762,"description":"Video Trailer: y outube.com/watch?v=QWwD8zunS1o\nInstallation:\n\n1) Run Installer: Setup.exe with serial number 75630293\n2) Run Patch: SteerMadnessUpdate10c.exe (Patch date May, 2005)\n3) Run the game from your Start menu or Desktop, and enjoy!\n\nDisclaimer: Patch MUST be applied after installation, because this will correct many bugs and computer freezes that otherwise make the game unplayable beyond certain levels, like the Theatre mission.\n\n\n    Author............: Veggie Games Inc. (Jonathan Skinner)\n    Website...........: Expired and Spammed:( http://www.steermadness.com )\n    Website 2.........: Expired and Spammed:( http://www.veggiegames.com )\n    Game Release Date.: December, 2004\n    Compatibility ....: PC &amp; Mac compatible\n    Language .........: English\n    Review ...........: http://www.gametunnel.com/html/reviews-214.html\n    File Size.........: 195 MB\n    Age Rating .......: Suitable for all ages, non-violent\n    Serial Number ....: 75630293\n\n / Synopsis:\n \nSteer Madness is a fully-featured 3D action-adventure game. You play as Bryce the Steer who narrowly escaped the slaughterhouse. Now liberated, you are on a mission to save your animal friends!\n\n\n / Features:\n \n- Large interactive city environment to explore.\n- Easy to play.\n- Captivating storyline.\n- Indy music soundtrack, featuring Angie Inglis, Anita Athavale, Feisty, Hector and The Winks.\n- Non-violent gameplay.\n- Suitable for all ages.\n\n\n ====================================\n   Detailed summary From Wikipedia:    \n ====================================\n\n\n / Gameplay:\n \nSteer Madness is a single-player game where the player assumes the role of Bryce the Cow, a walking, talking bovine determined to put an end to animal exploitation and turn everyone vegetarian. During gameplay, the player goes on a series of missions to save the animals using many different tactics. The game is based in an open city environment and features several transportation methods, with gameplay similar to the game Grand Theft Auto (without the guns or violence). Players have the option to walk, use a bicycle or drive (in select missions) through the city to get to different areas of the game. Missions involve many gameplay elements, including climbing, jumping, racing, puzzle solving and operating heavy machinery.\n\n / Development:\n \nSteer Madness was developed in Vancouver, BC, Canada, by the independent game developer Veggie Games Inc. The majority of the game was made by just one person, Veggie Games Inc. founder Johnathan Skinner. This includes all of the programming (which was done from scratch), story, design and a significant portion of the artwork. He worked on the game in his spare time for about a year and a half while working other jobs, then decided to focus all his time into finishing and publishing the game. He registered the company (Veggie Games Inc), got a small office and hired an artist to help. After about 6 months of full-time development and the help of a few student interns, the game was complete and ready for release.\n\nMusic for the game was licensed from local independent artists, including Angie Inglis, Anita Athavale, Feisty, Hector and The Winks. Voice acting was done with the help of friends who were convinced to read lines into a microphone while sitting inside a little box which was sound-proofed with swatches of carpet and pillows.\n\nTaking the self-publishing route, game CDs were printed in small batches and sold through the website. Various animal rights groups in Canada, USA, UK and Germany purchased wholesale quantities in order to resell the game CDs through their online stores as a form of fundraising.\n\n / Awards:\n \nSteer Madness received two awards shortly after it was released. The first award was Best Animal-Friendly Video Game from the 2004 PETA Proggy Awards, and the second was Innovation in Audio from the 2005 Independent Games Festival.\n\n==========================================================\n\nUploader's note:\n\nThis torrent was uploaded Dec. 2010 to ThePirateBay, and as of this date the authors' websites no longer exist - it looks like spammers or maybe an animal exploitation company bought their old web addresses. \n\nAdditionally, this game doesn't appear to be available for purchase anywhere. I *would* like to remind people who really like Steer Madness that they can buy it to support the author and encourage future development - but since it's unavailable and forgotten about - you may as well download and enjoy!\n\nSurely this amazing one-of-a-kind game will be appreciated by vegans, vegetarians, the animal rights community, and compassionate people in general throughout our world.\n\n==========================================================\n\nEULA\n\nSteer Madness(TM) End User License Agreement:\n\nThis software and content is Copyright (C) 2004 Veggie Games Inc., all rights reserved.  All music is copyrighted by the respective owners.  With the exception of content being used for review purposes, none of the contents my be copied or reprinted without permission.  &quot;Steer Madness&quot; is a trademark of Veggie Games Inc.\n\nAny similarities to events or persons living or dead is purely coincidental.\n\nThis software is provided &quot;as is&quot; without any warranties or guarantees of any kind.  The authors cannot be held responsible for any undesirable effects caused directly or indirectly from the use of this software.\n\n==========================================================\n","torrent":{"xt":"urn:btih:e2534d1ab7e36cc9ac8537cccb7d074b0b69d25e","amp;dn":"Steer+Madness+w%2F+Patch+1.01C+%28May+2005%29+PC%26MAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2534d1ab7e36cc9ac8537cccb7d074b0b69d25e","infoHashBuffer":{"type":"Buffer","data":[226,83,77,26,183,227,108,201,172,133,55,204,203,125,7,75,11,105,210,94]},"announce":[],"urlList":[]}}