{"title":"Messages from the Masters (gnv64)","uid":7897092,"size":7194453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e39e81c689f1c16eca1cd46f9a31639916ef0f3b&amp;dn=Messages+from+the+Masters+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1354871307,"description":"Messages from the Masters: Tapping into the Power of Love\nBy Dr. Brian Weiss\nPiatkus April 2001 ISBN 978-0-799-2167-5 PDF 262 pages 8 mb &lt;a href=&quot;\nhttp://www.amazon.com/Messages-Masters-Tapping-into-Power/dp/0446676926&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Messages-Masters-Tapping-into-Power/dp/0446676926&lt;/a&gt;\nscanned to PDF by me.\n\nFrom the author of the international bestseller Many Lives, Many Masters comes a spiritual guidebook that shows you how to capture the healing energy of love. In this important new work, written in his usual engaging style, Dr Brian Weiss reflects on dozens of fascinating cases from his files and draws on the wisdom of the spirit guides known as The Masters to explore a variety of topics:\n- Immortality, reincarnation and the nature of the soul\n- How to transform your life, your relationships and your self\n- Destiny and your true purpose\n- Your own past lives, and how to uncover them\n- Inner peace, health, happiness and fulfilment\n\nAuthor and physician Brian Weiss first delved into the realm of past-life therapy in his highly successful and controversial book Many Lives, Many Masters. Although he has since developed a huge following in the field of &quot;regression therapy&quot; (in which clients are hypnotized in order to access previous lifetimes), Weiss has focused this latest book on the here and now. &quot;Past lives are still a significant concept and value for me, but understanding and expressing love, joy, and inner peace in my everyday life have become more significant,&quot; Weiss explains.\nWeiss, who is now an internationally sought-after lecturer, uses his teaching voice to address happiness and love in our current lifetimes. This is indeed a &quot;how-to&quot; book, packed with ambitious discussions on why we choose to &quot;come back&quot; to our current lives and the role of fate. He also devotes many chapters to spiritual self-help, showing readers why it's important to let go of anger, develop a loving spiritual family, and cultivate love and compassion. No, these are not new or original concepts. But those who liked the past-life visions and riveting anecdotes in Many Lives, Many Masters will find themselves equally riveted.\nDr Brian Weiss is a psychiatrist who lives and practises in Florida, USA. He is a graduate of Columbia University and Yale Medical School and the former Chairman of Psychiatry at the Mount Sinai Medical Centre in Miami, Florida. He is the bestselling author of Many Lives, Many Masters, Only Love Is Real and Through Time Into Healing (all published by Piatkus).\n\nNOTE: I have already scanned &amp; uploaded his book 'Many Lives, Many Masters' earlier along with the audiobook on 18/02/2012.","torrent":{"xt":"urn:btih:e39e81c689f1c16eca1cd46f9a31639916ef0f3b","amp;dn":"Messages+from+the+Masters+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39e81c689f1c16eca1cd46f9a31639916ef0f3b","infoHashBuffer":{"type":"Buffer","data":[227,158,129,198,137,241,193,110,202,28,212,111,154,49,99,153,22,239,15,59]},"announce":[],"urlList":[]}}