{"title":"Somewhere in the Night 1946 DvdRip Mp4 Lee1001","uid":10402048,"size":821173720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3b97df0feb0af24bbbda0fa380404d1d8b26f51&amp;dn=Somewhere+in+the+Night+1946+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1403382743,"description":"Somewhere in the Night 1946 DvdRip Mp4 Lee1001 &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0038965/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0038965/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Somewhere_in_the_Night_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Somewhere_in_the_Night_(film)&lt;/a&gt;\nFilm noir aficionados -- and just plain fans of good older films -- will relish Somewhere in the Night, a classic of the genre whose very title promises high contrast black-and-white photography, a hero plopped into a world in which lies and truths are difficult to identify and plenty of danger and suspense. It's all there, along with other familiar noir trappings like the femme fatale.\n \nJoseph L. Mankiewicz (pre - A Letter To Three Wives and All About Eve and only his 2nd directorial effort) turns a low budget 'B' cast with quintessential &quot;amnesia victim&quot; ploy into Film Noir excellence. Actually the villains, anti-heroes and conventions of Noir were just formulating with this little 1946 gem. It actually helped define the genre. A complex film, evenly paced and excellent performances from the likes of John Hodiak (as a soldier who returns to the front with his amnesia slowly determining if, in his former life, he may or may not have been a murderer), Lloyd Nolan and the ever faithful Noir companion - Richard Conte. Lets not forget the ladies - watch for Nancy Guild who had never acted before being signed to a movie contract - she is perfect noir. What pure fun and future influences on this &quot;Black Cinema&quot; that we love so much.\n\nA slickly directed, intriguing thriller that constantly surprises and throws up one final twist just when you think it has no more tricks to turn.\n\nOur Noire friend,Richard Conte.\n\nAnd Lloyd Nolan.\nHodiak as a marine blown up at Okinawa who returns to Los Angeles armed only with a name that means nothing to him and a letter from a girl, now dead, who hated him. Out of this familiar premise, Mankiewicz has fashioned a classic film noir account of the amnesiac who suspects he isn't going to like rediscovering the man he once was. His odyssey in quest of himself leads through a long dark night with murder and a missing $2 million dollars at the end of it, peopled along the way by the lost and the lonely, the suave and the sinister (wonderful supporting performances) and taking in a series of suitably clammy settings (waterfront fortune-telling parlour, mission hall, sanatorium for the insane). Mankiewicz's superb control of a complex plot (as both writer and director) takes him into at least one outstanding set piece: an elaborate nightclub sequence in which Hodiak questions a bartender, the latter casually tips off two hoods, a bowl of pretzels is slipped down the bar to identify the target, and just as something is about to explode, the lights dim as the band strikes up a new number...\n\nVIDEO\nSize.... 783mb\nDuration.... 01:43:44\nCodec.... avc1\nFrame Width.... 592\nFrame Height.... 432\nData Rate.... 926kbps\nFrame Rate.... 25 F/S\nAUDIO\nBit Rate.... 124kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:e3b97df0feb0af24bbbda0fa380404d1d8b26f51","amp;dn":"Somewhere+in+the+Night+1946+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3b97df0feb0af24bbbda0fa380404d1d8b26f51","infoHashBuffer":{"type":"Buffer","data":[227,185,125,240,254,176,175,36,187,189,160,250,56,4,4,209,216,178,111,81]},"announce":[],"urlList":[]}}