{"title":"I Spit On Your Corpse I Piss On Your Grave (xvid101-sickboy88) a","uid":3320323,"size":732837888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3c3b1f34898dcd2a036fde1073a6e951035ac29&amp;dn=I+Spit+On+Your+Corpse+I+Piss+On+Your+Grave+%28xvid101-sickboy88%29+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sickboy88","files":1,"time":1114209074,"description":"I Spit On Your Corpse, I Piss On Your Grave (2001)\n\nIMDB Link:\n\nhttp://www.imdb.com/title/tt0325597/\n\nFilm Threat Review: (Possible SPOILERS!)\n\nhttp://www.filmthreat.com/Reviews.asp?Id=3256\n\n----\n\nHow far is sickboy88 willing to go?  Is it true that he has snuff films?  \n\nThese are some questions that have been floating around recently...\n\nBaby steps...baby steps people....Let's work our way up the ladder first. ;)\n\nWe'll start with this movie...\n\n----\n\nI Spit On Your Corpse, I Piss On Your Grave:\n\nThis movie is DISGUSTING.  In the first 20 minutes, you get to see cigarette burns to the penis (full frontal male nudity), someone forced to eat their own shit at gunpoint, as well as multiple deaths.\n\nYes, that's right...someone takes a shit on the floor (a very pudding like shit, might I add) and laps it up...they actually eat their own shit off of the floor.\n\nThis movie has it all...I don't want to give it all away, but if you want to see the whole plot and shit, then read the Film Threat Review, who's link is posted above.  Be warned however, that it contains many spoilers that may ruin the movie for you.\n\nNow, it should be known, that this IS a cult kind of film...it is VERY GONZO in appearance, but if you can get past that, I am sure you will enjoy this movie.\n\nWhen I first saw it, I found myself saying out loud: HAHA I CAN'T BELIEVE THIS SHIT! OH MY GOD...I CAN'T BELEIVE THIS IS IN A MOVIE!\n\nVery offensive...very sick.\n\n----\n\nMini Plot:\n\nSandy has stumbled onto a lair of torture and humiliation. She was abducted and brought to this pit of pain as the next intended victim. But Sandy overthrows her captor and kills him. Does she release the other prisoners? Does she call the police? No. Her mind snaps and she assumes control over the prisoners, taking them as her own playtoys. Naked bodies writhe in ecstasy as blood runs down the walls in this chilling tale of madness and revenge. I SPIT ON YOUR CORPSE, I PISS ON YOUR GRAVE is a swirl of insanity, a carnival of carnage, a festival of filth, and an onslaught of sleaze! Also starring JEFF ATWATER, D.J.VIVONA\n\n----\n\nEncoded by: sickboy88\nCodec: XviD 1.0.1\nBitrate: 1233 kb/s AVG\nAspect: 640x480 = 1.33:1 = 4:3\nAudio: English, 128 VBR Stereo @ 48K Hz\nSubtitles: None\nRuntime: 01:11:12\nFPS: 23.976\n","torrent":{"xt":"urn:btih:e3c3b1f34898dcd2a036fde1073a6e951035ac29","amp;dn":"I+Spit+On+Your+Corpse+I+Piss+On+Your+Grave+%28xvid101-sickboy88%29+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3c3b1f34898dcd2a036fde1073a6e951035ac29","infoHashBuffer":{"type":"Buffer","data":[227,195,177,243,72,152,220,210,160,54,253,225,7,58,110,149,16,53,172,41]},"announce":[],"urlList":[]}}