{"title":"The Godfather Trilogy (converted from HD DivX)  Michael Rizzo","uid":5921797,"size":3679580989,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3d50949b058e90154ca8a5a7532c665c0754862&amp;dn=The+Godfather+Trilogy+%28converted+from+HD+DivX%29++Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1288445245,"description":"If you do have or expect to soon have, an HD capable DivX disc player\nI suggest you might want to download our HD version of this movie set instead.\nWe have many seeders on it right now, with a great many completions already\naccomplished too.\n\nIf you instead only have a standard DivX capable dvd player, then you can come\npretty close to the real thing (I dare you to tell the difference in the majority\nof such cases - the quality is incredible - as it is all converted from bluray \n720p source files, to a nicer file size for you). \n\nThese versions (including our HD version) give you the closest thing to being\nin a movie theater I can tell you. Since they aren't showing these movies at the\ntheaters much anymore, enjoy!\n\nWe have long since paid for these movies, and not every family that deserves to see this piece of culture should have to fork over a hundred bucks for bluray (or whatever the price of the discs are now) or have to buy an expensive player to boot.\n\nWe see it as a tax of sorts, we also think we have collectively paid off these movies for everyone to enjoy this version we bring to you.\n\nFor those who have the dough to fork over, go ahead and make the studios richer-\nhowever they  aint doin anything worthwhile with our dough as I write this comment.\n\n\nMichael Rizzo Chessman\n\n\nGodfather I, II and III along with great songs from the movies \nin a separate folder\n\nPlease share - and we do have speed at this time - if we all pull together. \nGrazie\n","torrent":{"xt":"urn:btih:e3d50949b058e90154ca8a5a7532c665c0754862","amp;dn":"The+Godfather+Trilogy+%28converted+from+HD+DivX%29++Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d50949b058e90154ca8a5a7532c665c0754862","infoHashBuffer":{"type":"Buffer","data":[227,213,9,73,176,88,233,1,84,202,138,90,117,50,198,101,192,117,72,98]},"announce":[],"urlList":[]}}