{"title":"Time-Life Records &quot;The Swing Era&quot; MP3 (320) Complete","uid":9538043,"size":3660640984,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e40c4691878c20b6e06294f82bf88837ef90993a&amp;dn=Time-Life+Records+%26quot%3BThe+Swing+Era%26quot%3B+MP3+%28320%29+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KadrianBlackwolf","files":441,"time":1390967149,"description":"Time-Life Records &quot;The Swing Era&quot; MP3 format (320), complete.\n\nAll music from the CDs in MP3 files.\nMusic from the &quot;Encore!&quot; LP album, which was never released on CD, in MP3 files.\nPromotional Flexidisc MP3 file.\nScans of all of the 64-page books included with the LP sets.\nScans of all booklets included with the CDs.\nColor album art.\n\nTime-Life Records first issued &quot;The Swing Era&quot; in 1970 as a subscription set of fourteen three-LP albums, each with a corresponding 64-page book. The records do not contain the original music from the original bands of the thirties and forties but are faithful reproductions played by contemporary bands and recorded using (at the time) modern stereo equipment. The set proved to be one of Time-Life's most popular collections and was released three more times, with the later releases including a fifteenth album added to the series. The last LP release was in the mid 1980s.\n\nIn the late 1990s, several of the most popular songs from the series were released on two 2-CD sets and sold on the retail market as &quot;Swingtime&quot; and &quot;Swingtime II&quot;. They were intended to be a &quot;best of&quot; compilation, and at the time of their release there were no plans to release the rest of the music on CD. After seeing buyers' response to the &quot;Swingtime&quot; set, Time-Life made the decision to release another dozen 2-CD sets, containing most of the rest of the music.  For reasons that remain unclear, the music from one of the original LP sets, &quot;Encore!&quot;, was never released on CD.\n\nThe original albums are long out of publication, and for whatever reason, the CDs have not been in publication for many years. Sets and individual albums are available from used record and CD sellers and on eBay from time to time, but many of the individual albums are rare and expensive. The fact that they are still in great demand shows that &quot;The Swing Era,&quot; and Swing in general, remains popular with listeners today.\n\nIncluded in this torrent are MP3 files of all of the music released on CD, as well as MP3 versions of the songs released only on the &quot;Encore!&quot; LP. Also included is an MP3 file of the original promotional Flexidisc and .JPG files of all of the books included with the LPs as well as the booklets from the CDs. I've also included the color pictures I used for the artwork in the MP3 files.\n\nI don't make many torrents and creating this one was an ambitious and time-consuming project. I hope everything turns out right.\n\nComments Welcome!","torrent":{"xt":"urn:btih:e40c4691878c20b6e06294f82bf88837ef90993a","amp;dn":"Time-Life+Records+%26quot%3BThe+Swing+Era%26quot%3B+MP3+%28320%29+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e40c4691878c20b6e06294f82bf88837ef90993a","infoHashBuffer":{"type":"Buffer","data":[228,12,70,145,135,140,32,182,224,98,148,248,43,248,136,55,239,144,153,58]},"announce":[],"urlList":[]}}