{"title":"Kenny G - Duotones 320cbr (Big Papi) 1986 Arista","uid":9461507,"size":114022857,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e493d129fa397c251e8f88a6dec6826305e25b68&amp;dn=Kenny+G+-+Duotones+320cbr+%28Big+Papi%29+1986+Arista&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389362141,"description":"Source: 1986 CD\n\nBy Dr.Muhammad\nI have read all the reviews of Kenny G's Duotones album. First of all, certainly even his harshest critics would agree that it was this album that launched Kenny into superstardom. So, it a fine reference point, without disregarding his earlier work, to start with in any evaluation of his career.\n\nAs a fan of classical jazz (I'm still living and feeling jazz from the late 1950's thru the late 1960's), I absolutely love Miles Davis, John Coltrane, Theo. Monk, Joe Henderson, Wes Montgomery, Chet Baker(who I'd like to come back to in one moment), Clifford Brown, Charlie Mingus, Lionel Hampton, Louis Armstrong, Stan Getz(especilly his Bossa Nova work with Joao Gilberto, Astrud Gilberto, and the late,immortal legend-Antonio Carlos Jobim), Lee Morgan, Errol Garner,Ornette Coleman (who I will also mention again), Herbie Hancock, Charlie &quot;Bird&quot; Parker, Dizzy Gillipsie, Theo. Monk, Nat Adderley, and the 1970's works (especially &quot;Breezin&quot;) of George Benson. The list of jazz greats is endless...\n\nTo try to compare Kenny G to the aforementioned innovators, or to even try to compare him to electronic/fusion artists like Return to Forever, Weather Report, or the classic work of Miles Davis during this era (especially &quot;Bitches Brew) would be similar to measuring a new group on the music scene against the debut album of Van Halen, or trying to measure the Eagles against the Beatles, its really different eras. Moreover, its a mistake to compare contemporary jazz to classical jazz. They are not the same sport-but they are both birthed from the early works of giants like Jelly Roll Morton. (contemporary jazz is an outgrowth of classical jazz, some prefer the more contemporary sound, I happen to prefer the older sound, but that doesn't mean I hate contemporary jazz) Is Miles Davis better than Jelly Roll Morton? Or is what Miles did with Jazz a continuation of the evolutionary movement in music that continued with Mr. Morton from even earlier influences?\n\nOkay, so, having said those things, I am not saying Kenny G is the evolution of jazz, I am just trying to show that when one tries to compare people in the same genre of music to one another, its impossible to really do that. And Kenny G is not even the same genre as Jelly Roll Morton or Miles Davis. Where would Jazz be without any of the influence of early folk, blues, or Classical music? No one would try to really compare Miles Davis to Beethoven, other than to probably say they were both geniuses. Depending upon your musical preference you might chose one over the other-personally they are two great masters who I feel are right next to each other in their love of music.\n\nI mentioned Chet Baker. In Chet Baker's day, he was often said to be the best trumpet player in Jazz. He was consistently ranked over Miles Davis. Chet Baker was personally embarrassed by this. He knew that because he was white and Miles was black there was a lot of racism and some who were hoping for &quot;the great white hope&quot; in Jazz. BUT-this does not mean that Chet Baker was not a brilliant jazz artist. If a person heard Chet Baker play and heard Miles play, in my opinion-they would have to say Miles was the greater master. But, if they chose Chet-without regard to race, it could be a function of their liking what he played in terms of song selection, tone, pitch, style, etc.\n\nWe need to get beyond trying to put down artists because they don't equal something or aren't someone. People have to find their own voice and be judged on their work. Just because we have difficulty classifying an artist's music does not mean the music is nothing. Kenny G's music can be classified as easy listening, instrumental, jazz instrumental work, contemporary jazz, r &amp; b jazz, pop-jazz, etc. What this really means is that Kenny G's music, in borrowing a bit from all of these great musical forms is bearing witness to the beauty of music. I consider Kenny G to be Jazz in that context(Contemporary Jazz-NOT classical), because Jazz has in it elements of many great aspects of music. The movie &quot;Ray&quot; showed how Ray Charles used gospel influences and country and western to give a very different musical intepretation to r &amp; b. Contemporary jazz is the same-and it has the certain sub categories that Mr. Kenny G fits within. He would not fit into the sound of the 1950's and 1960's. He is earlier work before this release was more along the lines of funk music. Another great example-Grover Washington, Jr.-also got a lot of criticism. Yet mysteriously, he is never spoken of so badly as Kenny G. He also had lighter sounds, and would not fit within the music of the 1950's.\n\nI find the issue of the different treatment of Kenny G and Grover Washington, Jr. (and I'm a huge Grover fan!) to be very interesting. As a Black man in America, I know a lot about racism. Yet, I think, at times, there is a reverse issue. Grover got some flak for being contemporary-funky jazz, yet, people would say &quot;he is a jazz artist.&quot; Along comes Bob James or Kenny G-both of whom are white, and people want to say &quot;oh, these white boys can't play.&quot; I beg to differ. Larry Bird was a great basketball player. He is white. Why do we have to try to create some little niche by even addressing his race. Certainly at times, he was heralded in an unfair way because of his race by the some. On the other hand, it was not like he, Kevin Mchale and Danny Ainge from Boston were not on their job, playing as a team, alongside Dennis Johnson and Rober Parish. Sometimes we need to just accept talent as talent, and not always have to push race or imply someone is getting accolades because of their race. Yes, Kenny G sold more than the late Grover Washington, Jr. and yes Grover deserved more recognition than he received, but Kenny G didn't do this to Grover, its the the world we live in. While acknowledging and trying to correct the problem of racial issues in the coming years, we need to not be so ultra sensitive to every little thing. Just my two cents.\n\nSome people like Wynton Marsalis. Certainly he is very talented. I did not, however, like his hostile comments against his brother, Branford Marsalis, when Branford played jazz with Sting. Wynton is a purist-he felt jazz was being corrupted. Branford felt rock or pop music is full enough to encompass jazz elements within a song. If you don't like Kenny G because you are a jazz purist and don't really care for contemporary jazz in any format, then say that. But don't deny the beauty of the music to people by purposefully not giving the full story of Kenny G.\n\nOrnette Coleman, when he released both &quot;Free Jazz&quot; and &quot;The Shape of Jazz to Come&quot; was widely criticized. Today, both of these cd's are considered jazz classics. Kenny G, to my knowledge, has never tried to say he is better than any of the Jazz giants. Rather, he has just put his music out and done his best to please his audience. There are people who never would have had an ear for jazz or listened to contemporary r &amp; b with having first heard the lighter side of contemporary jazz provided by Kenny G.\n\nWhen this album came out, I realized two things. First, even though I think I was only like 14 or 15, I knew it was great music. I also knew that if this great music, with the very contemporary sound and lighter notes was so good-I had to really dwelve further back into classical jazz, classical music, r &amp; b, etc.\n\nWhen Kirk Franklin made &quot;urban gospel&quot;-he was heavily criticized. However-he reached an audience which maybe would have never listened to gospel, and then, the mind of that audience was awakened to the possibility that some of the older music-that influenced Kirk Franklin-might actually be okay to listen to.\n\nSo, please, readers, bear these things in mind, when you read the reviews that give this cd a 1 or 2 star review-its all about perspective, historical reference, and giving respect those who broaden the doors so we can all walk thru them, not try to close doors.\n\nOkay-now-the cd review goes like this: (smile)\n\n1)Songbirds is a great song and it was played (and still is) on the radio so much, and is a beautiful song-one of Kenny G's best and most popular\n\n2)Midnight Motion-another big hit from the cd, great song, a long of rotation easy listening stations and jazz stations as well (the same as song #1)\n\n3)Don't Make Me Wait For Love-I join the other reviewer, the person who sings all the songs on this album-who is it-I don't know! But great voice, and great song. An excellent love song!\n\n4 &amp; 5-very good slow music songs-also very popular on late night radio\n\n6)Pretty good song &quot;What does it take&quot;\n\n10) &quot;You Make Me Believe&quot;-this is my favorite song on the entire cd-a great wedding song, great love song general.\n\nThis entire album, and I've skipped some songs-is great-it truly is a cd you can put in and just let play and you might find that it has played thru several times before you even want to change it. Most modern cds you have to skip songs-this is one you just pop in and late it play!","torrent":{"xt":"urn:btih:e493d129fa397c251e8f88a6dec6826305e25b68","amp;dn":"Kenny+G+-+Duotones+320cbr+%28Big+Papi%29+1986+Arista","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e493d129fa397c251e8f88a6dec6826305e25b68","infoHashBuffer":{"type":"Buffer","data":[228,147,209,41,250,57,124,37,30,143,136,166,222,198,130,99,5,226,91,104]},"announce":[],"urlList":[]}}