{"title":"Betty Carter - Feed the Fire (1993) [Jazz][mp3 320][h33t][schon5","uid":4750332,"size":175969896,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5a1f33e1b47daec981bc363df5844f65f38d463&amp;dn=Betty+Carter+-+Feed+the+Fire+%281993%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"schon55","files":17,"time":1236148368,"description":"Betty Carter - Feed the Fire\nRecorded live at Royal Festival Hall, London, UK\nOriginal Release Date: October 30, 1993 \nLabel: Verve - 1994\nTotal time: 73:03\nBitrate: 320 kbps\n\nTaken from a live 1993 performance in London, Feed the Fire is an album filled with surprises. Betty Carter is known for her practice of featuring hot new up-and-coming musicians in her bands, but on this recording she is accompanied by established, world-class talent: Geri Allen, Dave Holland, and Jack DeJohnette. Dave Holland demonstrates why he is one of the greatest living bassists with his unerring sense of melody and pitch. Jack DeJohnette, an acknowledged master of the drums for 30 years, is nothing less than explosive, punctuating the solo statements of his bandmates with powerful flurries. Allen's touch is reminiscent of Keith Jarrett's at times, such as on her excellent solo on 'Love Notes.' Although Carter shares the spotlight unselfishly, her own contributions are clearly the focal point of Feed the Fire. On the fantastic title track, Allen sets up a percolating rhythmic figure, joined by Holland and DeJohnette. Then Carter enters, scatting her way through the changes, eschewing singing in the traditional sense. Her vocal improvisations are on par with any instrumentalists, a claim one cannot make about many singers. On ballads, such as the exquisite 'Lover Man,' Carter soars, caressing the melodies with a satin touch, dancing around the music with impeccable phrasing, dropping low into her register for punctuation. It is heady, hypnotizing stuff. Feed the Fire is an interesting album, with many wonderful moments, such as the unison ascending figures in 'Sometimes I'm Happy' or the Carter/DeJohnette duet of 'What Is This Tune?' However, it is not perfect, and tends to drag toward the end. Tracks go on for too long, and, as wonderful as Carter's singing is, and as compelling as it is to listen to the interaction of these four great musicians, the quality of the music itself tends to wander a bit. Nevertheless, it is a strong album, well worth searching out. ~ Daniel Gioffre, AMG\n\nYou've got here the best example of what a jazz cd should be according to me : diversity, hits, complexity, deconstruction, exploration, swing, Music, Musicians... 'Feed the Fire' is to Betty Carter what Sassy Swings the Tivoli is to Sarah vaughan or what Ella In Berlin is to Ella Fitzgerald. This is her masterpiece ( no surprise that this cd is out of stock, everybody wanted it, but what is Verve waiting for to reissue it????  I ve only got a used cassette-tape- of the concert ).... Please note that you've got a spectacular second set with high level duets (Jack DeJohnette/ Betty, Geri Allen / Betty and impressive Dave Holland with my favorite female ! As soon as it is reissued, don't wait! Go for it ! ~ R. Frederic\n\nBetween the snap and pop of Jack DeJohnette's drums, the rich foundation of Dave Holland on bass, and Geri Allen's haunting piano geometries, Betty Carter emerges alive, vivid, and enthralling. The energy of this record is overwhelming and delicious -- an under-appreciated masterpiece. ~ dcadams\n\nPersonnel:\nBetty Carter (Vocals) \nGeri Allen (Piano) - 1-6,9 \nDave Holland (Double Bass) - 1-5,7,9 \nJack DeJohnette (Drums) - 1-5,8,9 \n\nBetty Carter - Feed the Fire Tracks:\n01  Feed the Fire (Geri Allen) 11:19 \n02  Love Notes (Mark Zubek/Betty Carter) 7:10 \n03  Sometimes I'm Happy (Vincent Youmans/Clifford Grey/Irving Caesar) 3:32 \n04  Lover Man (Jimmy Davis/Roger Ramirez/Jimmy Sherman) 9:12 \n05  I'm All Smiles (Michael Leonard/Herbert Martin) 5:25 \n06  If I Should Lose You (Leo Rabin/Ralph Rainger) 6:23 \n07  All or Nothing at All (Jack Lawrence/Arthur Altman) 8:10 \n08  What Is This Tune? (Betty Carter/Jack DeJohnette) 7:19 \n09  Day Dream (Billy Straihorn/Duke Ellington) 12:08 \n10  B's Blues (Betty Carter) 2:20 \n","torrent":{"xt":"urn:btih:e5a1f33e1b47daec981bc363df5844f65f38d463","amp;dn":"Betty+Carter+-+Feed+the+Fire+%281993%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a1f33e1b47daec981bc363df5844f65f38d463","infoHashBuffer":{"type":"Buffer","data":[229,161,243,62,27,71,218,236,152,27,195,99,223,88,68,246,95,56,212,99]},"announce":[],"urlList":[]}}