{"title":"Android Ice Cream Sandwich 4.0 for Vmware 7/8 (will work on MAC ","uid":7003906,"size":849276078,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e61890cf99424944ca66437a9023ead7d2914443&amp;dn=Android+Ice+Cream+Sandwich+4.0+for+Vmware+7%2F8+%28will+work+on+MAC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"psspss","files":3,"time":1328196316,"description":"Android Ice Cream Sandwich 4.0 for Vmware 7/8 (will work on MAC or PC in virtual environment)\n\nThis is the result of hard work from the guys at Android X86\nbuilding Live CDs and VM ports for PC and Laptops/\nsee their website and google groups for help\nIts not my work but I did customising and get some bits working.\nI thought I share my build to save some time\n\nknown bugs in the build.. it times out in 30min and\nyou cant unlock the phone (you slide the lock on screen)\nyou will have to power of the vmware and reboot if happens\nalso rebooting it comes in portrait.. and the mouse is\nreversed also.. makes it a tricky beast.. but move\nup to the rotation locker app and click it and get\nto click LANDSCAPE will fix it in place until\nyou reboot or some app somehow undoes it again. it can be fun!\nthey are minor issues though\n\nyou can experience the full Android 4.0 as if its a real\nphone without the sensors and 3G of course\nand Wifi but it has a special LAN ethernet built\nin which works in Bridge mode or NAT mode\n\nso what works SOUND, VIDEO and Internet and PEER TO\nPEER Tool like AndSMB\n\nhas some games pre installed some apps dont work\nas use ARM direct accessing and this OS kernel\nis x86! inTel CPU\n\nalso no google market but theres an alternative\nplus you can google and download any direct APKs\nand install them via file manager\n\nI use AndSMB to connect to my NAS system and laptops\nwindows shares where I stored my backup of apps.\n\nit flies on a i7 PC :)\n\nhow to get it to work\n\n1) first you need to source VMWARE 7.14 or VMware 8.04\nworkstation (search p2p for it)\n\n2) Unrar the contents to any drive\n\n3) start vmware and drag the file inside the Android X folder\nending in .VMZ to the favourites side bar and it will\nsimply add it\n\n4) now edit the settings and disable the ISO for cdrom\ni didnt include it as its already installed on this\nhard drive image\n\n5) then just click PLAY and enjoy Android and the\napps on it\n\nits ROOTED (super usered) also so be careful use snapshots in vmware\nif playing with mods.\n\nenjoy AND HELP ME SEED THIS ! cheers\n\nPS\nyou may have to say copied it when starting it\non a new pc.. it best to force stop as I doubt it start up\nfirst time. it will hang i bet.. click restart should work then\nbut watch out for the portrait and mouse weirdness i said above :)\nand how to get it sorted if happens.\n\nlet me know how you get on\n","torrent":{"xt":"urn:btih:e61890cf99424944ca66437a9023ead7d2914443","amp;dn":"Android+Ice+Cream+Sandwich+4.0+for+Vmware+7%2F8+%28will+work+on+MAC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e61890cf99424944ca66437a9023ead7d2914443","infoHashBuffer":{"type":"Buffer","data":[230,24,144,207,153,66,73,68,202,102,67,122,144,35,234,215,210,145,68,67]},"announce":[],"urlList":[]}}