{"title":"Julius Hemphill - One Atmosphere (2003)","uid":6601980,"size":262244861,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e664338f05e373115c042dbeedd6754286165847&amp;dn=Julius+Hemphill+-+One+Atmosphere+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mariorg","files":-1,"time":1313241485,"description":"Tzadik, Composer Series: TZ 7090 &lt;a href=&quot;\nhttp://www.tzadik.com/index.php?catalog=7090&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tzadik.com/index.php?catalog=7090&lt;/a&gt;\n\n* Julius Hemphill: composer\n\n* Pheeroan ak Laff: Drums And Percussion\n* Tim Berne: Alto And Baritone Sax\n* Robert DeBellis: Tenor Sax, Flute, Clarinet\n* Marty Ehrlich: Soprano And Alto Sax, Flute\n* Erik Friedlander: Cello\n* Sam Furnace: Soprano And Alto Sax, Flute\n* Oliver Lake: Soprano And Alto Sax, Flute\n* Ursula Oppens: Piano\n* J.D. Parran: Baritone Sax, Flute, Clarinet\n* Aaron Stewart: Tenor Sax, Flute\n\n* Pacific String Quartet\n\n\nReview\n~~~~~~\n\nby Thom Jurek\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/julius-hemphill-one-atmosphere-r651368&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/julius-hemphill-one-atmosphere-r651368&lt;/a&gt;\n\nHats off to Tzadik for this long overdue album of Julius Hemphill's creative\nmusic compositions. Here are three works, ranging in date from 1976 to 1992, for\nthree different instrumental settings. The first, &quot;One Atmosphere,&quot; is one of\nhis most compelling pieces, written for piano and string quartet. The Pacifica\nString Quartet, a group synonymous with modern music, and the legendary vanguard\npianist Ursula Oppens offer the premiere of this work, a subtle, nearly pastoral\nrange of tonal studies for groups of strings laid out along droning, shimmering\nostinatos with Oppens accenting the end of each written line with a restatement\nof not only the original notes but their contrapuntal extensions on into the\nnext. Near the end, the piece erupts with strings and piano elongating the\noriginal ideas, stating them in almost serial phrases. &quot;Savannah Suite,&quot; a\nmid-length work for cello, flute, and percussion, concentrates on the\ninterrelationships of the various kinds of lyric tones and rural themes that\nobsessed Hemphill throughout his life. Cellist Erik Friedlander, flutist Marty\nEhrlich, and the great Pheeroan akLaff perform it with great economy and\nemotion. Here the blues are the centerpiece. The final piece here, a\n33-and-a-half-minute work for seven woodwinds, receives its premiere. Played by\nformer students like Tim Berne, collaborators such as Oliver Lake, and downtown\nstalwarts such as Sam Furnace, this is easily the most monumental and\nbreathtaking piece of music Hemphill ever composed. Full of lines that seemingly\nbegin in the ether and go nowhere, only to be retraced later on by different\ninstruments and varying time signatures crossing numerous musical eras, this is\na labyrinthine work that is the epitome of Hemphill's musicality and deep,\nalmost reverential dedication to the wind family.","torrent":{"xt":"urn:btih:e664338f05e373115c042dbeedd6754286165847","amp;dn":"Julius+Hemphill+-+One+Atmosphere+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e664338f05e373115c042dbeedd6754286165847","infoHashBuffer":{"type":"Buffer","data":[230,100,51,143,5,227,115,17,92,4,45,190,237,214,117,66,134,22,88,71]},"announce":[],"urlList":[]}}