{"title":"FFH The Paris Commune 1871","uid":9394183,"size":181369916,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:e67304be25374f2ff64e7d21fce81cebe265ec5d&amp;dn=FFH+The+Paris+Commune+1871&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stew_dent","files":2,"time":1387947903,"description":"The Paris Commune (32:00)\n\nParis in 1871 was a city of stark contrasts: Napoleon III and his Empress Eugenie ruled over a splendid Court; the Universal Exhibition was celebrating the miracles of the Machine Age; Baron Haussmann, redesigning Paris to create avenues splendid both for the vista and for the effective firing of cannons, had unleashed a speculative fever in Parisian real estate; and the poor, squeezed by industrialization, were squeezed beyond the point of no return when they were forced by higher rents to vacate their living quarters. These were the pre-conditions; the Franco-Prussian War, the siege of Paris, and finally the armistice with Bismarck was the spark that ignited the battle. The Commune was born, and for one bloody week there was talk of all those hopeless dreams of mankind: the brotherhood of man and the end of bureaucracy and exploitation. This program shows the conditions that gave rise to the Commune, the Communards, and the indescribably brutal manner in which the rest of France put an end to the Bloody Week of the Commune. (32 minutes)","torrent":{"xt":"urn:btih:e67304be25374f2ff64e7d21fce81cebe265ec5d","amp;dn":"FFH+The+Paris+Commune+1871","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67304be25374f2ff64e7d21fce81cebe265ec5d","infoHashBuffer":{"type":"Buffer","data":[230,115,4,190,37,55,79,47,246,78,125,33,252,232,28,235,226,101,236,93]},"announce":[],"urlList":[]}}