{"title":"Soul II Soul - Keep On Movin' (US) 1989 [FLAC] - Kitlope","uid":5287678,"size":280628262,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e7c4b83d68565723898026b8f3057a11ecae0e9e&amp;dn=Soul+II+Soul+-+Keep+On+Movin%5C%27+%28US%29+1989+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Kitlope","files":13,"time":1263775811,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: E7C4B83D68565723898026B8F3057A11ECAE0E9E\nFile Size: 267.62 MB\nYear: 1989\nLabel: Virgin\nCatalog #: 91267-2\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nSoul II Soul were a British double award-winning Grammy act that emerged from London at the end of the 1980s . The group initially attracted attention as a sound system, playing records at house and street parties (where their clothing style - dubbed &quot;Funki Dred&quot; - quickly made a splash, inspiring them to start a line of clothing). Founded by Jazzie B and featuring a changing roster of other musicians - notably Nellee Hooper, Simon Law, Phillip 'Daddae' Harvey and Caron Wheeler - Soul II Soul's experiments in music-making of their own resulted in the dub plate &quot;Fairplay,&quot; which secured them a deal with Virgin Records. They had huge hits in 1989 with the singles &quot;Keep on Movin'&quot; and &quot;Back to Life (However Do You Want Me)&quot;, both from their debut album Club Classics Vol. One. These songs (both featuring Wheeler on vocals) set the tone for early 1990s mainstream dance music in the UK.\n\nDoreen Waddell, a former singer with Soul II Soul living in Clarendon Villas, Hove, died after being hit by three cars while fleeing from a shoplifting incident. The 36-year-old, who left behind a four-year-old son, sang some lead vocal parts on Soul II Soul's 1989 Club Classics Vol. One album.\n\nTheir follow-up album, Vol. II: 1990 - A New Decade, yielded the hits &quot;Get A Life&quot; and &quot;A Dream's A Dream,&quot; the latter featuring operatic vocals by Victoria Wilson-James. While their U.S. following declined somewhat following its release, Soul II Soul continued to have hits in the UK, including 1992's #4 single, &quot;Joy.&quot;\n\nSoul II Soul reached Volume 5 of their series for Virgin in 1995, then released two more albums for Island Records.\n\nIn October 2004 &quot;Keep on Movin&quot; appeared in the videogame Grand Theft Auto: San Andreas, playing on R&amp;B, Soul radio station, CSR 103.9.\n\nThe Soul II Soul Sound System featuring Caron Wheeler toured Australia nationally in February 2009. They are also playing the Playground Weekender Festival near Sydney, New South Wales. The group are currently finishing up recording sessions for their seventh album to be released in 2009.\n\nSoul II Soul will be performing live at the Yasalam free concerts in conjunction with the 2009 Formula 1TM Etihad Airways Abu Dhabi Grand Prix celebrations at the end of October 2009.\n\nOn 2 December 2008 a programme on Soul II Soul appeared on BBC Radio 4.\n\nThe daughter of former member Melissa Bell, Alexandra Burke, was the winner of the 2008, fifth season of the UK television talent competition/show, The X Factor[1].\n\n\n\n\n\n\n\n\nKeep on Moving (US); Club Classics Vol One (UK) 1989\n\n\nClub Classics Vol. One is a 1989 album by the British group Soul II Soul. The album was released to great critical acclaim following three top 20 singles - &quot;Fairplay&quot;, &quot;Keep on Movin'&quot; and &quot;Back to Life (However Do You Want Me)&quot; (the latter was also a UK number 1). In the United States, the album was originally called Keep on Movin'.\n\nThe record spawned one more hit - &quot;Jazzie's Groove&quot; - before vocalist Caron Wheeler decided to leave the group. Like many other albums recorded around that time, such as Black Box's Dreamland, other songs from the record became club hits despite not being released as singles; &quot;Holdin' on&quot; was especially popular in London clubs.\n\nIn 2000 Q magazine placed Club Classics Vol. One at number 49 in its list of the 100 Greatest British Albums Ever.[citation needed]\n\nIn October 2004, &quot;Keep on Movin'&quot; appeared in popular videogame Grand Theft Auto: San Andreas, playing on fictional New Jack Swing radio station CSR 103.9.[citation needed]\n\n\n\n\nTracks:\n\n\n1\tKeep on Movin'\n2\tFairplay (Featuring Rose Windross)\n3\tHoldin' on (Bambelela)\n4\tFeeling Free (Live Rap)\n5\tAfrican Dance\n6\tDance\n7\tFeel Free (Featuring Do'Reen)\n8\tHappiness (Dub)\n9\tBack to Life (A cappella)\n10\tJazzie's Groove\n\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:e7c4b83d68565723898026b8f3057a11ecae0e9e","amp;dn":"Soul+II+Soul+-+Keep+On+Movin%5C%27+%28US%29+1989+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7c4b83d68565723898026b8f3057a11ecae0e9e","infoHashBuffer":{"type":"Buffer","data":[231,196,184,61,104,86,87,35,137,128,38,184,243,5,122,17,236,174,14,158]},"announce":[],"urlList":[]}}