{"title":"DinoSystem v0.4.8.0","uid":12243712,"size":158818406,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e828ab6265a0bdcc1f616e753320e44025bea17c&amp;dn=DinoSystem+v0.4.8.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1439841739,"description":"What is DinoSystem?\nDinoSystem is a 2D, top-down ecosystem and survival simulation that allows players to either manage the ecology of a randomly generated island (inhabited by dinosaurs), or survive in it as a human, dealing with realistic survival mechanics, and with a deep character progression system that tracks how your character's body adapts over time.\nAn emergent, living world:\nEverything on the island is subject to biological and physical rules, and nothing comes from nothing: will you hunt the last dinosaur of its species for a steak, or will you protect it from extinction and make sure its eggs hatch? These are the dilemmas you'll face in the game, as long as YOU don't get extinct.\nDevelopment:\nTo see all the features planned for the full release and the ideas we are considering, please check the development roadmap, and feel free to join the discussion and make suggestions!\nGame Modes:\n\n    God: Manage the island ecology, change the weather, trigger devastating events, and see how the ecosystem adapts. NOTE: God mode still lacks a proper GUI and tools to fully interact with the world; expect it to be expanded throughout the Early Access phase.\n    Survival: Join the island as a stranded human, see how long you can survive as part of it, and how your body changes in the process; the game offers the option to play either with &quot;casual&quot; or &quot;hardcore&quot; difficulty. NOTE: there is no story yet as a background for the Survival mode, we're still working on it, and you can help us find a good one!","torrent":{"xt":"urn:btih:e828ab6265a0bdcc1f616e753320e44025bea17c","amp;dn":"DinoSystem+v0.4.8.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e828ab6265a0bdcc1f616e753320e44025bea17c","infoHashBuffer":{"type":"Buffer","data":[232,40,171,98,101,160,189,204,31,97,110,117,51,32,228,64,37,190,161,124]},"announce":[],"urlList":[]}}