{"title":"3,2,1 Cinta SDTVRip","uid":6507523,"size":327412569,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8f3f024b28936813bbe40a0a0334940dbd07100&amp;dn=3%2C2%2C1+Cinta+SDTVRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zaini711","files":-1,"time":1309518530,"description":"Pengarah: Azhari Mohd Zain\n\nPenerbit: Metrowealth Movies Production Sdn. Bhd.\n\nDipawagam: 16 Jun 2011\n\nPelakon 3,2,1 CINTA:\nDiana Amir\nFarid Kamil\nPierre Andre\nMustapha Kamal\nSheila Mambo\nZila Bakarin\nRuzaidi Abdul Rahman\n\n\nMENGISAHKAN Sam, anak gadis yang berpewatakan kasar seperti lelaki yang baru sahaja berpindah untuk menyambung pelajaran di sebuah kolej. Dia bertemu semula dengan kawan baik semasa sekolah iaitu Fariz di situ. Dalam masa yang sama, Sam mula ditakut-takutkan dengan fakta bahawa dengan sikap kasarnya itu, dia akan ditakuti oleh semua lelaki dan dia akan bersendirian sampai mati.\n\nIni Secara kebetulan, Sam terserempak dengan Nazril, lelaki idaman seluruh kolej. Dia tercabar dengan sikap Nazril yang hanya melayan perempuan cantik sahaja menyebabkan dia tekad untuk memikat Nazril. Pelbagai peristiwa yang melucukan dan romantis berlaku sepanjang usaha Sam untuk memikat Nazril termasuk cuba merubah penampilan dan sikap kasarnya. Dalam masa yang sama, hubungan Sam dengan bapa tirinya dan adik tirinya, Mimi juga semakin pulih dan erat. Akhirnya, Nazril jatuh cinta dengan kesungguhan Sam apabila Sam sanggup membantunya untuk menguruskan rumah anak yatim yang dibinanya.\n\nSam juga sanggup mengajar anak-anak yatim itu dengan caranya yang tersendiri. Namun, rupa-rupanya Fariz selama ini menyintai Sam dalam diam. Fariz meluahkan perasaannya pada Sam. Sam yang keliru dengan luahan Fariz itu cuba berfikir kembali tentang perasaan dirinya terhadap Fariz dan Nazril. Dan ketika Nazril pula meluahkan perasaan kepada Sam, Sam sedar dan yakin siapa sebenarnya yang harus dipilihnya.\n\nPlease donate or show support by visiting\n  &lt;a href=&quot;\nHTTP://URSHOP.COM.MY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHTTP://URSHOP.COM.MY&lt;/a&gt;","torrent":{"xt":"urn:btih:e8f3f024b28936813bbe40a0a0334940dbd07100","amp;dn":"3%2C2%2C1+Cinta+SDTVRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f3f024b28936813bbe40a0a0334940dbd07100","infoHashBuffer":{"type":"Buffer","data":[232,243,240,36,178,137,54,129,59,190,64,160,160,51,73,64,219,208,113,0]},"announce":[],"urlList":[]}}