{"title":"Ian Rankin Books (25) -Mobi,KK","uid":6753544,"size":12636704,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb012b300e75ffda716e9910e793d7e2469772a2&amp;dn=Ian+Rankin+Books+%2825%29+-Mobi%2CKK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1318955851,"description":"Ian Rankin Books (25) -Mobi,KK\n\n\nBorn in the Kingdom of Fife in 1960, Ian Rankin graduated from the University of Edinburgh in 1982, and then spent three years writing novels when he was supposed to be working towards a PhD in Scottish Literature. His first Rebus novel was published in 1987, and the Rebus books are now translated into twenty-two languages and are bestsellers on several continents.\n \nIan Rankin has been elected a Hawthornden Fellow, and is also a past winner of the Chandler-Fulbright Award. He is the recipient of four Crime Writers' Association Dagger Awards including the prestigious Diamond Dagger in 2005. In 2004, Ian won America's celebrated Edgar Award for 'Resurrection Men'. He has also been shortlisted for the Edgar and Anthony Awards in the USA, and won Denmark's Palle Rosenkrantz Prize, the French Grand Prix du Roman Noir and the Deutscher Krimipreis.\n \nIan Rankin is also the recipient of honorary degrees from the universities of Abertay, St Andrews and Edinburgh.\n \nA contributor to BBC2's 'Newsnight Review', he also presented his own TV series, 'Ian Rankin's Evil Thoughts'. He recently received the OBE for services to literature, opting to receive the prize in his home city of Edinburgh, where he lives with his partner and two sons.\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:eb012b300e75ffda716e9910e793d7e2469772a2","amp;dn":"Ian+Rankin+Books+%2825%29+-Mobi%2CKK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb012b300e75ffda716e9910e793d7e2469772a2","infoHashBuffer":{"type":"Buffer","data":[235,1,43,48,14,117,255,218,113,110,153,16,231,147,215,226,70,151,114,162]},"announce":[],"urlList":[]}}