{"title":"FIFA.Manager.13-RELOADED","uid":7799806,"size":6081854741,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ebff584ec52471db88eb83fa49e597ceb708e91f&amp;dn=FIFA.Manager.13-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deepstatus","files":-1,"time":1352249128,"description":"As a manager in FIFA Manager 13 you have complete control over the\n management of a modern football club. In the game you are responsible for\n the line-up, the tactics and training of your team, for signing the right\n players and the extension of your club facilities and the stadium. The\n special highlights in FIFA Manager 13 are the FIFA license, the FIFA 3D\n engine, more than 40,000 licensed players, many of whom come with original\n player pictures, the player manager and national team manager mode, the\n Create-a-Club mode and the Match Prognosis Tool as well as a unique,\n comprehensive editor.\n\n Team dynamics:\n * FIFA Manager 13 comes alive with a team analysis feature called\n   &quot;Team Matrix&quot;, as well as a hierarchy pyramid, which allows you to\n   visualize which players are facing challenges in the team pecking order.\n   In the Team Dynamics section you get an overview of team hierarchy,\n   rivalry, personality clashes, personal goals, family relationships and\n   much more.\n * Your assistant manager helps you to analyse the team, and requesting a\n   psychological profile of a player before signing him might help avoid\n   future problems\n * The new individual player objectives have a special role, and your team\n   will be successful only with enough team leaders and everyone pulling in\n   the same direction. From balancing player rivalries to spending enough\n   time understanding and setting player expectations, FIFA Manager 13 will\n   push you to perfect the art of team management.\n \n Player objectives:\n * Every player of the team has his personal objectives. Some want to become\n   a first team regular, others want to play for their country\n\n\n\nGame Info\n\nPlatform:  Windows\n\nLanguage:  English, French, German\n\nMultiplayer:  No\n\nPublisher:  Electronic Arts\n\n\nPC System Requirements\n\n   OS : Windows XP SP3 / Windows Vistaâ„¢ SP2 / Windows 7\n\n   CPU: 2,4 GHz\n\n   Memory: 1 GB\n\n   Video Memory: ATI Radeon 9500 Pro 128 MB / NVIDIA GeForce 6600 256 MB, Shader Model 2.0\n\n   HDD: 8 GB\n\n   DirectX: 9.0c\n\n\n\nINSTALLATION:\n\n\n1. Unrar.\n  2. Burn or mount the image.\n  3. Install the game.\n  4. Copy the cracked files from the Crack directory on the disc to the\n      directory, overwriting the existing exe.\n  5. Before you start the game, use your firewall to block all exe files in\n     the games install directory from going online.\n  6. Play the game. While in game, avoid all of the online options. If you\n     have Origin installed, it may start it up. If that happens, ignore the\n     prompt, play offline, and don't login.\n  7. Enjoy!","torrent":{"xt":"urn:btih:ebff584ec52471db88eb83fa49e597ceb708e91f","amp;dn":"FIFA.Manager.13-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebff584ec52471db88eb83fa49e597ceb708e91f","infoHashBuffer":{"type":"Buffer","data":[235,255,88,78,197,36,113,219,136,235,131,250,73,229,151,206,183,8,233,31]},"announce":[],"urlList":[]}}