{"title":"Dari (Afghan) Persian Grammar and Phrase Book","uid":7138814,"size":606781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecf2132a181fc2f5c96191f1ee529b9114fa641f&amp;dn=Dari+%28Afghan%29+Persian+Grammar+and+Phrase+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GlennAppler","files":1,"time":1332894149,"description":"Dari (Afghan) Persian Grammar and Phrase Book\nEhsan M. Entezar (2010)\n--\nISBN:\nHardcover\n978-1-4500-9931-8\nSoftcover\n978-1-4500-9930-1\nEbook\n978-1-4500-9932-5\n--\n\nIn Amazon Kindle format AZW, with no DRM.\n\nTo read on your computer, one good option is to use open-source Calibre http://calibre-ebook.com/\n\n--\nDari Grammar &amp; Phrasebook is the result of many years research and teaching. It has two parts. \n\nPart one (grammar) is a systematic presentation of Dari sound system(phonology, word formation (morphology) and sentence structure (syntax). Each chapter begins with an introduction. This is followed by analysis of the new concepts providing plenty of examples and illustrations. Next comes the chapter summary. Each chapter in part one ends with exercises.\n\nPart two (phrasebook) is about how to communicate with Afghans on a variety of situations(topics). This part first discusses language functions such as asking, ordering, requesting, apologizing, persuading, and so on. The second part is about topics or situations involving shopping, health, transportation, security, government and so on. The relevant vocabulary under each topic are listed into nouns, verbs and adjectives. The topics also include cross-cultural notes and proverbs.\n--\n\nAbout the Author\n\nDr. Entezar received his Ph.D. from the University of Texas at Austin in applied linguistics, his M.A. from Columbia University Teachers College in teaching English as foreign language and his B.A from Kabul University in English. He has taught at Kabul University, Ibn Saud Islamic Univerisity, Riyadh, Saudi Arabia, the University of Nebraska at Omaha, Arkansas State, Jonesboro, Arkansas, and Fayetteville Community College, Fayetteville, North Carolina. He wrote the first Dari book, Farsi(Afghan Persian) for the US. Peace Corps in 1964. Subsequently, he wrote Intermediate Dari (1965) and Dari (1969). Professor Entezar has written numerous articles on the nature of language, bilingualism and language teaching methodology. He is the author of Afghanistan 101: Understanding Afghan Culture (2008).\n---\nDari Persian:\n\nDari (Afghan) Persian is the lingua franca of Afghanistan, understood by upwards of 90 percent of the population. It is the native tongue of about half the population, and has long been the language of educational instruction in Afghanistan. Along with the Pashtun language 'Pashto', Dari is an official language of Afghanistan.\n\nDari is closely related to Iranian Persian (often called Farsi), and Tajiki (spoken in Tajikistan); all three dialects are mutually intelligible. \n","torrent":{"xt":"urn:btih:ecf2132a181fc2f5c96191f1ee529b9114fa641f","amp;dn":"Dari+%28Afghan%29+Persian+Grammar+and+Phrase+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecf2132a181fc2f5c96191f1ee529b9114fa641f","infoHashBuffer":{"type":"Buffer","data":[236,242,19,42,24,31,194,245,201,97,145,241,238,82,155,145,20,250,100,31]},"announce":[],"urlList":[]}}