{"title":"American literature - fiction books from 1800 to 1950","uid":13265925,"size":262072562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecf3012e3e5e72dc16eb468142b6da13d0becf3c&amp;dn=American+literature+-+fiction+books+from+1800+to+1950&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whitecat2010","files":484,"time":1453337118,"description":"About the collection\r\n====================\r\n\r\nThis is my collection of American literature from the 18th century to 1950. There are no fantasy and science fiction books, though: those will be the object of a separate torrent.\r\n\r\n[b]Formats[/b]\r\nThe books are mainly in .epub and .pdf, because I don't own a Kindle and I dislike the very idea of a proprietary format and e-reader which binds you as its slave, in exchange for the low price. I usually go for ereaders which support the greatest number of formats. \r\n\r\nNaming\r\n======\r\n\r\nThe folders are by author’s surname. As for the files themselves, my naming convention is different than found in collections that come from Calibre. I don’t like it when the books are by book title and not by author, because then if you don’t have enough books by the same person to make a special author folder, finding what you want is much easier if all works by the same author are grouped together.\r\n\r\nSources\r\n=======\r\n\r\nThese are not my own scans or OCR. They have been collected over many years from the web, either from huge messy book torrents containing a bit of everything or from free download sites such as gutenberg, and a bunch of them came with my e-readers. \r\n\r\nMy only merit is organizing. I picked those which belong to this category from the chaos of most book torrents, and renamed them consistently to prune out doubles and make search easy. I’ve taken out meaningless folder numbers, deleted .opf and other useless files. In many cases I’ve added a .txt file with info about authors, added author’s year of birth and death. \r\n\r\nYou might find some books twice: usually because one is a scan of a regular book and the other one with the blown-up font used for e-readers, or sometimes one will include a cover and the other won’t. .. things like that. The collection is not compressed, so if these things don’t matter to you, feel free to skip downloading one of the two","torrent":{"xt":"urn:btih:ecf3012e3e5e72dc16eb468142b6da13d0becf3c","amp;dn":"American+literature+-+fiction+books+from+1800+to+1950","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecf3012e3e5e72dc16eb468142b6da13d0becf3c","infoHashBuffer":{"type":"Buffer","data":[236,243,1,46,62,94,114,220,22,235,70,129,66,182,218,19,208,190,207,60]},"announce":[],"urlList":[]}}