{"title":"Miracles and Massacres - Glenn Beck - Audiobook MP3 CBR 64K","uid":10325244,"size":310821525,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ed3b2f9fb9ec7315fdf88ea00f1ba2a879f75274&amp;dn=Miracles+and+Massacres+-+Glenn+Beck+-+Audiobook+MP3+CBR+64K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1402351120,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nMiracles and Massacres: True and Untold Stories of the Making of America\n\nWritten by: Glenn Beck\nNarrated by: Ron McLarty, Glenn Beck\nLength: 10 hrs and 46 mins\nFormat: Unabridged\nRelease Date:11-19-13\nProgram Type: Audiobook\n\nThomas Edison was a bad guy and bad guys usually lose in the end.\n\nWorld War II radio host Tokyo Rose was branded as a traitor by the U.S. government and served time in prison. In reality, she was a hero to many.\n\nTwenty U.S. soldiers received medals of honor at the Battle of Wounded Knee - yet it wasn't a battle at all; it was a massacre.\n\nPaul Revere's midnight ride was nothing compared to the ride made by a guy named Jack whom you've probably never heard of.\n\nHistory is about so much more than memorizing facts. It is, as more than half of the word suggests, about the story. And, told in the right way, it is the greatest one ever written: Good and evil, triumph and tragedy, despicable acts of barbarism and courageous acts of heroism.\n\nThe things you've never learned about our past will shock you. The reason why gun control is so important to government elites can be found in a story about Athens that no one dares teach. Not the city in ancient Greece, but the one in 1946 Tennessee. The power of an individual who trusts his gut can be found in the story of the man who stopped the twentieth hijacker from being part of 9/11. And a lesson on what happens when an all-powerful president is in need of positive headlines is revealed in a story about eight saboteurs who invaded America during World War II.\n\nMiracles and Massacres is history as you've never heard it told. It's incredible events that you never knew existed. And it's stories are so important and relevant to today that you won't have to ask, Why didn't they teach me this? You will instantly know. If the truth shall set you free, then your freedom begins on at the start of this audiobook. By the end, your understanding of the lies and half-truths you've been taught may change, but your perception of who we are as Americans and where our country is headed definitely will. ","torrent":{"xt":"urn:btih:ed3b2f9fb9ec7315fdf88ea00f1ba2a879f75274","amp;dn":"Miracles+and+Massacres+-+Glenn+Beck+-+Audiobook+MP3+CBR+64K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed3b2f9fb9ec7315fdf88ea00f1ba2a879f75274","infoHashBuffer":{"type":"Buffer","data":[237,59,47,159,185,236,115,21,253,248,142,160,15,27,162,168,121,247,82,116]},"announce":[],"urlList":[]}}