{"title":"Joao Gilberto - Joao (1991) [Jazz Bossa][mp3 320][schon55]","uid":5202171,"size":122429007,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eda08ba824069ecbbad674e6dcd456c94d3c4308&amp;dn=Joao+Gilberto+-+Joao+%281991%29+%5BJazz+Bossa%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":23,"time":1260217768,"description":"Joao Gilberto - Joao \nYear: 1991\nLabel: Philips (1991)\nTotal time: 50:26\nQuality: 320 kbps\n\nRecent but classic jazz-bossa is played by one of its defining spirits.  Vocally, Gilberto is in fine muttering form, communicating intensely with somebody in his breast pocket, and his guitar is as delicate as ever.  This recording expresses the close links of bossa nova and jazz.  Joao has Clare Fisher arranging and on some cuts playing keyboards, along with one of those saccharin string-sections even the most avant-garde Brazilians love. ~ John Storm Roberts, AMG\n\nIt should not suprise me that this CD is relatively uncovered by reviewers.  In the best sense of the term, I would suggest that this is the definitive &quot;Joao With Strings&quot; recording of his later career.  The recording of Joao's vocals and guitar are really well done, and Joao is singing perhaps as good as he ever has (has he ever not?).  The real surprise here are the string arrangements done by Clare Fischer, who also handles the keyboard work.  For the most part, the arrangements are complimentary and done much in the style of Jobim's early arranging work.  Recorded in 1991, there are a few 'synth' tracks done by Fischer that work very well.  One is a 'classical guitar' patch which serves as an intro, and it took a few seconds (and an audible 'attack' on the keyboard) before I realized that it was not Joao.  My only regret about this CD is that the strings were added in L.A. after Joao had recorded his vocal and guitar in Rio.  No, it isn't a sin and still works well, but truly working with an orchestra - the way Sinatra did - HAS to bring out the best of even the best.  One of my favorite tracks is &quot;Una Mujer&quot;, also. ~ Douglas Negley, Amazon.com\n\nThis 1991 record ended a decade-plus silence from the man who helped create bossa nova.  Though JOAO features full orchestral backing, the arrangements by Clare Fischer dart in and around Gilberto's understated singing and rhythmically ingenious guitar work, never overpowering the artist or obscuring his unique vision.  The effect is not unlike that achieved by Nelson Riddle in his orchestrations for Frank Sinatra.  Though Gilberto tackles a tune in French ( &quot;Que Reste-T-Il de Nos Amours&quot; ) and a Cole Porter classic in English ( &quot;You Do Something to Me&quot; ), even these are presented in the bossa nova style to which he has remained true throughout his career.  The delicate beauty of Gilberto's voice, the soft-but-insistent pulse of his guitar, and the otherworldy grace of his artistic conception are as much in evidence on JOAO as they are on his legendary recordings from 30 years prior.  As ever, the man proves to be simply incapable of making a wrong move. ~ CDUniverse\n\nPersonnel:\nJoao Gilberto (Acoustic Guitar and Vocals) \nClare Fischer (Keyboards) \nJoe Correro (Drums) \nJim Hughart (Double Bass) \nMichito Sanchez (Percussion) \n\nJoao Gilberto - Joao Tracks:\n01  I Really Samba (Eu Sambo Mesmo) (Janet de Almeida) 4:09 \n02  Go On (Siga) (Fernando Lobo/Helio Guimares) 4:14 \n03  Little Rose (Rosinha) (Jonas Silva) 3:52 \n04  Malaga (Fred Bongusto) 5:02 \n05  A Woman (Una Mujer) (Paul Misraki/S. Pontal Rio/C. Olivari) 3:43 \n06  My Heart And I (Eu E Meu Coracao) (Inaldo Vilarinho/Antonio Botelho) 5:12 \n07  You Do Something To Me (Cole Porter) 2:42 \n08  Unhappy Remark (Palpite Infeliz) (Noel Rosa) 3:56 \n09  Ave Maria on the Hill (Ave Maria No Morro) (Herivelto Martins) 4:16 \n10  Sampa (Caetano Veloso) 5:03 \n11  Smiled at Me (Sorriu Para Mim) (Caroto/Luiz Claudio) 3:08 \n12  I Wish You Love (Que Reste-T-Il De Nos Amours) (Charles Trenet/Leon Chauliac) 5:02 \n\n","torrent":{"xt":"urn:btih:eda08ba824069ecbbad674e6dcd456c94d3c4308","amp;dn":"Joao+Gilberto+-+Joao+%281991%29+%5BJazz+Bossa%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda08ba824069ecbbad674e6dcd456c94d3c4308","infoHashBuffer":{"type":"Buffer","data":[237,160,139,168,36,6,158,203,186,214,116,230,220,212,86,201,77,60,67,8]},"announce":[],"urlList":[]}}