{"title":"Wangan Midnight Complete 26 Episodes","uid":4888070,"size":6177192080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ede4e89842bc664dad6fb57d8a40b898c999f395&amp;dn=Wangan+Midnight+Complete+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JimNils","files":26,"time":1241821328,"description":"One day, Akio Asakura, a high school student who is in his last year of study, is driving his friend's Fairlady Z (Z31) when he is challenged by Tatsuya Shima, a doctor, in his black Porsche 911 (964), nicknamed the &quot;BlackBird&quot;.\n\nWith his friend in the passenger seat and two girls in the back, Akio attempts to win, but is defeated. Determined to become faster, he goes to the junkyard because his mechanic friend tells him he saw a wrecked Fairlady S30 just like Akio wanted. \n\nWhen he sees the damaged midnight blue Fairlady Z (S30) in the junkyard, he remembers seeing this car a few years ago with a nice girl in the passenger seat. Intrigued as to why such a classic Japanese performance vehicle is about to be junked, he convinces the junkyard owner to sell it to him. \n\nThe junkyard owner was told by the previous owner's sister to scrap the car because it is cursed. He soon finds that the car is unnaturally fast due to a tuned L28 engine, bored and stroked to 3.1 L and fitted with twin turbos. \n\nHe also finds that the car's previous owner shares his first AND last name, and had died in a horrible crash on the Wangan. \n\nEvery person who takes possession of the Z ends up spinning out of control and crashing, as if the car is rebelling against its driver. This gives the blue Z the nickname &quot;The Devil Z&quot;.....\n\nEnjoy\n\n\n(Only compiled by me and nothing else)\n","torrent":{"xt":"urn:btih:ede4e89842bc664dad6fb57d8a40b898c999f395","amp;dn":"Wangan+Midnight+Complete+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ede4e89842bc664dad6fb57d8a40b898c999f395","infoHashBuffer":{"type":"Buffer","data":[237,228,232,152,66,188,102,77,173,111,181,125,138,64,184,152,201,153,243,149]},"announce":[],"urlList":[]}}