{"title":"Confronting the State, UFLA's Quest for Sovereignty [PDF] [Storm","uid":10029821,"size":3326489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee34f29c9bffe12f6669c872f7ce57892c85eed2&amp;dn=Confronting+the+State%2C+UFLA%27s+Quest+for+Sovereignty+%5BPDF%5D+%5BStorm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1398319723,"description":"Author: Nani Gopal Mahanta\nSeries: SAGE Studies on India's North East\nHardcover: 388 pages\nPublisher: SAGE Publications Pvt. Ltd; 1 edition (August 27, 2013)\nLanguage: English\nISBN-10: 8132107047\nISBN-13: 978-8132107040\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\n\nConfronting the State: ULFA s Quest for Sovereignty examines the complex nuances and dynamics that make ULFA (United Liberation Front of Assam) a formidable insurgent group in India. It argues that to understand the phenomenon of insurgency, one has to understand the genesis of conflict between the Indian State and the state of Assam right from the very inception of the nation-state. \nThe author claims that the ideological and identity issues between India and Assam have remained unresolved and ULFA is a manifestation of that unresolved crisis. He explains that ULFA represents a mindset, a suppressed voice, which is deeply engrained in Assam s psyche. The declining support base of ULFA is not to be seen in its numerical strength; it represents the unmet aspirations of the tribal and ethnic groups of Assam. \nThe book tries to go beyond a ULFA-centric solution and dwells upon the issues of illegal migration, human development and the need for the protection of a composite society in Assam. It also deals with the 2012 (July September) violent conflict in Bodoland over the issue of illegal migration and quest for a homogenous homeland. It tries to bring forward a framework of durable solution to the illegal migration issue in the state by contesting the existing discourse.","torrent":{"xt":"urn:btih:ee34f29c9bffe12f6669c872f7ce57892c85eed2","amp;dn":"Confronting+the+State%2C+UFLA%27s+Quest+for+Sovereignty+%5BPDF%5D+%5BStorm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee34f29c9bffe12f6669c872f7ce57892c85eed2","infoHashBuffer":{"type":"Buffer","data":[238,52,242,156,155,255,225,47,102,105,200,114,247,206,87,137,44,133,238,210]},"announce":[],"urlList":[]}}