{"title":"The Age Of Turbulence - Alan Greenspan","uid":4035334,"size":7706889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee5e7d006295de18fc6bdf92d7530570b545916b&amp;dn=The+Age+Of+Turbulence+-+Alan+Greenspan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jorpcolombia","files":2,"time":1203398716,"description":"[BRAINLOVERZ]\n\n=========================================================================================================\n\nTITLE: The Age of Turbulence: Adventures in a New World\nAUTHOR: Alan Greenspan (http://en.wikipedia.org/wiki/Alan_Greenspan)\n\n\nDESCRIPTION: \n\nIn the immediate aftermath of September 11, 2001, in his fourteenth year as Chairman of the Federal Reserve Board, \nAlan Greenspan took part in a very quiet collective effort to ensure that America didn&amp;#039;t experience an economic meltdown, \ntaking the rest of the world with it. There was good reason to fear the worst: the stock market crash of October 1987, \nhis first major crisis as Federal Reserve Chairman, coming just weeks after he assumed control, had come much closer than \nis even today generally known to freezing the financial system and triggering a genuine financial panic. But the most \nremarkable thing that happened to the economy after 9/11 was...nothing. What in an earlier day would have meant a crippling \nshock to the system was absorbed astonishingly quickly.\n\nAfter 9/11 Alan Greenspan knew, if he needed any further reinforcement, that we&amp;#039;re living in a new world - the world of a \nglobal capitalist economy that is vastly more flexible, resilient, open, self-directing, and fast-changing than it was even \n20 years ago. It&amp;#039;s a world that presents us with enormous new possibilities but also enormous new challenges. The Age of \nTurbulence is Alan Greenspan&amp;#039;s incomparable reckoning with the nature of this new world - how we got here, what we&amp;#039;re living \nthrough, and what lies over the horizon, for good and for ill-channeled through his own experiences working in the command \nroom of the global economy for longer and with greater effect than any other single living figure. He begins his account on \nthat September 11th morning, but then leaps back to his childhood, and follows the arc of his remarkable life&amp;#039;s journey \nthrough to his more than 18-year tenure as Chairman of the Federal Reserve Board, from 1987 to 2006, during a time of \ntransforming change.\n\nAlan Greenspan shares the story of his life first simply with an eye toward doing justice to the extraordinary amount of \nhistory he has experienced and shaped. But his other goal is to draw readers along the same learning curve he followed, so \nthey accrue a grasp of his own understanding of the underlying dynamics that drive world events. In the second half of the \nbook, having brought us to the present and armed us with the conceptual tools to follow him forward, Dr. Greenspan embarks \non a magnificent tour de horizon of the global economy. He reveals the universals of economic growth, delves into the \nspecific facts on the ground in each of the major countries and regions of the world, and explains what the trend-lines of \nglobalization are from here. The distillation of a life&amp;#039;s worth of wisdom and insight into an elegant expression of a coherent \nworldview, The Age of Turbulence will stand as Alan Greenspan&amp;#039;s personal and intellectual legacy. \n","torrent":{"xt":"urn:btih:ee5e7d006295de18fc6bdf92d7530570b545916b","amp;dn":"The+Age+Of+Turbulence+-+Alan+Greenspan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5e7d006295de18fc6bdf92d7530570b545916b","infoHashBuffer":{"type":"Buffer","data":[238,94,125,0,98,149,222,24,252,107,223,146,215,83,5,112,181,69,145,107]},"announce":[],"urlList":[]}}