{"title":"Batman.Arkham.Origins.Plus.DLCs.Repack-Z10yded","uid":9139713,"size":8763982420,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee6110768b97553d2361e87bb6a5bd7dcbe359eb&amp;dn=Batman.Arkham.Origins.Plus.DLCs.Repack-Z10yded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Taker009","files":30,"time":1383484418,"description":"Batman.Arkham.Origins.Plus.DLCs.Repack-Z10yded\n\nYear: 2013 \nGenre: Action / 3D / 3rd Person / Stealth \nPublication Type: Singleplayer Rip \nLanguage: Russian, English \nSound language: English \nCrack: enclosing \n\nAuthor: z10yded\nSystem requirements:\nOperating System: - Windows Vista / Windows 7/8 \nProcessor: - Intel Core 2 Duo, 2.4 GHz / AMD Athlon X2, 2.8 GHz \nMemory: - 2 GB RAM \nVideo: - NVIDIA GeForce 8800 GTS / AMD Radeon HD 3850 or better with 512 MB ??of VRAM \nSound system: - compatible with DirectX \nHard disk space: - 12 GB available space\n\n\nBatman: Arkham Chronicles&quot; - the third edition of the famous series \nBatman: Arkham. You again have to go to a gloomy Gotham. But this time, \nyou can take part in the events anticipated the Batman: Arkham Asylum and \nBatman: Arkham City.The game takes place several years before the infamous mutiny. \nBatman is just starting his career a secret crime-fighter, he is young and inexperienced, \nand it will only become the Dark Knight, we know ...\n\nExtras. Information:\n\nSubject campaign Â«Batman: Arkham Chronicle&quot; tells an entirely new story authored by \nwriters Michael &quot;Dooma&quot; Vendshu and Corey May, behind which the joint work on games \nsuch as Prince Persia: Warrior Within, Assassin's Creed, Army of Two. Consultant is \ncreative director of DC Comics Geoff Johns. You are going to witness the early years \nof Batman as a fighter against crime and first encounter with those who in the future \nwill be the sworn enemies of the Dark Knight. \n\nNew Crime Scene facilitates the process of gathering information. With the help of \ncutting-edge gadgets Batman can re-create the virtual version of what happened at \nthe crime scene and discover clues, invisible to the naked eye. \n\nYou will Gotham. In the new and familiar places await a variety of opponents, \nwhich will have to overcome, crimes that require investigation and puzzles that \nneed to be unraveled. \n\nHunt the criminals that are relevant to the main plot, but not integral to it. \nContact with them or not - depends on you. On the streets of Gotham's new enemies \nawait you - thugs in armor, possessing incredible strength and extremely agile \nopponents keep track of which is not so easy. To come out the winner of each bout \nwill have to master the combat system FreeFlow. \n\nArsenal Batman will join the new gadgets - such as remote-controlled Bet-claw. \nSave and familiar from past games series devices. In the dark streets of Gotham \nBatman will encounter a number of well-known characters, including Black Mask, \nDeftrouk, Bane, Joker, Anarchy, Captain Gordon and others.\n\n\nRepack Features \n\nRemoved the multiplayer and localization except Russian and English / no recoded \nGame Version 1.0.0.0 (Update 3) \nInstallation time ~ 10 minutes\n\nAdditional content: \n\nDeathstroke Challenge Pack \nBlack Mask Challenge Pack \nGaslight and Brightest Day Skin Pack \nNew Millennium Skin Pack \nInfinite Earths Skin Pack \nBatman Legends Skin Pack\n\n\nIntegrated Update 3\n\nList of fixes Update 2 (on fixes Update 3 is not yet known)\n\nFixed an issue that prevented points, subjects, progress is saved in a network game. \nFixed a ventilation shaft in the tower Burnley, which did not allow Batman to climb into it. \nFixed a problem with the focus of continuous combat, this improvement did not open when you \nunlock the third rank Invisible Avenger. \nFixed problem with provalivaniem through elevators and other places in the game in most cases. \nFor players who are stuck in a looped the fall, if you can not return to the game, or if \neverything around looks weird - use this statement: \n1. In the pause menu select &quot;Restart.&quot; \n2. If restarting does not work, try to beat all the enemies around you. \n3. If there are no enemies, try to find the door and enter it. \n4. These steps should help you get back in the game.\n","torrent":{"xt":"urn:btih:ee6110768b97553d2361e87bb6a5bd7dcbe359eb","amp;dn":"Batman.Arkham.Origins.Plus.DLCs.Repack-Z10yded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee6110768b97553d2361e87bb6a5bd7dcbe359eb","infoHashBuffer":{"type":"Buffer","data":[238,97,16,118,139,151,85,61,35,97,232,123,182,165,189,125,203,227,89,235]},"announce":[],"urlList":[]}}