{"title":"Nessa Carey - The Epigenetics Revolution","uid":7185664,"size":3173293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee8ecffbc030685ac27cce85ca004ba57ed8be40&amp;dn=Nessa+Carey+-+The+Epigenetics+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":3,"time":1334418525,"description":"Nessa Carey - The Epigenetics Revolution\nIcon Books | ISBN : 1848313470 | 2012-03 | MOBI/EPUB | 320 pages | 1.49/1.54 MB\n\nAt the beginning of this century enormous progress had been made in genetics. The Human Genome Project finished sequencing human DNA. It seemed it was only a matter of time until we had all the answers to the secrets of life on this planet. The cutting-edge of biology, however, is telling us that we still don't even know all of the questions. How is it that, despite each cell in your body carrying exactly the same DNA, you don't have teeth growing out of your eyeballs or toenails on your liver? How is it that identical twins share exactly the same DNA and yet can exhibit dramatic differences in the way that they live and grow? It turns out that cells read the genetic code in DNA more like a script to be interpreted than a mould that replicates the same result each time. This is epigenetics and it's the fastest-moving field in biology today. The Epigenetics Revolution traces the thrilling path this discipline has taken over the last twenty years. Biologist Nessa Carey deftly explains such diverse phenomena as how queen bees and ants control their colonies, why tortoiseshell cats are always female, why some plants need a period of cold before they can flower, why we age, develop disease and become addicted to drugs, and much more. Most excitingly, Carey reveals the amazing possibilities for humankind that epigenetics offers for us all - and in the surprisingly near future.","torrent":{"xt":"urn:btih:ee8ecffbc030685ac27cce85ca004ba57ed8be40","amp;dn":"Nessa+Carey+-+The+Epigenetics+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee8ecffbc030685ac27cce85ca004ba57ed8be40","infoHashBuffer":{"type":"Buffer","data":[238,142,207,251,192,48,104,90,194,124,206,133,202,0,75,165,126,216,190,64]},"announce":[],"urlList":[]}}