{"title":"Veruca Salt - Ghost Notes (2015) [FLAC]","uid":12107012,"size":382259231,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f142c360cc9852b1f471cb994ce24d5601a4542a&amp;dn=Veruca+Salt+-+Ghost+Notes+%282015%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":15,"time":1436469014,"description":"\n  Veruca Salt - Ghost Notes (2015) [FLAC]\n\n  Genre: Rock\n  Style: Grunge, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 The Gospel According to Saint Me \n  02 Black and Blonde \n  03 Eyes On You \n  04 Prince of Wales \n  05 The Sound of Leaving \n  06 Love You Less \n  07 Laughing in the Sugar Bowl\n  08 Empty Bottle \n  09 Come Clean, Dark Thing \n  10 I'm Telling You Now \n  11 Triage \n  12 Lost To Me \n  13 The Museum of Broken Relationships \n  14 Alternica \n\n  Veruca Salt reshaped the jagged, abrasive punk-pop of the Pixies and Breeders into a more accessible, riff-driven power pop formula that also borrowed from pop/hard rockers like Cheap Trick. It was a successful formula, both musically and commercially, yet it didn't ensure them indie rock credibility; in fact, they became one of the most harshly criticized bands of the post-Nirvana alternative rock era, despite being one of the first female-fronted outfits to achieve stardom in that genre.\n\n  Veruca Salt took shape in early 1992, when Chicago residents Louise Post and Nina Gordon began touring the local folk circuit. Both were competent singers and guitarists, and a year's worth of coffeehouse performances fueled their desire to recruit additional members for a full-fledged band. After adding bassist Steve Lack and drummer Jim Shapiro (Gordon's brother), Veruca Salt released their debut single, &quot;Seether&quot;/&quot;All Hail Me,&quot; in 1994 on the local independent label Minty Fresh Records. Produced by Brad Wood (Liz Phair), the record became a word-of-mouth sensation, working its way to alternative and college radio stations. While supporting Hole on their fall tour, Veruca Salt released the debut album American Thighs on the Minty Fresh label, yet they soon cut a major-label deal with Geffen, which then re-released the album. &quot;Seether&quot; became an MTV hit as well, and soon the single was an across-the-board success. However, the group received scathing criticism from magazines and fanzines, claiming that Veruca Salt were nothing but ripoff artists who used Minty Fresh as a way to gain credibility. Nevertheless, the group's popularity didn't suffer, and American Thighs went gold, even though their next two singles -- &quot;Number One Blind&quot; and &quot;All Hail Me&quot; -- didn't attract half the attention that &quot;Seether&quot; commanded.\n\n  After releasing the stopgap, Steve Albini-produced EP Blow It Out Your Ass It's Veruca Salt in 1996, the band returned in early 1997 with Eight Arms to Hold You, which moved toward hard rock and heavy metal. Although critical reaction was even more mixed, the album still reached gold sales status, propelled in part by the Top Ten rock single &quot;Volcano Girls.&quot; Shortly after the album was completed, Shapiro left the lineup and was replaced by former Letters to Cleo drummer Stacy Jones. Meanwhile, in the wake of rumors that Gordon and Post had been feuding and/or considering solo projects, it was confirmed that Gordon had quit the band in early 1998 to pursue a separate solo career.\n\n  Undeterred, Post regrouped Veruca Salt as her own project. Now boasting a revised lineup including guitarist Stephen Fitzpatrick, bassist Suzanne Sokol, and drummer Jimmy Madla, the band left Geffen Records (which had been swallowed by a corporate merger) and inked a new record deal with Beyond. They also entered the studio to record Resolver, a fiery album that dealt with Gordon's departure and Post's failed relationship with Dave Grohl. Released during the spring of 2000, Resolver didn't enjoy the same success as Veruca Salt's previous albums, although the band continued to tour as Post wrote new material. The Officially Dead EP was released in 2003 and charted well in Australia, where the band began to focus some of its touring efforts. With an ever-changing lineup (now featuring Post, Fitzpatrick, drummer Kelli Scott, and bassist Nicole Fiorentino), Veruca Salt then recorded another five-song EP, 2005's Lords of Sounds and Lesser Things. An additional full-length album, IV, was issued the following year. Following a lackluster public response to the album, the band went on a lengthy hiatus. As unexpectedly as they'd parted ways, Gordon and Post announced in 2013 that they had &quot;buried the hatchet&quot; and were reuniting the band's original lineup. They jokingly referred to the era following Gordon's departure as &quot;Veruca Starship&quot; and readied new material, the first taste of which was 2014's Record Store Day EP MMXIV. The full-length Ghost Notes followed in July 2015","torrent":{"xt":"urn:btih:f142c360cc9852b1f471cb994ce24d5601a4542a","amp;dn":"Veruca+Salt+-+Ghost+Notes+%282015%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f142c360cc9852b1f471cb994ce24d5601a4542a","infoHashBuffer":{"type":"Buffer","data":[241,66,195,96,204,152,82,177,244,113,203,153,76,226,77,86,1,164,84,42]},"announce":[],"urlList":[]}}