{"title":"A Visual Inventory (Art Ebook).pdf","uid":12115714,"size":188255010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f215bb57aa7d7e69f73c0b13fd47351cdadc65c6&amp;dn=A+Visual+Inventory+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1436694624,"description":"A Visual Inventory by John Pawson\nEnglish | 2012 | ISBN: 0714863505 | 320 pages | PDF | 179 MB\n\nJohn Pawson's career as an architect and designer spans a variety of sizes and programs: from bowls to bridges, and monasteries to Calvin Klein stores. In addition to his acclaimed design work, he is the author of Phaidon's successful Minimum, a book that paired images and captions to illustrate the notion of simplicity in a beautiful and inspirational manner. Visual Inventory presents some of the images from Pawson's personal collection of over 200,000 digital snapshots. The book opens with an essay explaining the importance of photography as a tool for Pawson's work, and the images are set one per page with illuminating captions. Covering a huge range of subjects, the photographs form a remarkle body of reference material. Some of the images illustrate a particular idea out form, material or space; others reflect the author's interest in returning repeatedly to certain subjects, capturing the changes brought by different weather, light conditions, seasons and patterns of use. Each image has been chosen for the book because it is useful, offering a lesson in visual thinking. None of the photographs in the book have been cropped or altered; it is the selection, arrangement and captioning of the images that make this book unique, valule and attractive to any architect, designer, artist or student who wants to see the world around them with a stronger eye","torrent":{"xt":"urn:btih:f215bb57aa7d7e69f73c0b13fd47351cdadc65c6","amp;dn":"A+Visual+Inventory+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f215bb57aa7d7e69f73c0b13fd47351cdadc65c6","infoHashBuffer":{"type":"Buffer","data":[242,21,187,87,170,125,126,105,247,60,11,19,253,71,53,28,218,220,101,198]},"announce":[],"urlList":[]}}