{"title":"Democracy Now - 16 dec 2011","uid":6892290,"size":455570868,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f276a16b1a2ffd6ac01f0d9ba4167da31afdd096&amp;dn=Democracy+Now+-+16+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1324059571,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 16, 2011\n\n- Manning in 1st Court Appearance as Iraq Occupation Formally Ends\n- Nearly Half of Americans Below Poverty Line or Low-Income\n- Spending Deal Avoids Shutdown as Obama Urges Payroll Tax Cut\n- U.N. Urges Global LGBT Protections\n- GOP Candidates Hold Final Debate of Year; Gingrich Pressed on Freddie Mac Work\n- FBI Probed Gingrich for Bribery After Wife Met With Convicted Arms Dealer\n- Justice Dept. Accuses Ariz. Sheriff of Anti-Hispanic Bias\n- Brazil Sues Chevron, Transocean for Oil Spill\n- BP Among Winning Bidders for New Gulf Drilling\n- Daughter of Prominent Activist Arrested in Bahrain Protest Crackdown\n- Author, Columnist Christopher Hitchens Dies at 62\n\n\nSpecial reports\n\n- U.S. Withdrawal From Iraq: &quot;In Terms of Destroying Iraq, It's 'Mission Accomplished'&quot;\n\nThe U.S. military may be leaving Iraq, but the U.S. government is not. The U.S. embassy in Baghdad is the largest in the world and thousands of private contractors will fill the role of the departing U.S. troops. We begin our coverage of the U.S. withdrawal with Sami Rasouli, the founder and director of the Muslim Peacemaker Teams in Iraq, who joins us from the city of Najaf. Invoking George W. Bush's infamous declaration after the fall of Baghdad, Rasouli says: &quot;In terms of destroying Iraq, it's 'Mission Accomplished.'&quot;\n\n\n- The Costs of War: Tens of Thousands Dead, Billions Spent, and a Country Torn Apart\n\nOver the past nine years, the U.S. invasion and occupation has left a bloody toll on Iraqi civilians and foreign troops. Nearly 4,500 U.S. troops died and another 32,000 were wounded. An accurate toll of Iraqis killed may never be known. Iraq Body Count says at least 104,000 Iraqi civilians have died, while some studies put have put the death toll at over one million. We speak to Catherine Lutz, Brown University professor and co-director of the &quot;Costs of War&quot; research project at the Watson Institute for International Studies. &quot;The costs have really been staggering,&quot; Lutz says. &quot;We know that Congress appropriated $800 billion over the years for the Iraq War. But the true costs go much farther than that. Starting with the people of Iraq who have lost lives in the hundreds of thousands.&quot;\n\n\n- Iraqi Women's Activist Rebuffs U.S. Claims of a Freer Iraq: &quot;This Is Not a Democratic Country&quot;\n\nYanar Mohammed, president of the Organization of Women's Freedom in Iraq, joins us to discuss the impact of the nearly nine-year U.S. occupation, particularly on Iraqi women. &quot;The Iraqi cities are now much more destroyed than they were five years ago,&quot; Mohammed says. &quot;At the same time, we have turned to a society of 99 percent poor and 1 percent rich due to the policies that were imposed in Iraq.&quot; Moahmmed decries the repression of Iraqi protesters that joined the Arab Spring in a February 25th action. &quot;The women are the biggest losers in all of this. We went to the Iraqi squares, we demonstrated, but got oppressed in ways that are new to Iraqi people. Anti-riot police of the American style was something that we witnessed there ... This is not a democratic country.&quot;\n\n\n- Bradley Manning: Famed Whistleblower Daniel Ellsberg on Alleged WikiLeaks Soldier's 1st Day in Court\n\nAlleged U.S. Army whistleblower Private Bradley Manning is scheduled to make his first court appearance today after being held for more more than a year-and-a-half by the U.S. military. Manning is suspected of leaking hundreds of thousands of secret U.S. diplomatic cables to the whistleblowing website WikiLeaks in the biggest leak of classified U.S. documents in history. We're joined by perhaps the nation's most famous whistleblower, Daniel Ellsberg, and go to Ft. Meade, Maryland for a brief update on a rally in support of Manning outside the base where he'll appear. Noting that the WikiLeaks revelations helped spark the Arab Spring and in turn the Occupy Wall Street movement, Ellsberg offers this qualified praise if Manning indeed committed the leak of which he stands accused: &quot;The Time magazine cover gives protester-an anonymous protester-as 'Person of the Year,' but it's possible to put a face and a name to that picture. And the American face I would put on that is Private Bradley Manning.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f276a16b1a2ffd6ac01f0d9ba4167da31afdd096","amp;dn":"Democracy+Now+-+16+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f276a16b1a2ffd6ac01f0d9ba4167da31afdd096","infoHashBuffer":{"type":"Buffer","data":[242,118,161,107,26,47,253,106,192,31,13,155,164,22,125,163,26,253,208,150]},"announce":[],"urlList":[]}}