{"title":"Making &amp; Mastering Wood Planes{BBS}","uid":6684674,"size":30232148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2a90ffbecdab3c39b70ad5e1dd794a26f6eb8f2&amp;dn=Making+%26amp%3B+Mastering+Wood+Planes%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316356428,"description":"Many modern woodworkers will never use a hand plane, but the trade is still considered essential for work of the highest caliber. Finck guides readers through the precision construction of a wood-soled plane that will perform better than today's factory-made, metal-soled counterpart. For the less adventurous, Finck offers comprehensive instructions in the proper use of planes of all types (metal or wooden). Unfortunately, the black-and-white illustrations, while useful, make for a somewhat drab book. Garrett Hack's The Handplane Book (Taunton, 1997) is much more attractive but doesn't cover the construction of one's own planes or appear to be as useful to the average user. Comprehensive woodworking collections will want this title.\nCopyright 2001 Reed Business Information, Inc.\nProduct Description\nSmall and extremely comfortable to use, wooden hand planes bring machined surfaces to an alluring, silky smoothness-but they can't be bought anywhere. Fortunately, this meticulously complete, photo-packed guide is like two volumes in one, teaching you how to make a classic plane yourself (it takes only a day or so) and how to use it in a refined manner. One of the most respected woodworkers around digs deeply into the art of crafting and working with this personalized tool, helping even the most uninitiated with dozens of detailed boxed sidebars on the basics. Every step in the construction process receives extremely close attention: preparing the plane blank; bandsaw pointers; drift angle; tension; tuning and using hand tools; sharpening with ease speed, and reliability; cross pin location; and gluing up. Handle the plane well so as to get a good stroke going; and take a look at invaluable planning aids and special techniques. No other manual is its equal!\n\n\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 192 pages\n    * Publisher: Sterling (December 31, 2000)\n    * Language: English\n    * ISBN-10: 0806961635\n    * ISBN-13: 978-0806961637","torrent":{"xt":"urn:btih:f2a90ffbecdab3c39b70ad5e1dd794a26f6eb8f2","amp;dn":"Making+%26amp%3B+Mastering+Wood+Planes%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2a90ffbecdab3c39b70ad5e1dd794a26f6eb8f2","infoHashBuffer":{"type":"Buffer","data":[242,169,15,251,236,218,179,195,155,112,173,94,29,215,148,162,111,110,184,242]},"announce":[],"urlList":[]}}