{"title":"Sexually Broken--Ashli Orion pushed to the edge  Ashli Orion  Ma","uid":7756805,"size":885594444,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f2cc3f8da58c692e32f101d42c2f4a130f165e49&amp;dn=Sexually+Broken--Ashli+Orion+pushed+to+the+edge++Ashli+Orion++Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":1,"time":1351122571,"description":"Ashli Orion pushed to the edge, Deep throated, fucked, tickled, made to squirt! Sexual overload | Ashli Orion | Matt \n\nWilliams\n            \nOctober 24, 2012\n\n\nMP4 only.\n\n\nWelcome back Ashli Orion to Sexually Broken! Ashli is an \nhonest to goodness sweetheart. The very typical girl next \ndoor. We love sexually destroying sweethearts, they look so \nhot when they are broken like that.\n\nBound, with legs spread open and head hanging back over a bed, \nAshli finds herself completely exposed and helpless from the \nstart. Her hair is tied down, she is unable to look up, she \nhas no idea what is going to happen to her. We start with \nsevere tickling. Ashli bucks, screams and begs for it to stop, \nbut we don't let up. Ashli laughs uncontrollably, she cannot \ncatch her breath. \n\nThe tickling is replaced with a vibrator and within seconds \nAshli is cumming! The orgasms we rip from her helpless body \nsend her into subspace, she is loopy and pliable. With her \nhead tied back and hardly able to catch her breath, we move \nquickly and jam the hard cock all the way down Ashli's pretty \nlittle helpless mouth. She can do nothing to move her head. \nShe knows a brutal skull fucking is coming, she also knows \nthat she is helpless to prevent the cock from deep throating \nher further into subspace. Soon she is gone, her brain driven \ninto survival mode. All she knows is the cock. The cock fucks \nher face like it's a wet pussy. Deep spittle coats her face, \nplugs her nose and coats her eyes. She fights for air, she \nendures. \n\nNow deep into subspace, with a every hole dripping some form \nof liquid, we bind Ashli's legs up and fuck her wet pussy with \nhard cock. Within seconds she is cumming again. Still unable \nto move her head she moans and screams as we fuck the orgasms \nright out of her. We pull out and finger blast her to a brutal \nsquirting orgasm. Her brain flashes, she is broken. We leave \nher in the glow of what happened, she awaits our return in the \ndark, surrendering herself completely to us.\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_24ashli3/SexuallyBroken-Ashli-Orion-Matt-Williams-Ashli-Orion-pushed-to-the-edge-Deep-throated-fucked-tickled-made-to-squirt-Sexual%20overload.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_24ashli3/SexuallyBroken-Ashli-Orion-Matt-Williams-Ashli-Orion-pushed-to-the-edge-Deep-throated-fucked-tickled-made-to-squirt-Sexual%20overload.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:f2cc3f8da58c692e32f101d42c2f4a130f165e49","amp;dn":"Sexually+Broken--Ashli+Orion+pushed+to+the+edge++Ashli+Orion++Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2cc3f8da58c692e32f101d42c2f4a130f165e49","infoHashBuffer":{"type":"Buffer","data":[242,204,63,141,165,140,105,46,50,241,1,212,44,47,74,19,15,22,94,73]},"announce":[],"urlList":[]}}