{"title":"Sex - If Men Have All The Power How Come Women Make All The Rule","uid":4379651,"size":1852691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3a93eb584658d31e1f44d66c564b19cb1c93490&amp;dn=Sex+-+If+Men+Have+All+The+Power+How+Come+Women+Make+All+The+Rule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"leraconteur","files":1,"time":1220588910,"description":"If Men Have All The Power How Come Women Make All The Rules - Jack Kammer pdf\n\nDon't let the title fool you. This book is not (and is not meant to be) funny.\n\nIt's meant to be succinct.  If you want to yuk it up about men's much-discussed foibles (We're 'afraid' of commitment, we never ask for directions, we cling to the remote control because it makes us feel potent, and other time-worn chestnuts women love for making them feel superior), there are plenty of other books (and newspaper columns and sitcoms) that will let you do just that.  As trite and mindlessly popular as those things are, they have the very sad effect (if not the intention) of convincing us either:\n\n1) Our problems with women are no big deal and should just be laughed off,\n2) The problems are all our fault anyway and could be fixed easily if only we weren't so, well - male, and\n3) There's nothing we can do about the problems even if we wanted to because women are just so much stronger, smarter and wiser than we are.\n\nNo, this book is about the seldom-discussed things women think and say and do, how they create problems for us, and how we can view those problems in a new way so we can begin to solve them.\n\nFile Under:\nMGTOW, Men's Rights,mens rights, MRA, FRA, anti-feminism, feminism, mra, fra, Father's Rights, fathers rights, misandry, anti-misandry\n\nThe Essential Men's Rights Library - Torrent #6","torrent":{"xt":"urn:btih:f3a93eb584658d31e1f44d66c564b19cb1c93490","amp;dn":"Sex+-+If+Men+Have+All+The+Power+How+Come+Women+Make+All+The+Rule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3a93eb584658d31e1f44d66c564b19cb1c93490","infoHashBuffer":{"type":"Buffer","data":[243,169,62,181,132,101,141,49,225,244,77,102,197,100,177,156,177,201,52,144]},"announce":[],"urlList":[]}}