{"title":"Steven Jesse Bernstein - Prison [1992] [FLAC]","uid":8141829,"size":319562098,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f44f876b580b39725a59cb79fabd4e4285906186&amp;dn=Steven+Jesse+Bernstein+-+Prison+%5B1992%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":20,"time":1360829918,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Steven Jesse Bernstein\nRelease: Prison\nDiscogs: 1437107\nReleased: 1992\nLabel: Sub Pop\nCatalog#: SPCD 037/195\nFormat: CD, Album\nCountry: Germany\nStyle: Electronic, Hip Hop, Jazz, Non-Music, Rock, Spoken Word, Experimental\n\nTracklisting:\n\n01. No No Man (Part One) (4:22)\n02. Morning In The Sub-Basement Of Hell (4:07)\n03. More Noise Please (3:33)\n04. The Sport (Part One) (4:50)\n05. Party Balloon (4:13)\n06. Face (12:37)\n07. This Clouded Heart (6:28)\n08. The Man Upstairs (5:22)\n09. The Sport (Part Two) (6:02)\n10. No No Man (Part Two) (2:43)\n\n\n\nSomething of a legend in Seattle circles, both for his material and his suicide three years before a more notorious self-killing by a former labelmate, Bernstein's posthumously assembled record can actually be considered a collaboration between himself and Northwest music figure Steve Fisk. Fisk had only completed musical accompaniment for one full track before Bernstein's death, but had already won approval from the spoken word artist to continue with the rest. The end result is stunning and unnervingly appealing, arguably superior to the similar, higher profile collaboration between Bill Laswell and William Burroughs (the latter of whom Bernstein admired deeply; a photo of the two appears in the album artwork). \n\nFisk's varying arrangements match Bernstein's drawling, quietly threatening tales perfectly, alternately sprightly and disturbing as his readings continue. Even the most relative ambient backings, such as the low rumblings and keyboards on &quot;More Noise Please,&quot; have an undertone of unease. Given Bernstein's lack of input in the arrangements, things should feel more stilted than they are, but Fisk never forces the rhythm to Bernstein's readings. Sometimes things take a jazzier tip, thus the opening &quot;No No Man (Part One)&quot; and &quot;This Clouded Heart.&quot; More often Fisk conjures up dark, threatening funk/hip-hop not that far from what Tricky would eventually be famous for. &quot;Morning in the Sub-Basement of Hell&quot; is particularly fierce, Bernstein describing a thoroughly scuzzy domestic situation in such detail that Charles Bukowski would appreciate while the beats and bass charge on. \n\nAt points Fisk treats Bernstein's vocals with echo or distortion for effect, but most often he lets the speaker's voice through clearly, his often violent images cutting straight through to the listener even as the music might be getting the listener moving. The most chilling moments come on &quot;Face&quot; -- Fisk introduces only very subtle elements as Bernstein pitilessly details a humiliating, horrifying series of childhood incidents.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:f44f876b580b39725a59cb79fabd4e4285906186","amp;dn":"Steven+Jesse+Bernstein+-+Prison+%5B1992%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44f876b580b39725a59cb79fabd4e4285906186","infoHashBuffer":{"type":"Buffer","data":[244,79,135,107,88,11,57,114,90,89,203,121,250,189,78,66,133,144,97,134]},"announce":[],"urlList":[]}}