{"title":"2014 Car Hacker's Handbook EPUB/MOBI","uid":10651910,"size":11472702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5ad4bd6278010ab7afcf432badb8182cf86b038&amp;dn=2014+Car+Hacker%27s+Handbook+EPUB%2FMOBI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blckshrk","files":-1,"time":1406626866,"description":"As vehicles have evolved they have become more and more connected. The newer systems have more electronics and are more connected to the outside world than ever before. Vehicles use internal networks that are connected to wireless systems. Many cars include internet capabilities, WiFi, bluetooth and more. These are all potential attack vectors that could jeopardize the safety and security of the vehicle. This book teaches you the same techniques used to audit complex IT infrastructures and applies them to modern day vehicles. After reading this book you will be able to assess a car to determine security weaknesses in it's design. The book is broken down to different section involving different types of attacks of each component of the vehicle. You can read the whole thing or just jump to the areas that interest you. This book focuses on the tricks and techniques used to analyze any vehicle. It is not a recipe book for specific models. This allows the techniques to be applied to any vehicle. The book does not require previous knowledge of mechanics but instead focuses more on the computer science areas of attacks. Embedded system research, network analysis and wireless communications are a large focus on developing attacks. If you are a mechanic, security researcher, concerned citizen or in charge of security reviews for an automotive company, this manual will guide you and provide a great reference. Small enough to fit into your glove box or leave around your hackerspace. This book is a product of the OpenGarages research and is also licensed under Creative Commons license which can be shared for free. See the OpenGarages.org website for more information.","torrent":{"xt":"urn:btih:f5ad4bd6278010ab7afcf432badb8182cf86b038","amp;dn":"2014+Car+Hacker%27s+Handbook+EPUB%2FMOBI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5ad4bd6278010ab7afcf432badb8182cf86b038","infoHashBuffer":{"type":"Buffer","data":[245,173,75,214,39,128,16,171,122,252,244,50,186,219,129,130,207,134,176,56]},"announce":[],"urlList":[]}}