{"title":"Symphony of Science (Official Releases) .mp3","uid":5923330,"size":43180775,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6dee62e03cd25cd187fabdf7df7ed4374882b6f&amp;dn=Symphony+of+Science+%28Official+Releases%29+.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timmyta","files":6,"time":1288508275,"description":"Short summary:  \n\n  Well mixed electronic music composed of sound bites from various eminent scientists of the last 30 years.  The bulk of the material comes from Carl Sagan's &quot;Cosmos&quot; series.\n\nTaken from http://www.symphonyofscience.com/about.html :\n\n&quot;Hey - I'm John Boswell, the head musician and producer behind the Symphony of Science. The goal of the project is to bring scientific knowledge and philosophy to the public, in a novel way, through the medium of music. Science and music are two passions of mine that I aim to combine, in a way that is intended to bring a meaningful message to listeners, while simultaneously providing an enjoyable musical experience. \n\nThe project owes its existence in large measure to the wonderful work of Carl Sagan, Ann Druyan, and Steve Soter, with their production of the classic PBS Series Cosmos, as well as all the other featured figures and visuals.\n\nI began to experiment with production and composition in high school, taking a strong interest in music theory and electronic music. This hobby grew throughout college, where I quickly developed a love for science and philosophy, while gradually gathering better musical equipment and experience. After recently graduating with a degree in economics, I started a formal electronica project called Colorpulse and also began to focus more and more on recording and production, co-producing a comedic RnB album using auto-tune software. \n\nInspiration from The Gregory Brothers and DJ Steve Porter, coupled with my experience with remixing, composition, and auto-tune, led to experiments with remixing scientists, culminating in Carl Sagan's &quot;A Glorious Dawn&quot; in Fall of 2009. \n\nThis first video's highly positive reception provided motivation to elaborate on the theme of remixing scientists, which spawned the Symphony of Science project. The second video, &quot;We Are All Connected&quot;, was released in October 2009 on the heels of A Glorious Dawn with much success. Although the methods of remixing and tuning spoken word, combined with original electronic music and similarly themed footage, are unorthodox in the context of other science-themed music, the results have often been inspiring, humbling, and of course humorous. \n\nThe project has now produced six full length music videos (see the home page), and expanded to include and rely on much more input from the community and collaborations with peers. Since its launch in Fall 2009, Symphony of Science has been featured on NPR, Wired, The Scientist, Attack of the Show, The Skeptics Guide to the Universe, Bad Astronomy, Coast to Coast AM, The Examiner, net@night, and many more radio shows, magazines and websites. The videos have attracted over 8 million views online, contributing to the release of the first song, A Glorious Dawn, on a special 7&quot; 45rpm vinyl single through Jack White's record label Third Man Records.\n\nAlmost everything on the site is provided for free; if you like what you see and hear, please consider contributing to the project or staying in touch with us through e-mail, YouTube, or Twitter. \n\nThanks for visiting the site. Enjoy what you find! \n\n~John\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;02686d6a6c42717b6f726a6d6c7b6d6471616b676c61672c616d6f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; &quot;","torrent":{"xt":"urn:btih:f6dee62e03cd25cd187fabdf7df7ed4374882b6f","amp;dn":"Symphony+of+Science+%28Official+Releases%29+.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6dee62e03cd25cd187fabdf7df7ed4374882b6f","infoHashBuffer":{"type":"Buffer","data":[246,222,230,46,3,205,37,205,24,127,171,223,125,247,237,67,116,136,43,111]},"announce":[],"urlList":[]}}