{"title":"The Isley Brothers - 60's Greatest Hits &amp; Rare Classics (19","uid":6668545,"size":144356113,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7b13fc381df27d694c5da0c50c4e67cc31291c3&amp;dn=The+Isley+Brothers+-+60%5C%27s+Greatest+Hits+%26amp%3B+Rare+Classics+%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1315789906,"description":"The Isley Brothers\n60's Greatest Hits\n&amp; Rare Classics (1991)\n\n\n\n\n\n\nFirst formed in the early '50s, the Isley Brothers enjoyed one of the longest, most influential, and most diverse careers in the pantheon of popular music -- over the course of nearly a half century of performing, the group's distinguished history spanned not only two generations of Isley siblings but also massive cultural shifts which heralded their music's transformation from gritty R&amp;B to Motown soul to blistering funk. The first generation of Isley siblings was born and raised in Cincinnati, OH, where they were encouraged to begin a singing career by their father, himself a professional vocalist, and their mother, a church pianist who provided musical accompaniment at their early performances. Initially a gospel quartet, the group was comprised of Ronald, Rudolph, O'Kelly, and Vernon Isley; after Vernon's 1955 death in a bicycling accident, tenor Ronald was tapped as the remaining trio's lead vocalist. In 1957, the brothers went to New York City to record a string of failed doo wop singles; while performing a spirited reading of the song &quot;Lonely Teardrops&quot; in Washington, D.C., two years later, they interjected the line &quot;You know you make me want to shout,&quot; which inspired frenzied audience feedback. An RCA executive in the audience saw the concert, and when he signed the Isleys soon after, he instructed that their first single be constructed around their crowd-pleasing catch phrase; while the call-and-response classic &quot;Shout&quot; failed to reach the pop Top 40 on its initial release, it eventually became a frequently covered classic. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAlthough the Isleys recorded some good stuff for Motown in the late '60s, it's generally true that the label's attempts to fit them into the standard Motown production line inhibited their creativity and individuality. This 22-track retrospective of their Motown days is dominated by material from in-house songwriters like Eddie Holland, Smokey Robinson, and Ivory Joe Hunter and doesn't rank among the Isleys' best work, though it's respectable enough. The best tracks -- the Top Ten hit &quot;This Old Heart of Mine,&quot; &quot;Behind a Painted Smile,&quot; and &quot;Take Some Time out for Love&quot; -- are available on the Rhino best-of, but Isleys fans will find this a worthwhile summary of their brief Motown stay. Includes the original versions of two of their biggest hits cut for other labels, &quot;Twist &amp; Shout&quot; and &quot;It's Your Thing.&quot; \n\n\n\n\n\n\nAudio-Info:\n\n\n\n\n01. Twist &amp; Shout\n02. This Old Heart Of Mine (Is Weak For You)\n03. There's  No Love Left\n04. Take Some Time Out For Love\n05. Who Could Ever Doubt My Love\n06. I Guess I'll Always Love You\n07. I Hear A Symphony\n08. Nowhere To Run\n09. Just Ain't Enough Love\n10. Got To Have You Back\n11. Behind A Painted Smile\n12. Put Yourself In My Place\n13. It's Out Of The Question\n14. Take Me In Your Arms (Rock Me A Little While)\n15. Why When Love Is Gone\n16. Little Miss Sweetness\n17. All Because I Love You\n18. Tell Me It's Just A Rumor Baby\n19. My Love Is Your Love (Forever)\n20. That's The Way Love Is\n21. One Two Many Heartaches\n22. It's Your Thing\n\n\n\n\n\n\n\n\n\n             ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                 ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:f7b13fc381df27d694c5da0c50c4e67cc31291c3","amp;dn":"The+Isley+Brothers+-+60%5C%27s+Greatest+Hits+%26amp%3B+Rare+Classics+%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7b13fc381df27d694c5da0c50c4e67cc31291c3","infoHashBuffer":{"type":"Buffer","data":[247,177,63,195,129,223,39,214,148,197,218,12,80,196,230,124,195,18,145,195]},"announce":[],"urlList":[]}}