{"title":"Eydie Gorme - Eydie Gorme &amp; Love Is The Season - [EAC-MP3@320KBP","uid":4576510,"size":167002430,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f87065f82f56262e26c01b61571e93b4ad05d3d9&amp;dn=Eydie+Gorme+-+Eydie+Gorme+%26+Love+Is+The+Season+-+%5BEAC-MP3%40320KBP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"seanprince","files":31,"time":1229254938,"description":"Eydie Gorme - Eydie Gorme &amp; Love Is The Season - [EAC-MP3@320KBPS]\n\n\n\nTrack list\n\nEydie Gorme - Eydie Gorme &amp; Love Is The Season.\n01. I'll Take Romance\n02:25\n02. This Is No Laughing Matter 03:48\n03. Fine And Dandy 02:02\n04. Day By Day 02:35\n05. The Gentleman Is A Dope 03:33\n06. Too Close For Comfort 02:54\n07. Guess Who I Saw Today 03:11\n08. Be Careful, It's My Heart 02:28\n09. Saturday Night (Is The Loneliest Night Of The Week 02:19\n10. First Impressions 02:49\n11. How Long Has THis Been Going On 03:04\n12. Gypsy In My Soul 02:03\n13. Love Is A Season 03:10\n14. April Showers 02:52\n15. Things We Did Last Summer 03:22\n16. On The First Warm Day 03:04\n17. I When The Wind Was Green 03:40\n18. Winter Night 02:40\n19. Easter Parade 02:58\n20. Spring Will Be A Little Late This Year 03:00\n21. September Song 03:44\n22. I'll Remember April 02:24\n23. 'Tis Autumn 02:42\n24. June In January 02:33\n\n\nBiography by William Ruhlmann\n\nAlthough most of her career was conducted during the rock era, traditional pop singer Eydie GormÃƒÂ© carved out a place for herself in several areas of entertainment. For 20 years, from the mid-'50s to the mid-'70s, she consistently scored in the pop charts, with a parallel place in the Latin pop field from the 1960s on. She appeared on television and on the Broadway stage. And she was a major nightclub entertainer, headlining in Las Vegas showrooms and around the U.S. For most of her career, she worked both solo and in a duo with her husband, Steve Lawrence.\nGormÃƒÂ© was born Edith Gormezano, the youngest of three children of Sephardic Jewish immigrant parents (her father was a tailor from Sicily, her mother was from Turkey), in the New York City borough of the Bronx on August 16, 1931. Spanish and English were spoken in her home, and she grew up fluent in both languages. She showed an interest in singing early and made her radio debut at the age of three. By the time she was in high-school, she was singing with a band led by a friend named Ken Greengrass. After graduating from high-school, she got a job as a Spanish interpreter with the Theatrical Supply Export Company and attended the City College of New York at night. Soon, however, she determined to try to become a professional singer, and Greengrass became her manager. In 1950, she was hired by bandleader Tommy Tucker and toured with his group for two months. She then spent a year with Tex Beneke's band before going solo. In 1952, she was signed to Coral Records, which released a series of singles, beginning with &quot;That Night of Heaven.&quot; In September 1953, she became a regular on the late-night talk show Tonight!, hosted by Steve Allen, which at that time was only broadcast in New York. Already on the show was singer Steve Lawrence. On September 27, 1954, the program began broadcasting nationally on NBC. Around the same time, Lawrence and GormÃƒÂ© released their first single as a duo, &quot;Make Yourself Comfortable&quot;/&quot;I've Gotta Crow,&quot; the latter from the Broadway musical Peter Pan.\nGormÃƒÂ© made her first appearance at the prestigious Copacabana club in New York in February 1956. The year before, she had switched from Coral Records to ABC-Paramount, and her second release for the new company, &quot;Too Close for Comfort&quot; (from the Broadway musical Mr. Wonderful), marked her chart debut in April 1956 and became a Top 40 hit. Its follow-up, &quot;Mama, Teach Me to Dance,&quot; also peaked in the Top 40. In 1957, she had three more chart singles, the most successful of them being the Top 40 hit &quot;Love Me Forever,&quot; and she placed two LPs in the Top 20: Eydie GormÃƒÂ© and Eydie Swings the Blues.\nOn December 29, 1957, GormÃƒÂ© married Lawrence. Steve Allen, having left Tonight!, had launched a prime-time series, and Lawrence and GormÃƒÂ© hosted its summer replacement, Steve Allen Presents the Steve Lawrence-Eydie GormÃƒÂ© Show, in July and August 1958, running from eight p.m. to nine p.m. on Sunday nights. Meanwhile, GormÃƒÂ© placed another three singles in the charts in 1958, the most successful of them being the Top 20 hit &quot;You Need Hands,&quot; and she also scored another two Top 20 albums, Eydie Vamps the Roaring '20s and Eydie in Love .... Although she continued to record and do club dates, she was somewhat less active in the late 1950s as she and Lawrence started a family (their first son, David Lawrence, became a film composer) and he fulfilled his military commitment. They relaunched their career in 1960 with a series of joint club engagements and their first full-fledged duo album, We Got Us; the title song won them the Grammy Award for Best Performance by a Vocal Group.\nLate in 1960, GormÃƒÂ© switched label affiliations to United Artists Records, but she never scored any hits with the company, and by 1962 she had moved to Columbia Records. Her first single, a revival of &quot;Yes My Darling Daughter,&quot; became a Top Ten hit in the U.K. in the summer of 1962, but in the U.S. she re-ignited her recording career in early 1963 with &quot;Blame It on the Bossa Nova,&quot; written by the Brill Building songwriting team of Barry Mann and Cynthia Weil, which reached the Top Ten and earned her a Grammy nomination for Best Female Vocal Performance. During the rest of the year, she placed four more singles in the charts, two of them with her husband, billed simply as Steve &amp; Eydie. Those duo records, I Want to Stay Here and I Can't Stop Talking About You (both written by another Brill Building team, Carole King and Gerry Goffin), reached the Top 40, as did GormÃƒÂ©'s solo album Blame It on the Bossa Nova.\nLike all traditional pop singers, GormÃƒÂ© was thrown into the shade by the British Invasion of 1964. She did manage to get some attention, however, by teaming up with the Trio Los Panchos and recording a Spanish-language album, Amor, that spent 22 weeks in the charts. She and the trio followed with More Amor in 1965. Meanwhile, she was also delving into contemporary show tunes for her singles, cutting Richard Rodgers and Stephen Sondheim's &quot;Do I Hear a Waltz?,&quot; Burton Lane and Alan Jay Lerner's &quot;What Did I Have That I Don't Have?&quot; (from On a Clear Day You Can See Forever), and Jerry Herman's &quot;If He Walked Into My Life&quot; (from Mame). The last of these gave her a Top Ten easy listening hit in 1966 and brought her her first solo Grammy Award for Best Female Vocal Performance. In the same year, her Don't Go to Strangers LP became a Top 40 hit and her Spanish-language holiday collection Navidad Means Christmas reached the Top Ten of the Christmas chart.\nGormÃƒÂ© continued to record and to chart in 1967, but with diminishing results. Her solo album, Softly, as I Leave You, reached the Top 100, which charted better than her duo album with Lawrence, Together on Broadway, did, and by the end of the year Columbia had issued Eydie GormÃƒÂ©'s Greatest Hits, a sign that the label felt her biggest success was behind her. Meanwhile, she and Lawrence had ambitious plans. They had arranged to co-star in a Broadway musical, Golden Rainbow, an adaptation of the Arnold Schulman play A Hole in the Head that had also served as the basis for the Frank Sinatra movie of that title, but with a new song score written by Walter Marks. In anticipation of the show's opening, the Columbia subsidiary released GormÃƒÂ©'s recording of &quot;How Could I Be So Wrong,&quot; one of her songs from the show, and it reached the Easy Listening charts in December 1967. Golden Rainbow opened on February 4, 1968, and was a success, playing 385 performances before closing on January 12, 1969. Meanwhile, GormÃƒÂ© and Lawrence continued to record for Columbia and Calendar, but during 1968, they moved operations to RCA Victor Records. The new label initially scored with their duo LPs What It Was, Was Love (a concept album composed by Gordon Jenkins), and Real True Lovin' in 1969, but in the fall GormÃƒÂ©'s solo single &quot;Tonight I'll Say a Prayer&quot; got into the charts, followed by an LP of the same name released in February 1970.\nBy the early 1970s, traditional pop singers were having trouble maintaining their berths with the major labels. GormÃƒÂ© and Lawrence continued to record for RCA Victor into 1971, scoring several Easy Listening chart entries, then switched to MGM Records, which tried to make a last stand for traditional pop with performers like them and Tony Bennett. There was a GormÃƒÂ© solo album, It Was a Good Time, in 1971, and a duo album, The World of Steve &amp; Eydie, in 1972, that produced a final pop singles chart entry, &quot;We Can Make It Together,&quot; featuring the Osmonds; this was followed by a few singles in 1973. After that, GormÃƒÂ© was no longer a factor in the pop charts. Fortunately, she and Lawrence had built up a steady following for club and television appearances. In 1975, they had a TV special, Our Love Is Here to Stay, that was their tribute to George Gershwin. It spawned an LP and won an Emmy Award. GormÃƒÂ©, meanwhile, turned to the Latin market. She was nominated for a 1976 Grammy for Best Latin Recording for her album La GormÃƒÂ© on Gala Records, and again in 1977 for Muy Amigos Close Friends, an album she recorded with Danny Rivera. There were also occasional English-language recordings. In September 1976, she returned to the Easy Listening chart with her version of &quot;What I Did for Love&quot; from the Broadway musical A Chorus Line on United Artists Records. The success of the Gershwin program led to other composer tribute albums, and the 1978 special Steve and Eydie Celebrate Irving Berlin won seven Emmys, including one for Outstanding Comedy-Variety or Music Program (Special or Series) that went to GormÃƒÂ© and Lawrence as performers, along with the producers and executive producers.\nGormÃƒÂ© and Lawrence made only occasional ventures into recording in the late '70s and '80s. Recording as &quot;Parker &amp; Penny,&quot; they placed a single, &quot;Hallelujah,&quot; in the Adult Contemporary chart in 1979. In 1989, they launched their own GL Music label with the duo album Alone Together. (Eventually, GL began to reissue their old albums on CD, available at www.steveandeydie.com.) But they did turn-away business in Las Vegas and such A-list venues as Carnegie Hall in New York and the Universal Amphitheater in Los Angeles. In 1990-91, they appeared with Frank Sinatra on his &quot;Diamond Jubilee&quot; tour commemorating his 75th birthday, and they were on Sinatra's Duets II album in 1994. The duo got in on the lounge craze of the mid-'90s, recording their version of Soundgarden's &quot;Black Hole Sun&quot; for the 1997 Hollywood Records collection Lounge-A-Palooza. They continued to appear in Las Vegas into the new century, closing the Circus Maximus showroom of Caesar's Palace in September 2000 to conclude ten years of performances there. They did not perform again in Las Vegas until the spring of 2004, when they opened in the Wayne Newton Theater of the Stardust Hotel on April 29.","torrent":{"xt":"urn:btih:f87065f82f56262e26c01b61571e93b4ad05d3d9","amp;dn":"Eydie+Gorme+-+Eydie+Gorme+%26+Love+Is+The+Season+-+%5BEAC-MP3%40320KBP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f87065f82f56262e26c01b61571e93b4ad05d3d9","infoHashBuffer":{"type":"Buffer","data":[248,112,101,248,47,86,38,46,38,192,27,97,87,30,147,180,173,5,211,217]},"announce":[],"urlList":[]}}