{"title":"Glee_Vol_One_Road_to_Sectionals_Disc_1_4","uid":5268989,"size":7982315567,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f8c8073a3549172d57e44099efc3efafabf6db00&amp;dn=Glee_Vol_One_Road_to_Sectionals_Disc_1_4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"glammaniac","files":60,"time":1262983733,"description":"APOLOGIES IN ADVANCE AS THIS UPLOAD MIGHT BE A LITTLE SLOW AT FIRST.  STUPID ISP!!!  JUST BE PATIENT\n\nThis is an exact copy of DISC 1 of the RETAIL DVD SET.  It's the ts folder and content obtained via MacTheRipper.  I'm not sure whether there are people out there, like me, who would prefer the actual DVD over the individual show files floating around so I am posting this up.  I will post the other 2 DVDs once I see that there is at least 1 full copy out there.  Don't want to post all 4 at once since it'll go even slower.\n\n\n\nENJOY!\n\nSHOW INFO\n\nFrom Ryan Murphy, the creator of &quot;Nip/Tuck,&quot; comes GLEE, a new comedy for the aspiring underdog in all of us.\n\nThe series follows an optimistic teacher, WILL SCHUESTER (Matthew Morrison), who - against all odds and a malicious cheerleading coach - attempts to save McKinley High's Glee Club from obscurity, while helping a group of aspiring underdogs realize their true star potential. It's a tall order when the brightest stars of the group include KURT (Chris Colfer), a soprano who hits a high note in fashion; MERCEDES (Amber Riley), a larger-than-life diva with a voice to match; ARTIE (Kevin McHale), a geeky guitarist who rocks and rolls; and TINA (Jenna Ushkowitz), a punk rocker who hides behind her stutter and blue hair extensions.\n\nWill's only hope lies with two true talents: RACHEL BERRY (Lea Michele), a self-proclaimed star who is convinced that MySpace and show choir and are her tickets to fame; and FINN HUDSON (Cory Monteith), the popular high school quarterback with movie star looks who must protect his reputation from his holier-than-thou girlfriend and &quot;Cheerios&quot; head cheerleader, QUINN (Dianna Agron), and his arrogant football teammate, PUCK (Mark Salling).\n\nWill is determined to do whatever it takes to make Glee great again, but his only ally is fellow teacher and germaphobe EMMA PILLSBURY (Jayma Mays). Everyone else around him thinks he's nuts - from his tough-as-nails wife TERRI SCHUESTER (Jessalyn Gilsig) to McKinley's scheming cheerleading coach SUE SYLVESTER (Jane Lynch) - but he's out to prove them wrong.\n\nFeaturing a soundtrack of hit songs from past and present, GLEE is produced by Ryan Murphy Television in association with 20th Century Fox Television. Ryan Murphy, Brad Falchuk and Ian Brennan are co-creators of the series. Murphy, Falchuk and Dante Di Loreto serve as executive producers, while Ian Brennan serves as co-executive producer. Murphy directed the pilot.\n\nDVD CONTENT\nMain Movie\n     Video - Untouched\n     Audio - English 5.1\n     Subs  - English, Spanish, French, Portuguese\n\nMenu\n     Original Menu\n\nExtras/Special Features\n     On Disc 4 (Coming Soon)\n\nChapters\n     Disc 1: 187 Minutes\n          Pilot - Director's Cut\n          Showmance\n          Acafellas\n          Preggers","torrent":{"xt":"urn:btih:f8c8073a3549172d57e44099efc3efafabf6db00","amp;dn":"Glee_Vol_One_Road_to_Sectionals_Disc_1_4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8c8073a3549172d57e44099efc3efafabf6db00","infoHashBuffer":{"type":"Buffer","data":[248,200,7,58,53,73,23,45,87,228,64,153,239,195,239,175,171,246,219,0]},"announce":[],"urlList":[]}}