{"title":"The Dark Lord: H.P. Lovecraft, Kenneth Grant, and the Typhonian","uid":8829700,"size":8245311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f921c487c9577372f0e0e3d38b010ccebdeab20f&amp;dn=The+Dark+Lord%3A+H.P.+Lovecraft%2C+Kenneth+Grant%2C+and+the+Typhonian+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"celine23","files":1,"time":1376934873,"description":"One of the most famous - yet least understood - manifestations of Thelemic thought has been the works of Kenneth Grant, the British occultist and one-time intimate of Aleister Crowley, who discovered a hidden world within the primary source materials of Crowley's Aeon of Horus. Using complementary texts from such disparate authors as H.P. Lovecraft, Jack Parsons, Austin Osman Spare, and Charles Stansfeld Jones (&quot;Frater Achad&quot;), Grant formulated a system of magic that expanded upon that delineated in the rituals of the OTO: a system that included elements of Tantra, of Voudon, and in particular that of the Schlangekraft recension of the Necronomicon, all woven together in a dark tapestry of power and illumination.\n\nThe Dark Lord follows the themes in the writings of Kenneth Grant, H.P. Lovecraft, and the Necronomicon, uncovering further meanings of the concepts of the famous writers of the Left Hand Path. It is for Thelemites, as well as lovers of the Lovecraft Mythos in all its forms, and for those who find the rituals of classical ceremonial magic inadequate for the New Aeon.\n\nTraveling through the worlds of religion, literature, and the occult, Peter Levenda takes his readers on a deeply fascinating exploration on magic, evil, and The Dark Lord as he investigates of one of the most neglected theses in the history of modern occultism: the nature of the Typhonian Current and its relationship to Aleister Crowley's Thelema and H.P. Lovecraft's Necronomicon.","torrent":{"xt":"urn:btih:f921c487c9577372f0e0e3d38b010ccebdeab20f","amp;dn":"The+Dark+Lord%3A+H.P.+Lovecraft%2C+Kenneth+Grant%2C+and+the+Typhonian+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f921c487c9577372f0e0e3d38b010ccebdeab20f","infoHashBuffer":{"type":"Buffer","data":[249,33,196,135,201,87,115,114,240,224,227,211,139,1,12,206,189,234,178,15]},"announce":[],"urlList":[]}}