{"title":"Terminator - The Sarah Connor Chronicles S01E05 - Queen's Gambi","uid":4199174,"size":366965090,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f94077e049daf4695e2cc514a75e9bb74b92ff63&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E05+-+Queen%5C%27s+Gambi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chimera2005","files":1,"time":1211403079,"description":"Fifteen years ago, deep within a Central American jungle, a young Sarah trudges her way to a camp, and then watches the then eight year old John Connor playing chess with an older soldier as a part of his strategy training.\n\nBack in the present day, Sarah does her routine rigorous exercise and takes a handful of vitamins, and prepares lunches for John and Cameron before they go to school. Andy Goode calls and asks Sarah to meet him at Pasadena. He recoded his artificial intelligence prototype, The Turk, in a coffee shop in Van Nuys, where he has entered a chess tournament. In the dining room, John and Cameron are doing their homework. Sarah tells John that she&amp;#039;s heading to Pasadena to meet Andy, and John and Cameron can meet her there after school. At Charley Dixon&amp;#039;s home, Cromartie, disguising himself as FBI Agent Robert Kester, demands that Charley tell him the whereabouts of Sarah and John. Charley swears he doesn&amp;#039;t know. He says as far as he knows, Sarah Connor blew herself up inside a bank vault eight years ago. Cromartie then leaves his business card, asking Charley and his wife to call if they have any information.Charley&amp;#039;s wife, Michelle, knew that Charley was lying to Cromartie. She asks Charley to tell her the truth. Charley then told her that John came by to their home weeks ago. He doesn&amp;#039;t have a plan of how to deal with Sarah coming back into his life again. Sarah arrives in a convention hall full of robots and computers. Andy arrives and shows her his rebuilt prototype. This new version is more adaptable, less predictable, and more eager to learn than the previous one. Dimitri Shipkov, Andy&amp;#039;s partner, taught the Turk to play chess. Andy tells Sarah that the winner of the tournament will get a cash prize and a military contract. Andy and Dimitri will split the money and the deal afterward. Sarah is then silently disturbed by how things are going with The Turk. In school, students place notes and flowers around a memorial for Jordan Cowan. Cameron does not understand why people would write notes to the deceased, and John explains it is one of the ways people deal with sadness. John then talks to Cheri, but she shuns him after a brief talk.\n\nIn an auto class, two Hispanic-American students argue about a piece of equipment. John steps in to help one of them, named Morris. John and Morris immediately become friends afterward. Morris mentions that he saw John with Cheri, and his advice to John is that he should stay away from her because her father has her on lock down. Sarah watches the chess tournament as The Turk competes with another artificial intelligence program, created by Japanese developers. Sarah notices a stranger entering the auditorium, who she finds alarmingly familiar. John and Cameron arrive at the convention hall, with Cameron looking over the robots throughout the auditorium curiously. Sarah informs John of the military contract, and tells him to cheer on the Japanese, or Cameron will kill Andy. When the Japanese team loses its queen it appears Andy may soon win the game, but lose his life. However the Japanese make a sudden move, placing The Turk in checkmate. Sarah then heads to Andy&amp;#039;s hotel room and bumps into the man who was lurking in the auditorium. She opens the door and finds Andy dead on the ground. After seeing the body she chases after the man, and tackles him in an alley. The man breaks free but then finds himself surrounded by a dozen police vehicles, with no choice but to surrender himself to them. Sarah, upset over Andy&amp;#039;s death, takes it very personally. The next day, John hacks into the country&amp;#039;s law enforcement database and pulls up the image of the stranger Sarah fought last night. They are able to identify him as a Resistance fighter, one of John&amp;#039;s best soldiers in the future. At the same time a T-888 Terminator (the one which escaped from Cameron in &quot;Gnothi Seauton&quot;) also hacks into the database, and later walks up to a pair of police officers and attacks one, purposely getting himself arrested and coincidentally sent to the same prison as the Resistance fighter.\n\nAt school, Cameron goes to see one of the school counselors. The counselor asks Cameron what Jordan talked about before she died. She repeats the conversation and knew that Jordan was upset about the graffiti. Cameron then leaves the office, leaving the counselor concerned.\n\nIn the county jail, the stranger sits across from Agent Ellison, and the agent shows him the photo from his apartment. Ellison then asks the stranger about the strange blood-like substance found in the apartment, hoping to find an answer. The stranger knows that Ellison won&amp;#039;t believe him, but does give him a grim warning that everyone is about to die. As Ellison leaves, he walks past the T-888 Terminator posing as an inmate in the prison. Outside the county jail, Sarah, in a business suit, is talking to the school&amp;#039;s counselor on her cell phone about Cameron&amp;#039;s strange behavior. Sarah hangs up on him. She later walks into the interrogation room, where she poses as a lawyer for the stranger. The stranger admits that he knows who Sarah really is; he tells Sarah that he didn&amp;#039;t kill Andy, and that he just wanted to destroy his prototype. Andy was dead before he got into his room, and the prototype had been stolen. He begs her to leave, because he knows that the T-888 is after him. The stranger tells Sarah that his brother carried her photo for luck. The stranger introduces himself to her as Derek Reese. She realizes that he is the brother of her deceased lover, Kyle Reese, and the paternal uncle of her son. Meanwhile, the T-888 Terminator breaks out of its cell and begins searching for Derek Reese.\n\nJohn tries to talk to Cheri, but she shuns him, then walks to her father&amp;#039;s car. Moments later, Sarah arrives and informs John and Cameron that they have a mission. In a transport van, Derek begins to lock-pick his handcuffs. Sarah chases the van, and Cameron jumps onto the transport and disables the guards driving it. After they take over the vehicle, they see in the rear-mirror that the T-888 is chasing after them. Cameron engages in violent combat with the cyborg, and during the struggle, the T-888 loses an arm after Sarah edges the moving van near another truck. As the battle continues the T-888 briefly seems like it may defeat Cameron singlehandedly, but Sarah fires her pistol to distract the Terminator, giving Cameron a chance to break free and briefly fight the Terminator off. The Terminator flees from Cameron, but after detecting Derek in the truck it takes out a pistol and shoots him. Seconds later, Cameron attacks the T-888 from behind by hitting it with a metal pipe, taking the cyborg down and (with John&amp;#039;s help) extracts the CPU chip from his exposed endoskull, permanently terminating it. The group then flees the scene and takes Derek back to their house. However, his injury is beyond Cameron&amp;#039;s capability to treat. Realizing that Derek needs immediate medical attention, Sarah plans to kidnap a doctor. John argues with her, and Sarah reveals to him that Derek is John&amp;#039;s father&amp;#039;s brother, therefore his paternal uncle. Overwhelmed, John runs out of the house.\n\nEllison goes over the events with the drivers of the armed truck. As he is examining the scene he finds the remains of the T-888 endoarm that it lost during the fight, and looks at it strangely. Meanwhile, Sarah does everything she can to keep pressure on Derek&amp;#039;s wound, while Cameron is writing a note. Derek suddenly stops breathing as John returns home, with Charley behind him. Charley pauses after seeing Sarah, then begins to perform CPR on Derek.","torrent":{"xt":"urn:btih:f94077e049daf4695e2cc514a75e9bb74b92ff63","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E05+-+Queen%5C%27s+Gambi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94077e049daf4695e2cc514a75e9bb74b92ff63","infoHashBuffer":{"type":"Buffer","data":[249,64,119,224,73,218,244,105,94,44,197,20,167,94,155,183,75,146,255,99]},"announce":[],"urlList":[]}}