{"title":"Dell Venue 8 Pro Windows 8.1 Install Disc","uid":9838854,"size":3175680192,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f954aa5e682eed13a27a3abb1fdf850a6e396751&amp;dn=Dell+Venue+8+Pro+Windows+8.1+Install+Disc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"msaw6261","files":2,"time":1395953300,"description":"Created from MSDN Windows 8.1 x86 ISO (Untouched)\n\nChanges:\n- Added latest drivers from Dell site as of March 16th 2014 into the image.\n- Enabled .NET 3.5 Framework within the .wim file.\n- Includes autoattend.xml answer file to allow Windows to install without any prompts. (See below for info.)\n\nWhat the unattend file does:\n- Since the Venue 8 Pro has a touchscreen, Windows doesn't support it within Windows setup. To bypass this we can either hook up\na hub to the OTG adapter and use a keyboard and mouse or use an unattend file.\n\nThe unattend file includes the following changes:\n- Deletes all partitions automatically and creates four partitions. One 300 MB partition, 2 UEFI partitions, and one extended partition for Windows that wioll fill\nthe rest of the drive. Make sure to remove the SD card just in case it tries to use that.\n- Installs Windows 8.1 (Core not pro) with a generic OEM key.\n- Enables .NET framework, telnet and tftp clients automatically.\n- Disables IE welcome page and sets homepage to Google.\n- Randomly names the tablet.\n- Sets the owner and company name to &quot;*&quot;\n\n**One can easily edit the unattend file to reflect what changes you want to add or remove.**\n\nNothing else in this image is touched. Those are the only changes.\n\nTo install your OEM key and remove the generic one, open up a command prompt as admin and run the following:\n\n- slmgr /upk\n- slui 3 \t(Enter in you OEM Product Key here)\n\n\nBefore even installing this image, please get your current OEM key BEFORE reinstalling Windows.\n\nMake sure your battery is fully charged before attempting to reload Windows. \n\nInstructions:\n\na. Get current OEM Product Key\n1. Copy ISO to flash drive. Use Windows 7 USB Download Tool.\n2. Fully shut down tablet.\n3. Attach flash drive to OTG adapter. \n4. Press the power button while holding the volume down button for 3-5 seconds then release.\n5. You should now enter the BIOS. Go over to boot and change the boot order to list the flash drive first. Save and exit BIOS.\n6. The computer should now boot to the flash drive and start installing.\n7. Finish the user account creation and setup. Now you can follow the instructions to activate with the proper OEM key.\n8. Done!","torrent":{"xt":"urn:btih:f954aa5e682eed13a27a3abb1fdf850a6e396751","amp;dn":"Dell+Venue+8+Pro+Windows+8.1+Install+Disc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f954aa5e682eed13a27a3abb1fdf850a6e396751","infoHashBuffer":{"type":"Buffer","data":[249,84,170,94,104,46,237,19,162,122,58,187,31,223,133,10,110,57,103,81]},"announce":[],"urlList":[]}}