{"title":"OS2 Warp Server v4.52 (Convenience Package 2)","uid":3670019,"size":754708943,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:fb29bcf02fddc58a2eb96fbb384d833b7f6fa6b7&amp;dn=OS2+Warp+Server+v4.52+%28Convenience+Package+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blandreth","files":2,"time":1177191244,"description":"Convenience Package 2 for IBM(R) OS/2(R) Warp Server for e-business \nREADME\n-----------------------------------------------------------------\n\nThis README contains installation instructions and other information \nfor the Convenience Package 2 for IBM OS/2 Warp Server for e-business \n(hereafter referred to in this document as &quot;WSeb C-Pak2&quot;).\n\nIf there are any updates to this README after WSeb C-Pak2 ships, the\nupdates will be placed on the &quot;Network Computing Software Support \nNews&quot; Web site (also called FIXNEWS). This Web site contains a list \nof fix-related news items. The Web address for FIXNEWS is:\n &lt;a href=&quot;\nhttp://ps.software.ibm.com/pbin-usa-ps/getobj.pl?/pdocs-usa/fixnews.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ps.software.ibm.com/pbin-usa-ps/getobj.pl?/pdocs-usa/fixnews.html&lt;/a&gt;\n\nIn addition to this README, a Technical Notes document is provided which\ncontains non-installation related technical material and notes on a \nvariety of OS/2 topics. You can view the Technical Notes by opening the \nInformation Folder and clicking the TECHNOTE object.\n--------------------------------------------------------------------\n\nCONTENTS\n--------\n\nConvenience Package 2 for IBM OS/2 Warp Server for e-business \nVersion 4.52 README\n\n   1.0 System prerequisites\n   2.0 Installation instructions\n        2.1  Starting installation with diskettes\n        2.2  Installing from a CD        \n        2.3  Installing Multimedia device support\n        2.4  Installing the WSeb C-Pak2 over a previous \n             version of OS/2\n        2.5  Installing and updating the HPFS386 feature\n        2.6  Installing a previous version of OS/2 after installing\n             the WSeb C-Pak2\n        2.7  Installing on a hidden partition\n        2.8  Installing on an IBM ThinkPad(R) computer\n        2.9  Customizing installation through a file command\n        2.10 Installing the WSeb C-Pak2 using CID\n        2.11 Troubleshooting installation        \n   3.0 Optional software\n        3.1  USB Support\n        3.2  PCI Yamaha YMF724 (DS-1) audio\n        3.3  PCI Ensoniq ES1371 audio\n        3.4  TrackPoint IV support \n   4.0 Installing other software        \n        4.1  Installing IBM OS/2 Warp Developer Kit, Java(R) 2 \n             Technology Edition, Version 1.3\n        4.2  Installing Java 1.1.8 components\n        4.3  Updating Java 1.1.8            \n        4.4  UDF restrictions in PM mode\n        4.5  Migrating LAN services\n        4.6  Running a DB/2 server over NetBIOS/TCPBEUI on WSeb C-Pak2\n        4.7  Installing WorkSpace On-Demand 2.0 on a WSeb C-Pak2 server\n        4.8  Installing Netscape 4.61 for WSeb C-Pak2 RIPL clients\n        4.9  Using and Configuring Peer Service on RIPL DOS clients \n        4.10 Fonts for DBCS users   \n   5.0 Additional Information\n        5.1  README files\n        5.2  Books\n   6.0 Appendix A. Notices\n   7.0 Appendix B. Trademarks\n\n-----------------------------------------------------------------------\n\n\n1.0 SYSTEM PREREQUISITES\n------------------------\n\nThe following are the minimum system requirements for the WSeb C-Pak2:\n   \n   * 133 MHz Intel Pentium(R)-compatible CPU\n   * 32MB RAM; 64MB recommended\n   * 120MB for the base installation; 300MB minimum for the base\n     installation plus default installed components; 500MB recommended\n\nNote: \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\n-----------------------------------------------------------------------\n\n2.0 INSTALLATION INSTRUCTIONS\n-----------------------------\n\nIf you must create installation diskettes to start the installation\nprocess, start with the section titled Starting installation with \ndiskettes and then proceed to the Installing from CD section. If your \nsystem can boot from a CD, skip to the section titled Installing \nfrom CD. If you have problems installing the WSeb C-Pak2 from CD, \nfollow the instructions below about creating and using installation \ndiskettes.\n\nIf you are installing over a previous version of the operating system \n(also referred to in this document as &quot;migration&quot;), it is important \nthat you follow the steps in this README file, including ensuring that \nthe Multimedia Device Support field on the System Configuration panel \nis set to None during the initial migration. Multimedia Support \nrequires a second installation step, after completing installation of \nthe base operating system, using Selective Install. See step 7 under \nInstalling from CD and the section titled Migrating Multimedia support.\n\nNote:\n     If you are installing over a previous version of OS/2, you \n     should back up your system before installing the WSeb C-Pak2. \n     \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\n2.1 Starting installation with diskettes\n----------------------------------------\n\nTo create installation diskettes for installing the WSeb C-Pak2, \nstart with the section titled Starting installation with diskettes. If \nyou need to modify the diskettes for your particular system hardware, \nsee the sections under Modifying the installation diskettes for new \nhardware.\n\n2.1.1 Creating installation diskettes\n\nIf your system cannot boot from the WSeb C-Pak2 Installation CD, or if \nyou need to add device drivers before you begin installation, you must \ncreate installation diskettes to start your system and begin the \ninstallation process. You can create installation diskettes on any \nsystem that is already started and that has a diskette drive and a \nCD-ROM drive.\n\nTo create installation diskettes:\n\n  1. Gather three blank diskettes and the WSeb C-Pak2 CD.\n  2. Label the three diskettes as follows:\n        o Installation Diskette\n        o Diskette 1\n        o Diskette 2\n  3. Insert the WSeb C-Pak2 CD.\n  4. Open an OS/2 window.\n  5. From an OS/2 command prompt, type e: and press Enter (where e: \n     is the drive letter of the CD-ROM drive).\n  6. At the OS/2 command prompt, type CDINST and press Enter.\n  7. At the prompt Press any key when ready, press a key.\n  8. Insert the blank diskette labeled Diskette 1 and press Enter to \n     copy the files.\n  9. Remove Diskette 1 from the diskette drive and press Enter.\n 10. Insert the blank diskette labeled Diskette 2 and press Enter to \n     copy the files.\n 11. Remove Diskette 2 from the diskette drive and press Enter.\n 12. Insert the blank diskette labeled Installation Diskette into the\n     diskette drive and press Enter to copy the files.\n     Note:\n          You are prompted to leave the Installation Diskette in the\n          diskette drive and to restart the system. Do NOT follow the\n          prompt. Instead, continue as instructed below.\n 13. Remove the Installation Diskette from the diskette drive and \n     press Enter.\n 14. Close the OS/2 window.\n\nNow that the installation diskettes are created, you can either add \ndevice drivers to them, or you can start the installation process. To \nmodify the installation diskettes for your particular system --for \nexample, to add device drivers to the diskettes-- see Modifying the \ninstallation diskettes for new hardware and the sections that follow \nit. To start the installation process, see Starting the installation \nprocess with diskettes.\n\n2.1.2 Modifying the installation diskettes for new hardware\n\nThe WSeb C-Pak2 includes support for many device drivers. If, however,\nsupport for your hardware is not included, you must create \ninstallation diskettes, and then add the necessary device drivers to \nthe installation diskettes before starting installation. For example, \nyou might have a hard-disk controller with a CD-ROM drive attached to \nit that is not supported by the operating system. If during the \ninstallation process, you receive a message stating that your CD-ROM \ndrive is not supported, or if you are prompted to insert the CD, the \nnecessary device driver is probably not on the installation diskettes. \nTo locate the device driver you need, either contact the manufacturer \nof the device or see the OS/2 Device Driver Pak Online at the \nfollowing Web address:\n &lt;a href=&quot;\nhttp://service.software.ibm.com/os2ddpak/index.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://service.software.ibm.com/os2ddpak/index.htm&lt;/a&gt;\n\nAfter you obtain the appropriate device driver, you can modify the\ninstallation diskettes to support the new hardware in one of the \nfollowing ways:\n\n   * Add a device driver to the installation diskettes.\n   * Replace a device driver on the installation diskettes.\n   * Add parameters to existing device drivers.\n   * If there is not enough space on the installation diskettes to \n     copy the new device driver, see Creating space on the \n     installation diskettes for device drivers.\n   * If you want to replace one or more system files with a newer \n     version, see Replacing system files on the installation diskettes.\n\nRemember, if anything goes wrong, you can always recreate the \ninstallation diskettes. See Starting installation with diskettes for \ninformation for details.\n\n2.1.3 Adding a device driver to the installation diskettes\n\nUse this procedure when the device driver is new or is not included \nwith the WSeb C-Pak2. If there is not enough space on the installation \ndiskettes to copy the new device driver, see Creating space on the \ninstallation diskettes for device drivers.\n\nTo add a new device driver to the installation diskettes:\n\n  1. If your device driver requires a BASEDEV= statement in the \n     CONFIG.SYS file, add your device driver to Diskette 1. \n     Otherwise, the device driver uses a DEVICE= statement and is \n     copied to Diskette 2.\n  2. Modify the CONFIG.SYS file on Diskette 1 as follows:\n       a. Make sure the following statement exists in the CONFIG.SYS \n          file:\n\n          SET SAVECONNECT=1\n\n       b. Add the following statement to ensure that the device driver \n          is copied throughout the installation process:\n\n          SET COPYFROMFLOPPY=1\n\n       c. Add the appropriate statements to the CONFIG.SYS file:\n\n          BASEDEV=driver_name\n          DEVICE=driver_name\n\n     Note:\n          If the connection to the hard disk or CD-ROM drive is lost \n          during the installation process or when you restart your \n          system, make sure the CD-ROM device driver statement is in \n          the CONFIG.SYS file on the correct diskette, and make sure \n          that the CD-ROM device driver is copied to the OS2BOOT \n          directory. All device driver statements must include path \n          information, such as DEVICE=C:OS2BOOTCOM.SYS.\n\n2.1.4 Replacing a device driver on the installation diskettes\n\nUse this procedure to install a newer version of a device driver that \nwas included with the WSeb C-Pak2. If there is not enough space on the\ninstallation diskettes to copy the new device driver, see Creating \nspace on the installation diskettes for device drivers.\n\nTo replace a device driver that resides on Diskette 1 or Diskette 2:\n\n  1. Copy the new device driver file over the existing file on \n     Diskette 1 or Diskette 2.\n  2. Add the following statement to the CONFIG.SYS file on \n     Diskette 1:\n\n     SET COPYFROMFLOPPY=1\n\nThe installation program uses the new device driver and copies the\nnecessary files to the target volume.\n\n2.1.5 Adding or modifying parameters for existing device drivers\n\nUse this procedure when you need to add or modify parameters to \nexisting device drivers and these parameters must be copied to the \ntarget volume during installation.\n\nTo add or modify parameters for existing device drivers, modify \nthe CONFIG.SYS file on Diskette 1 as follows:\n\n  1. Add or modify the required parameters for the device driver&amp;#039;s \n     BASEDEV= and DEVICE= statements.\n  2. Make sure that the following statement exists in the CONFIG.SYS \n     file on Diskette 1:\n\n     SET SAVECONNECT=1\n\nThe installation program copies the modified lines to the CONFIG.SYS \nfile on the target volume.\n\n2.1.6 Creating space on the installation diskettes for device drivers\n\nIf you must create free space on Diskette 1, depending on your system\nhardware configuration, you can try one or more of the following \nprocedures before you copy the new device drivers to the installation \ndiskettes. For each file you delete from the diskette, you must also \nremove or comment out the corresponding statement from the CONFIG.SYS \nfile and from the SNOOP.LST file.\n\n   * If you are installing the WSeb C-Pak2 on a system that does not \n     have a SCSI (Small Computer System Interface) adapter, you can \n     delete one or more of the following files to free up to 700KB \n     of diskette space: \n\n      Filename    Size\n\n      SYM8XX.ADD  63,580\n      SYM_HI.ADD  67,140\n\n   * If you are installing the WSeb C-Pak2 on a SCSI system, \n     determine which SCSI adapter you are using, and remove the \n     SCSI drivers that you are not using. If you have a problem \n     starting the system after removing the SCSI drivers, you have \n     removed the wrong drivers from Diskette 1. Copy the SCSI drivers \n     from the original Diskette 1 to the Diskette 1 you modified.\n   * If you are not using a RAID (Redundant Array of Independent \n     Disks) array system, you can remove the IPSRAID.ADD file to \n     free 20KB of diskette space.\n\nIf you must create free space on Diskette 2, you can \nremove certain files before you copy the new device drivers \nto the installation diskettes. To avoid installation problems,\ndo not remove any files other than the files listed below.\nRemove one or more of the following files to free up to 89KB of \ndiskette space:\n\n     TEDIT.EXE\n     TEDIT.HLP\n     RMVIEW.EXE\n     RMINFO.DLL\n     NPXEMLTR.DLL\n\n2.1.7 Replacing system files on the installation diskettes\n\nUse this procedure to install a newer version of one or more of the \nsystem files included on the Installation Diskette. The system files \ninclude the following:\n\n     OS2KRNLI\n     OS2LDR\n     OS2LDR.MSG\n     OS2BOOT\n\nTo add a new system file or files to the Installation Diskette:\n\n  1. Copy the new system file or files over the existing file or files \n     on the Installation Diskette.\n  2. Add the following statement to the CONFIG.SYS file on Diskette 1 \n     to ensure that the new system file or files are copied throughout \n     the installation process:\n\n     SET COPYFROMFLOPPY=1\n\n2.1.8 Starting the installation process with diskettes\n\nTo begin the installation process:\n\n   1. Gather the Installation Diskette, Diskette 1, Diskette 2, \n      and the WSeb C-Pak2 CD.\n   2. Insert the Installation Diskette, and then when prompted,\n      insert Diskette 1 and Diskette 2.\n   3. Insert the WSeb C-Pak2 CD.\n   4. Turn on or restart the system.\n   5. Proceed as indicated under Installing from CD, picking up at \n      step 3.\n      For more information, refer to the online help screens by \n      pressing F1.\n\n2.2 Installing from a CD\n------------------------\n\nTo install the WSeb C-Pak2:\n\n  1. Insert the WSeb C-Pak2 Installation CD and restart the system.\n  2. When prompted, remove the CD, insert the WSeb C-Pak2 CD, and \n     press Enter.\n  3. Follow the prompts on the screen as directed. For more \n     information, refer to the online help screens by pressing F1.\n  4. When the Installation Volume Selection panel is displayed, \n     choose to accept the default volume or to specify a different \n     volume for the installation and press Enter.\n\n     Notes:\n\n       1. WSeb C-Pak2 migration is supported only over a \n          corresponding C-Pak1 system. Otherwise, you must format \n          the operating system partition.\n\n       2. If you are installing the WSeb C-Pak2 on a system without \n          an existing operating system, choose to specify a different \n          volume. Doing so will start the Logical Volume Manager (LVM) \n          and enable you to create a new volume for the installation. \n          After you create a new volume and exit LVM, installation \n          continues.\n\n       3. If you specify a different volume as the installation \n          volume, the partition must be set to installable. You can \n          set the partition to be installable with LVM.\n  5. Select one of the following formatting options to format the\n     installation volume and press Enter:\n\n          Do not format the volume      (migration)\n          Perform a long format         (installation)\n          Perform a quick format        (installation)\n\n  6. If you select either a long or quick format, select the file \n     system for the installation volume and press Enter. A pop-up \n     warning about overwriting existing data is displayed. Click OK. \n     The installation volume is formatted. When the format is \n     complete, the system is automatically restarted and installation \n     continues.\n  7. On the System Configuration panels, specify the hardware and \n     country or region options that you want and click Next. For \n     information about these options, click Help. If you are installing \n     over a previous version of the operating system, make sure the \n     Multimedia Device Support field on the System Configuration panel \n     is set to None. Multimedia Support requires a second installation \n     step, using Selective Install, after completing installation of \n     the base operating system. See &quot;Migrating Multimedia support&quot;. This \n     step is not necessary if you are formatting your install partition \n     before installation.\n  8. On the Setup and Installation panels, select the operating system\n     features (such as printer utilities) to install and click Next. \n     For information about these features, click Help. For additional \n     information, click More. If you want Multimedia Software Support\n     select the Multimedia Software Support check box, even if you \n     selected None in the Multimedia Device Support field in step 7.\n\n     Note:\n          Multimedia must be installed on the boot drive of the \n          system.\n\n  9. Click Next to begin component installation.\n 10. If the Information panel appears, enter your name and company \n     information into the appropriate fields and click Next.\n 11. Select the services that you want to install and click Next. \n     For information about these services, click Help.\n 12. The Configuration panel is displayed. The installation items \n     that you can configure are listed on the left side of the window. \n     The items with green check marks next to them are correctly \n     configured. Any item with a red arrow next to it must be \n     configured. \n\n     To configure an item:\n\n       a. Click the item that you want to configure. The configuration\n          options for that item are displayed on the right side of the\n          window.\n       b. Make your configuration choices for the item.\n       c. When you are finished, click another item from the list to\n          configure.\n 13. Click Install, and then click OK to complete the installation.\n     \n     Note:\n          Your system is restarted automatically twice during the last\n          phase of installation.\n\n\n2.3 Installing Multimedia device support\n----------------------------------------\n\nThis section applies if you are formatting your install partition \nbefore you install the WSeb C-Pak2. If you are installing the WSeb \nC-Pak2 over an existing operating system (also called &quot;migration&quot;), \nsee Migrating Multimedia support. \n\nNote: \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\nThe installation process does not automatically detect multimedia \ndevices (audio cards); therefore, you must manually select the \nMultimedia Device Support option during installation if you want \nto install support for your device and configure its settings. \n\nIf your audio device does not appear in the audio device list during\nsystem configuration, select &quot;None&quot; and then contact the manufacturer \nof the device or go to the OS/2 Device Driver Pak Online at the\nfollowing Web address to obtain the driver:\n &lt;a href=&quot;\nhttp://service.software.ibm.com/os2ddpak/index.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://service.software.ibm.com/os2ddpak/index.htm&lt;/a&gt;\n \nIf you choose not to install support for your multimedia device during \ninstallation, you can set the operating system to automatically detect \nthe device and configure its settings after installation, as follows:\n\n  1. Delete the AUDFSAFE.TXT file from the OS2INSTALL directory in \n     the installation volume. For example, if you installed the \n     operating system on volume D:, delete the AUDFSAFE.TXT file from \n     the D:OS2INSTALL directory.\n  2. From the Desktop, double-click OS/2 System.\n  3. Double-click System Setup.\n  4. Double-click Install/Remove.\n  5. Double-click Selective Install. The System Configuration \n     window displays.\n  6. Click Multimedia Device Support to install multimedia \n     device drivers and configure the settings. Click Next.\n\nContinue through the subsequent windows until the installation has\ncompleted.\n\nNote:\n     Multimedia must be installed on the boot drive of the system.\n\n2.3.1 Migrating Multimedia support\n\nMultimedia support requires a second migration step after you have\ncompleted migrating the base operating system. Additional manual \nsteps might also be necessary to install drivers and locate icons. \n\nNote: \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\n2.3.2 Migrating Multimedia\n\nTo migrate Multimedia support:\n\n  1. Double click the OS/2 System folder, the System Setup \n     folder, and the Install/Remove folder, and then start \n     Selective Install.\n  2. On the first panel, System Configuration, click the icon \n     to the left of the Multimedia Device Support field. A list of \n     available drivers displays. If you find the driver that you \n     want to install, select it. If you do not find the driver, \n     leave the selection blank. In either case, continue with \n     Selective Installation to install the rest of the multimedia \n     support. If the multimedia driver that you want to install is \n     not in the list, see &quot;Manually installing multimedia drivers&quot; \n     for information on how to install your driver.\n  3. Click Next to continue with migration.\n  4. At the OS/2 Setup and Installation panel (the third panel), \n     select the Multimedia Software Support check box.\n     Note:\n          Multimedia must be installed on the boot drive of the \n          system.\n  5. Select Next to continue with Selective Installation. Follow \n     the directions on the screen.\n  6. At the end of Selective Install, restart your system. The \n     multimedia drivers should be working correctly.\n\n2.3.2.1 Manually installing multimedia drivers\n\nFor multimedia drivers that do not work after migrating the \nmultimedia support (for example, the VIDRMP.SYS driver for the \nReal Magic Pro card), you must install the drivers manually.\n\nTo install multimedia drivers manually, have your diskette ready, \nand enter the MINSTALL command from an OS/2 Command Line window. \nFollow the directions on the screen to complete installation.\n\n2.3.2.2 Recovering multimedia icons\n\nIf icons for some of the multimedia programs are missing, open \nthe Previous Desktop folder and use, copy, or drag the icons from \nthere to your new desktop.\n\n2.4 Installing the WSeb C-Pak2 over a previous version of OS/2\n--------------------------------------------------------------\n\nNote:\n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\nRead the following information if you are installing the WSeb C-Pak2 \nover a previous version of OS/2. You have three options:\n\n  1. Install the latest FixPaks to attain the most current service\n     level, which is approximately equivalent to C-Pak2.\n  2. Migrate to C-Pak1 and then migrate to C-Pak2.\n  3. Install C-Pak2 and reformat the operating system partition.\n\n2.4.1 TrackPoint IV\n\nIf you are installing the WSeb C-Pak2 over WSeb C-Pak1 and have been\nusing the TrackPoint IV driver, you must reinstall the driver after\nmigration. See the section &quot;TrackPoint IV support&quot; for installation\ninstructions.\n\n2.4.2 CHKINST\n\nIf CHKINST, a migration utility that scans your system for potential\nmigration problems (such as corrupt partitions or LVM-incompatible \nvolumes) fails, check that:\n\n  1. Syntax and parameters passed to CHKINST are correct.\n  2. VCU.EXE and VCU.MSG are in the directory where you are using \n     CHKINST. If these files are not in the directory, copy them \n     from the root directory of the CD.\n\n2.4.3 CONFIG.SYS\n\nIf you are installing the WSeb C-Pak2 over a previous \nversion of S/2, the installation process automatically migrates \nyour existing CONFIG.SYS file. However, if you changed any of the\nfollowing statements, the changes are not migrated.\n\n   * BUFFERS\n   * FILES\n   * IFS\n   * IOPL\n   * SET\n   * AUTOSTART\n   * SET RESTARTOBJECTS\n   * Other statements that have been added by applications\n\nIn audio device driver statements, parameters added after the \nDevice Name parameter are not migrated. For example, in a Pro \nAudio Spectrum device driver statement, parameters after PAS161$ \nare not migrated. To preserve your changes to these statements you \nmust manually migrate your CONFIG.SYS file.\n\n2.4.4 Japanese printer drivers\n\nIf you are using Japanese 16-bit printer drivers (DESKJET.DRV,\nEPSON.DRV,ESCPAGE.DRV, PMLIPS3.DRV or PSCRIPT.DRV) on your current \nsystem and you plan to migrate your system to the WSeb C-Pak2 without \nformatting, you must manually replace the 16-bit drivers with 32-bit \ndrivers. All the printers supported by 16-bit drivers are supported \nby 32-bit drivers. Below are the 16-bit printer drivers and their \nnewer equivalents:\n\n 16-bit driver                       32-bit driver\n\n DESKJET.DRV                         OMNI.DRV\n EPSON.DRV                           OMNI.DRV\n ESPAGE.DRV                          OMNI.DRV\n PMLIPS3.DRV                         OMNI.DRV\n PSCRIPT.DRV                         PSCRIPT2.DRV\n\nTo install the 32-bit drivers during installation, select from the \nproper printer model in printer selection panel and continue to install.\n\nTo install the 32-bit drivers after installation, use &quot;Selective\ninstallation&quot; and select the appropriate printer model you want.\n\nNote:\n     OS/2 clients and servers must use the same level printer drivers.\n\n2.4.5 Response file migration\n\nBefore performing a response file migration, run CHKDSK on the drive \nwhere the operating system is installed to ensure that there are no \nerrors in the file allocation table or directory. If errors are found \nin the file allocation table or directory, type the following command \nto repair those errors:\n\nCHKDSK C: /F\n\nwhere C: is the drive where the operating system is installed.\n\nNote:\n     Using the /F parameter locks the drive that CHKDSK is scanning.\n     Because of this, the drive to be fixed cannot be the startup \n     drive or the drive that contains the CHKDSK program. For more \n     information about CHKDSK, see the Command Reference.\n\n2.4.6 Multiple SOMIR statements in CONFIG.SYS\n\nIf you are installing the WSeb C-Pak2 over an existing copy of \nthe OS/2 operating system, after installation is complete, check your \nCONFIG.SYS file to verify that you only have one SET SOMIR= statement. \nIf you find more than one, merge the two copies into a single \nstatement (eliminating any duplicate entries).\n\n2.4.7 LAN Distance Connection Server\n\nThe WSeb C-Pak2 cannot be installed over a previously installed LAN\nDistance(R) Connection Server or LAN Distance Remote Server. Run \nLDREMOVE to remove LAN Distance Connection Server before installing \nthe WSeb C-Pak2.\n\nIf you plan to upgrade an installed LAN Distance Connection Server, \nbackup your current security user definition file before you run \nLDREMOVE. The existing user definition file is overwritten during \nthe installation process.\n\nTo backup the user definition file, copy the file named \nWCBUSRF.ISF from the WAL directory onto a diskette. (This file \ncontains the user definitions.) After the installation of the \nWSeb C-Pak2 is completed, copy the backed up file from the diskette \ninto the WAL directory.\n\n2.5 Installing and updating the HPFS386 feature\n-----------------------------------------------\n\nThe old version of 386 HPFS (High Performance File System) access \ncontrol lists must be removed before migrating the operating system.\n\nTo remove 386 HPFS access controls:\n\n  1. Stop the server by issuing the following command:\n\n     NET STOP SERVER\n\n  2. Type the following command to remove 386 HPFS access controls:\n\n     PREPACL /P /B:filename /D:drive\n\n     where /B:filename specifies a temporary file name to save the \n     access controls to and /D:drive specifies the drive where the \n     access controls currently reside.\n  3. Shut down and restart your computer.\n     \n     Note:\n          When removing 386 HPFS access controls, specify a unique \n          output file for PREPACL. If you specify a file that \n          already exists, PREPACL overwrites the file and loses the \n          ACL information you stored when you first ran PREPACL.\n\nIf you are installing the WSeb C-Pak2 on an empty volume, or if \nyou format the volume during installation, you must reinstall \nthe HPFS386 feature from your original WSeb CD.\n\nAfter completing the installation, you must update your HPFS386 \nfeature to the latest fix level. You can get FixPak IP_8605 \nfrom one of the following Web sites:\n\n   * http://service.boulder.ibm.com in the\n     /ps/products/lan/fixes/warp_srv_e-bus directory\n   * http://ps.software.ibm.com\n\nIf you are installing the WSeb C-Pak2 over a previous version of \nWarp Server for e-business, you only need to install the FixPak.\n\nNote: \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\n2.6 Installing a previous version of OS/2 after installing the \nWSeb C-Pak2\n----------------------------------------------------------------\n\nThe WSeb C-Pak2 uses the Logical Volume Manager (LVM) to configure \nand manage disk drives on the system. LVM replaces FDISK. Because \nof this, if you want to install an older version of OS/2 (such as \nOS/2 Warp 4.0) on the same computer as the WSeb C-Pak2, you must \nuse both LVM and FDISK during installation. After installation, use \nLVM for all disk management.\n\nTo install a previous version of OS/2 on the same computer as the \nWSeb C-Pak2:\n\n  1. From the WSeb C-Pak2, use LVM to create an installable volume \n     for the OS/2 version you want to install.\n       a. Start LVM by typing the following command at the command \n          line:\n\n          lvm /si:fs /size:120\n\n       b. Install Boot Manager, if it is not already installed.\n       c. Create a compatibility volume for the OS/2 version.\n       d. Mark the compatibility volume as installable.\n       e. Save your changes and exit LVM.\n  2. Locate the installation diskettes for the OS/2 version. Replace \n     all of the device drivers on the diskettes with their \n     counterparts from the WSeb C-Pak2. Do not replace any of the \n     device managers (.DMD files).\n  3. Add the following line to the CONFIG.SYS file on the OS/2 \n     installation diskettes:\n\n     SET COPYFROMFLOPPY=1\n\n  4. Install the OS/2 version.\n       a. Boot the system using the OS/2 installation diskettes you \n          updated in step 2. Begin the installation process.\n       b. When you are asked to select a drive for the installation, \n          do not accept the default. FDISK is displayed.\n       c. Find the FDISK partition you marked installable with LVM. \n          (It appears with &quot;--&gt; LVM*&quot; next to the name.)\n       d. Use FDISK to mark this partition installable. Press F1 \n          for help instructions on using FDISK.\n          Note:\n               Do not use FDISK to do anything other than mark the\n               partition installable.\n       e. Save and exit FDISK. The installation window displays.\n       f. Accept the default drive and continue with the \n          installation.\n\n          Note:\n               FDISK is not supported as part of the WSeb C-Pak2. \n               Any use of FDISK beyond the scope of these instructions \n               could harm your system. Use LVM for any disk management.\n\n2.7 Installing on a hidden partition\n------------------------------------\n\nIf you are going to install the WSeb C-Pak2 on a hidden primary \npartition on a machine with multiple, hidden, primary partitions, you \nmust follow this procedure. This procedure is not necessary if you \nare installing on a logical drive in an extended partition.\n\nAs you are going through the installation process, a panel displays \nthat identifies the target partition where the operating system will \nbe installed. Do not accept the default drive; it might be pointing \nat the wrong primary partition. Select the second option, Select \nanother drive, which starts the Logical Volume Manager (LVM) \nprogram.\n\nThe last drive you booted from (usually C:), should be highlighted. \nIf this is not the drive you intend to install to, press Enter and \nselect Hide Drive From OS/2.\n\nNext, highlight the volume on which you want to install the \noperating system. Press Enter and select Change Drive Letter. The \ndefault should be C: and you should select it.\n\nSelect that the volume should be bootable, and supply a name for \nthe Boot Manager menu. With the new C: still highlighted, press \nEnter again, and set the drive Installable.\n\nPress F3 to exit LVM, saving the changes. You will have to restart \nthe machine, as drive letters have changed.\n\nWhen you return to the panel that identifies the target partition \nwhere the operating system will be installed, select the second \noption again, to check that the proper drive is selected. Then \npress F3 to return (you do not need to save again) and continue \nwith installation.\n\nNote:\n     After you have used LVM on your physical disk drives, you \n     cannot use FDISK from Warp to work with your drives. The LVM \n     program creates a compatibility volume, and replaces the drive \n     names with &quot;-&gt;LVM&quot;. From this point on, you must use LVM to \n     manage your disk partitions.\n\n\n2.8 Installing on an IBM ThinkPad(R) computer\n---------------------------------------------\n\nThe following IBM ThinkPad installation options are not supported \non the WSeb C-Pak2:\n\n   * Warm Docking support\n   * Infrared support\n\nIf you are installing the WSeb C-Pak2 over C-Pak1 and have \nbeen using the TrackPoint IV driver, you must reinstall the driver \nafter migration. See the section &quot;TrackPoint IV support&quot; for \ninstallation instructions.\n\n2.8.1 System Hang or Hard Drive Hesitation\n\nThe problem is the IDE chip sets on certain planars signal that they \nsupport bus mastering but actually have a defect that prevents it \nfrom working correctly. The driver detects bus mastering support, \nenables bus mastering, and attempts to use it. Some symptoms are: \n\n   * System does not restart with IBM1S506.ADD\n   * CHKDSK command does not work properly\n   * Hard drive stops or hesitates for minutes at a time\n\nThis is a known problem with ThinkPad models 760E/ED/ELD/EL. \nHowever the chip set can, and does, appear on planars of other \nmanufacturers. To correct the problem: \n\n   1. Edit the CONFIG.SYS file on Diskette 1 or the boot drive. \n   2. Disable bus mastering by adding the /!BM parameter to the \n      BASEDEV statement defining the driver; for example: \n \n      BASEDEV=IBM1S506.ADD /A:0 /!BM /A:1 /!BM \n\n   3. Save the changes and restart the system.\n\n2.8.2 IBM Ultrabay(TM) and WarmSwap problems on IBM &quot;T&quot; and \n600-line ThinkPad computers\n\nIf you installed the appropriate UltraBay and WarmSwap support on \na &quot;T&quot; or 600-line ThinkPad computer, the secondary IDE channel must be \nenabled in order for WarmSwap to function correctly.\n\nTo enable the secondary IDE channel, the Configuration Utility \nfor DOS must be installed. If you need instructions on how to install \nthe Configuration Utility for DOS, refer to its manual. If this utility \nis already installed, enable the secondary IDE channel by completing \nthe following steps:\n\n  1. Open a DOS window and go to the directory where the PS2.EXE is\n     located.\n  2. Type the following command:\n\n     PS2.EXE ? IDE2\n\n     This command provides the information on the current secondary \n     IDE state. If the current state is Enable, go to step 5.\n  3. If the current state is Disable, you must change it to Enable\n     by entering the following command from the DOS command line:\n\n     PS2.EXE IDE2 Enable\n\n  4. Go to step 2 to verify if secondary IDE is enabled.\n  5. Close the DOS session. Reboot the ThinkPad if there was a \n     request in step 3.\n\n2.8.3 USB port support for IBM ThinkPad docking stations\n\nTo support the USB port on ThinkPad docking stations:\n\n  1. Open the CONFIG.SYS file in a text editor.\n  2. Add the following statement:\n\n     BASEDEV=USBUHCD2.SYS\n\n  3. Save and close the file.\n  4. Shutdown and restart your operating system after you have \n     finished.\n\n2.9 Customizing installation through a file command\n----------------------------------------------------\n\nNote:\n     This procedure is only for experienced REXX programmers.\n\nTo automatically update or add additional device drivers and other \nsystem files during the initial installation and to prevent these \ndevice drivers from being replaced by older versions, write a REXX \ncommand file, INSTEXIT.CMD. This command file is executed at defined \npoints during the installation process, accesses the hard disk of \nthe target machine, and can make additional configuration changes \nor copy additional files. The INSTEXIT.CMD can be placed on any of \nthe installation diskettes (and therefore is not applicable if you \ninstall from CD).\n\n2.9.1 Installation phases\n\nThe INSTEXIT.CMD file is called during the different phases of\ninstallation. The installation phases are described below:\n\n Phase 1         The installation volume is selected and formatted. \n                 The base OS/2 operating system files are copied.\n Phase 2         Hardware, software, and networking products are \n                 selected and configured. The remainder of the \n                 operating system is installed.\n Phase 3         Networking products are installed.\n\n2.9.2 INSTEXIT calls during installation\n\nThe INSTEXIT.CMD file is called two times during installation; \nduring Phase 1 and during Phase 3. INSTEXIT is also called once \nduring Selective Install for Networking.\n\n   * Phase 1: The installation program calls the INSTEXIT.CMD \n     file before the first reboot during installation. The following \n     parameters are passed:\n       1. The target drive letter (example C).\n       2. The CD-ROM drive letter (example E).\n       3. The word PHASE1 to indicate the exit is being called in \n          Phase 1 of installation.\n\nExample call:\n\ninstexit.cmd C E PHASE1 1&gt;nul 2&gt;&amp;1\n\nThe INSTEXIT.CMD return code is logged in IBMINSTLOGSCONINST.LOG. \nAfter INSTEXIT.CMD completes, installation continues.\n\n   * Phase 3: The installation program calls the INSTEXIT.CMD file \n     at the end of Phase 3 if the file exists in the root directory \n     of the installation volume. If the file is found, the install \n     shield is disabled. The following parameters are passed:\n       1. The target drive letter (example C).\n       2. The CD-ROM drive letter (example E).\n       3. The word PHASE3 to indicate the exit is being called in \n          Phase 3 of installation.\n\nExample call:\n\ninstexit.cmd C E PHASE3\n\nThe INSTEXIT.CMD return code is logged in OS2INSTALLNPINST.PRD. \nAfter INSTEXIT.CMD completes, the install shield is restored and \nthe system automatically restarts.\n\n   * Selective Install for Networking: The installation program \n     calls the INSTEXIT.CMD file at the end of Selective Install\n     if the file exists in the root directory of the installation \n     volume. If the file is found, the install shield is disabled. \n     The following parameters are passed:\n       1. The target drive letter (example C).\n       2. The CD-ROM drive letter (example E).\n       3. The word SELECT to indicate the exit is being called by \n          Selective Install for Networking.\n\nExample call:\n\ninstexit.cmd C E SELECT\n\nThe INSTEXIT.CMD return code is logged in OS2INSTALLNPINST.PRD. \nAfter INSTEXIT.CMD completes, the install shield is restored and \nthe system automatically restarts.\n\nNotes:\n\n  1. You must remove the exit command at the end of installation or\n     properly use the third input parameter to ensure proper \n     processing in the exit for all three types of calls (Phase 1, \n     Phase 3, and Selective Install for Networking).\n\n  2. During the call in Phase 3, some files for products installed \n     might be locked until the system is restarted.\n\n  3. During Phase 1, user input prompts must be written using \n     VIO calls. During Phase 3 and Selective Install for Networking, \n     input can be made using REXX I/O methods. Alternately, REXX can \n     call a program executable file to do user prompting.\n\n  4. The install shield is disabled during Phase 3 and Selective \n     Install for Networking so your exit command can prompt users to \n     insert your device driver diskette or provide other instructions. \n     When the install shield is disabled, users can see the WSeb \n     C-Pak2 Desktop. Discourage users from accessing the Desktop when \n     the install shield is disabled.\n\n2.9.3 Sample INSTEXIT.CMD File\n\nYou can use the following sample file as a template.\n\n/* REXX COMMAND FILE                                         */\n/* Installation Exit                                         */\nparse arg targetdrive cddrive installphase\nif installphase = &amp;#039;PHASE1&amp;#039; then do\n /* phase 1 processing */\nend\nif installphase = &amp;#039;PHASE3&amp;#039; | installphase = &amp;#039;SELECT&amp;#039; then do\n  /* phase 3 and selective install for networking processing */\n     end\nif installphase = &amp;#039;PHASE3&amp;#039; then do\n /* phase 3 specific processing */\nend\nreturn 0\n\n2.10 Installing the WSeb C-Pak2 using CID\n-----------------------------------------\n\nThis section explains CID installation issues that were not included \nwith the README.CID file (see the section named README files).\n \nNote: \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\n2.10.1 CID migration of a C-Pak1 NLV version to a \nC-Pak2 US-English version\n\nSome versions of C-Pak1 do not have an equivelant version of C-Pak2.\nIn these circumstances, migrate to the US-English version of C-Pak2.\nDuring a CID install of Netscape 4.61, you would normally use the\n/A:U parameter to migrate to the updated Netscape in C-Pak2. This \nhowever fails in this instance because you are migrating from one \nlanguage to a different language. For this situation, use the /A:I \nparameter as if this was an initial installation, and the migration \ncompletes successfully.\n\n2.10.2 Performance Tuning Assistant\n\nNote that the Performance Tuning Assistant (NSTUNE.EXE) is now \ninformational only. It provides a starting point from which you\ncan begin tuning your servers and clients, but the &quot;Apply&quot; button\nhas been disabled and the program does not make changes to your\nfiles.\n\nIf you install one of the following components using CID and plan \nto run the Performance Tuning Assistant, and if you want the \nPerformance Tuning Assistant to consider that component, you must \ncreate a file named NPCONFIG.CFG in the OS2INSTALL directory on \nthe root drive of your system. This file contains information about \nthe component that the Performance Tuning Assistant uses. Available \ncomponents include:\n\n   * Remote Access Services\n   * Personally Safe &amp;#039;n&amp;#039; Sound\n\nTo create a NPCONFIG.CFG file:\n\n  1. Create a blank document with a text editor.\n  2. Add the following line:\n\n      All_Products=[component]\n\n     The parameters for the component are as follows:\n\n     PPPSRV (Remote Access Services)\n\n     PSNS (Personally Safe &amp;#039;n&amp;#039; Sound)\n     Note:\n          You can add more than one component to the All_Products \n          line by separating each parameter with spaces.\n  3. Save the file as C:OS2INSTALLNPCONFIG.CFG (where C: is \n     the drive letter to which you installed).\n\n2.10.3 ClassPath entries\n\nIf you perform a CID installation of IBM OS/2 Warp Developer Kit, \nJava Technology Edition, Version 1.1.8 (JDK) to a volume other than \nthe boot volume, verify that the ClassPath entry in the CONFIG.SYS \nfile is correct after installation. If the ClassPath entry points \nto the JAVA11 directory on the boot volume, correct the entry as \nfollows:\n\n  1. Open the CONFIG.SYS file in a text editor.\n  2. Find the ClassPath entry.\n  3. Change the drive letter from the boot volume to the volume \n     on which you installed the JDK.\n  4. Save the CONFIG.SYS file, and then restart the system.\n\n2.11 Troubleshooting installation\n---------------------------------\n\nThere are problems that might occur in certain circumstances during\ninstallation of the WSeb C-Pak2. This section lists some of the \nknown installation problems.\n\n2.11.1 Installing the Java demos on a drive other than the boot drive\n\nIf you do not install the IBM OS/2 Warp Developer Kit, Java \nTechnology Edition, Version 1.1.8 (Java Technology Edition) on the \nboot drive (for example, C:), the Java demos do not install correctly. \nIf you install the Java Technology Edition on a drive other than the \nboot drive and you want the demos, you must install the Java \nTechnology Edition using Selective Install.\n\nIf you install the Java Technology Edition on the boot drive, the \ndemos install correctly.\n\n2.11.2 WINOS2 installation dialog box\n\nWhen installing one language&amp;#039;s version of WINOS2 over another&amp;#039;s, you \nmight see a dialog box titled &quot;Display Driver Install&quot; that \nnotifies you that the version of a file being installed is older than \nthe version of the file that is already installed. The dialog box \nprompts you for verification that you want to overwrite the target \nfile. The correct response is to accept the version being installed.\n\n2.11.3 Volume and partition errors\n\nYou might experience problems during installation if your system BIOS \nis unable to handle Logical Block Addressing (LBA) for drives over a\nparticular size. This might cause the following errors:\n\n   * LVM does not allow bootable volumes to be created past the \n     first 1024 cylinders of a disk, even though LBA mode is enabled \n     in the BIOS. An error message might appear stating that bootable \n     partitions must reside within the first 1024 cylinders of the disk.\n   * Installation proceeds normally through the Phase 1 (text mode). \n     When you restart the system as instructed, any of the following \n     errors might occur:\n        o Missing operating system. System halted message appears\n        o Boot Manager reports selected partition not formatted, even\n          though the partition is formatted and can be accessed when \n          the system is booted from diskettes.\n        o Systems hangs at blinking cursor. ## OS/2 logo never \n          appears.\n\nIf any of these problems occur, try the following solutions:\n\n   * Make sure LBA mode is enabled within the system BIOS for your\n     system. See the documentation that came with your system for \n     details on how to do this.\n\n     Note:\n          If you make changes to the LBA settings in BIOS, you must\n          repartition the hard disk.\n   * Contact the system manufacturer for a BIOS update.\n   * Common drive limits are 4.3GB and 8.4GB for newer systems. Check \n     the documentation that came with your system or with your system\n     manufacturer to determine the largest bootable device that your \n     system supports.\n   * Put the boot volume within the first 2GB of the drive.\n   * Disable LBA in the system BIOS, and ensure that the boot volume\n     resides within the first 500M of the drive.\n\n     Notes:\n\n       1. If you make changes to the LBA settings in BIOS, you must\n          repartition the hard disk.\n\n       2. Some drives have jumpers that can be set to overcome \n          incompatible BIOS. Check the drive documentation for details.\n\n       3. Setting these jumpers typically reduces the usable space on \n          the drive and requires you to repartition the drive.\n\n2.11.4 Error Code 1208 installing File and Print Services\n\nIf the available space on the installation volume is between 4096MB and\n4098MB, the WSeb C-Pak2 might fail to install. The resulting error \nmessage indicates that File and Print Services failed to install with \nerror code 1208.\n\nTo solve the problem, copy one or more large files to a temporary \ndirectory on the installation volume until the available space on the \nvolume is less than 4095MB. Then start the installation process again.\n\nAfter the WSeb C-Pak2 is installed successfully, remove the large \nfiles that you copied to the temporary directory.\n\n2.11.5 Error message from the IBMINT13.I13 driver\n\nThe following message is displayed if the IBMINT13.I13 driver \nencounters a drive whose geometry cannot be determined or the drive \nis greater than 8GB:\n\n SYS732: IBMINT13.i13 found a drive greater than 8GB\n\nThis message indicates there is a large drive on the system and it\nrequires the appropriate OS/2 device driver to operate it. Refer \nto the section &quot;Modifying the installation diskettes&quot; for new \nhardware for details on how to correct this problem.\n\n2.11.6 IBM Ultrabay(TM) and WarmSwap problems on IBM &quot;T&quot; and \n600-line ThinkPad computers\n\nIf you installed the appropriate UltraBay and WarmSwap support on \na &quot;T&quot; or 600-line ThinkPad computer, the secondary IDE channel must be \nenabled in order for WarmSwap to function correctly.\n\nTo enable the secondary IDE channel, the Configuration Utility \nfor DOS must be installed. If you need instructions on how to install \nthe Configuration Utility for DOS, refer to its manual. If this utility \nis already installed, enable the secondary IDE channel by completing \nthe following steps:\n\n  1. Open a DOS window and go to the directory where the PS2.EXE is\n     located.\n  2. Type the following command:\n\n     PS2.EXE ? IDE2\n\n     This command provides the information on the current secondary \n     IDE state. If the current state is Enable, go to step 5.\n  3. If the current state is Disable, you must change it to Enable\n     by entering the following command from the DOS command line:\n\n     PS2.EXE IDE2 Enable\n\n  4. Go to step 2 to verify if secondary IDE is enabled.\n  5. Close the DOS session. Reboot the ThinkPad if there was a \n     request in step 3.\n\n------------------------------------------------------------------------\n\n3.0 OPTIONAL SOFTWARE\n---------------------\n\nThe WSeb C-Pak2 CD includes support for the following optional \nsoftware:\n\n   * Universal Serial Bus (USB) Devices\n   * Yamaha PCI audio adapters  \n   * Ensoniq PCI audio adapters   \n   * TrackPoint IV support\n\n3.1 USB Support\n---------------\n\nThe USB base device drivers support the keyboard, mouse, speakers,\nmodem, floppy disk drives, LS-120 drives, ZIP 100 drives, ZIP 250 \ndrives, CD-ROM drives and CD/RW drives.\n\n3.1.1 Activating USB support\n\nThe base USB stack and device drivers are already installed on \nyour hard file. To activate the stack and device drivers, follow\nthe instructions below. You must activate the base USB stack. \nActivating the base USB device drivers is optional.\n\nTo activate the base USB stack (required):\n\n  1. Remove the REM from the following statements in the \n     CONFIG.SYS file:\n\n       REM BASEDEV=USBUHCD.SYS\n       REM BASEDEV=USBD.SYS /REQ:USBUHCD$\n       REM BASEDEV=USBHID.SYS\n\n  2. Save the CONFIG.SYS file and reboot.\n\nTo activate the base USB device drivers (optional):\n\n  1. In the CONFIG.SYS file, remove the REM for each of the \n     devices you want to use. The devices in the CONFIG.SYS \n     file are:\n\n       REM DEVICE=D:OS2BOOTUSBCOM.SYS     (Serial Port)\n       REM BASEDEV=USBMSD.ADD                (FDD, LS-120, ZIP drives)\n       REM BASEDEV=USBCDROM.ADD              (CDROM)\n       REM DEVICE=D:OS2BOOTUSBKBD.SYS     (Keyboard)\n       REM DEVICE=D:OS2BOOTUSBMOUSE.SYS   (Mouse)\n\n  2. Save the CONFIG.SYS file and reboot.\n\n3.1.2 USB audio\n\nTo install support for USB audio:\n\n  1. Insert the WSeb C-Pak2 CD.\n  2. At a command prompt, change to the x:optionsUSBaudio \n     directory, where x: is the CD-ROM drive.\n  3. Type MINSTALL.\n\n3.1.3 USB printer support\n\nTo install or upgrade USB printer support:\n\n  1. Open an OS/2 Command Line window.\n  2. Using the MD command, create a temporary work directory\n     on your hard disk and CD into it.\n  3. From the newly-created temporary work directory created \n     in step 2, type the following command:\n\n     x:OPTIONSUSBPRINTUSBPRT yy\n\n     Where x: is the drive letter assigned to your CD-ROM \n     drive, and yy is the national language you wish to install\n     (for example, set yy to EN to install English).\n  4. Open the existing printer object properties window. If you \n     do not have an existing printer object, create a new one.\n  5. Select the Output Port page.\n  6. Right-click on the LPT1 port icon, and select the Install \n     menu option. Once the dialog has opened, click Install \n     new port.\n  7. Once the Install New Port dialog opens, select the New port \n     drivers radio button in the Port Drive Selection section, \n     and enter the path to your temporary working directory into \n     the Directory field.\n  8. Click Refresh.\n  9. Select the USB port and click Install.\n 10. Shutdown and restart your operating system after you have \n     finished.\n\n3.2 PCI Yamaha YMF724 (DS-1) audio\n----------------------------------\n\nTo install support for PCI Yamaha YMF724 (DS-1) audio:\n\n  1. Insert the WSeb C-Pak2 CD.\n  2. At a command prompt, change to the x:optionsYamaha \n     directory, where x: is the CD-ROM drive.\n  3. Type MINSTALL.\n\n3.3 PCI Ensoniq ES1371 audio\n----------------------------\n\nTo install support for PCI Ensoniq ES1371 audio:\n\n  1. Insert the WSeb C-Pak2 CD.\n  2. At a command prompt, change to the x:optionsEnsoniq \n     directory, where x: is the CD-ROM drive.\n  3. Type MINSTALL.\n\n3.4 TrackPoint IV Support\n-------------------------\n\nTo install TrackPoint IV support:\n\n  1. Insert the WSeb C-Pak2 CD.\n  2. At the command prompt, change to the x:optionsTP4zz\n     directory, where x: is the CD-ROM drive and zz is the\n     national language.\n  3. Type INSTALL.   \n \n--------------------------------------------------------------------\n\n4.0 INSTALLING OTHER SOFTWARE\n-----------------------------\n\nYou might need to take some extra steps when installing certain\nother software packages on the WSeb C-Pak2.\n\n4.1 Installing IBM OS/2 Warp Developer Kit, Java(R) 2 \nTechnology Edition, Version 1.3\n--------------------------------------------------\n\nNetscape Communicator must be installed on your system before\nyou can install IBM OS/2 Warp Developer Kit, Java 2 Technology \nEdition, Version 1.3 (IBM Developer Kit V1.3) on the WSeb C-Pak2.\nTo install the IBM Developer Kit:\n\n  1. Insert the WSeb C-Pak2 CD.\n  2. Open an OS/2 window.\n  3. Type J13KICK on the command line.\n  4. Follow the installation instructions on the screen.\n\n4.1.1 Setting up font directories for OS/2 Warp Developer Kit,\nJava 2 Technology Edition, Version 1.3\n\nBy default, OS/2 Warp Developer Kit, Java 2 Technology Edition,\nVersion 1.3 assumes that the system fonts are installed on the\nboot drive in the PSFONTS directory. If you install fonts on \nother drives, including, for example, the JAVA13JRELIBFONTS\ndirectory, you must set the JAVA_FONTS environment variable in\nthe CONFIG.SYS file.\n\nFor example, if you install OS/2 on the C: drive, then you \ninstall some Chinese OS/2 system fonts on the E: drive, then \nyou install the Java fonts on the D: drive, you must use the \nJAVA_FONTS variable. Otherwise, the Chinese characters might\nnot display correctly in programs that use the Java GUI \n(graphical user environment), such as TCPCFG2 or LVMGUI. To\ncorrect this, you must add the following line to your \nCONFIG.SYS file:\n\nSET JAVA_FONTS=C:PSFONTS;E:PSFONTS;D:JAVA13JRELIBFONTS;\n\nYou must restart your system for the change to take effect.\n\n4.2 Installing Java 1.1.8 components\n------------------------------------\n\nThe WSeb C-Pak2 automatically installs the Java 1.1.8 Runtime,\nRMI Runtime and the Swing Runtime components. The runtime and \ntoolkit components have been updated to the o118-20001004 \nservice level.\n\nThe Debugger, Toolkits and Samples are not automatically \ninstalled from the WSeb C-Pak2 installation program. If you want\nto install these additional components, follow these steps:\n\n  1. Insert the WSeb C-Pak2 CD.\n  2. Create a temporary directory on a drive with approximately\n     100MB of free disk space.\n  3. CD into this directory and run the following commands:\n\n     y:javainrt -d\n     y:javainsr -d -ov\n     y:javainrm -d -ov\n     y:javainst -d -ov\n     y:javaintk -d -ov\n\n     Where y: is the CD-ROM drive.\n  4. Type install from the temporary directory. This starts\n     Netscape, which is used to install the rest of the Java \n     components.\n\n4.3 Updating Java 1.1.8 \n-----------------------\n\nThe Convenience Package includes Java (TM) 1.1.8 at the latest\nservice level as of the date of the Convenience Package. Because \nJava 1.1.8 may be frequently updated, there may be updates to \nJava 1.1.8.\n\nThe following are the most recent version of the Java 1.1.8 \nupdate files:\n\n   * runtime.exe            Runtime files which are always required\n   * toolkit.exe            Toolkit required to develop Java programs\n   * samples.exe            Sample Java programs\n   * os2jre.exe             Java Runtime Environment if required\n   * rmi-iiop-toolkit.exe   Remote Method Invocation - \n                            Internet Inter Orb Protocol if required\n\nThese files can be found at the following ftp site:\n\n &lt;a href=&quot; ftp://ftp.hursley.ibm.com/pub/java/fixes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; ftp://ftp.hursley.ibm.com/pub/java/fixes&lt;/a&gt;\n\nTo update Java 1.1.8, use the following steps after Convenience \nPackage installation:\n\n\n  1. Stop any JVMs that use files in the JAVA11 directory \n     before updating Java 1.1.8.\n  2. Copy the update file or files to the root directory \n     where Java 1.1.8 is installed. For example, if Java 1.1.8 \n     is installed in the D:JAVA11 directory, copy \n     RUNTIME.EXE to D:.\n  3. Type the following command from an OS/2 command line \n     to run RUNTIME.EXE:\n \n     runtime -o\n\n  4. Perform each desired update in turn.\n\nThe Java 1.1.8 directories and files are automatically updated.\n\n4.4 UDF restrictions in PM mode\n-------------------------------\n\nThe current version of UDF file system driver does not \nsupport PMFORMAT and PMCHKDSK utilities. You cannot use a \nPM application to:\n\n   * Format (PMFORMAT) a writable CD or DVD.\n   * Check disk (PMCHKDSK) a CD or DVD.\n\n4.5 Migrating LAN services\n--------------------------\n\nNote: \n     WSeb C-Pak2 migration is supported only over a corresponding\n     C-Pak1 system. Otherwise, you must format the operating system\n     partition.\n\nCID installation of IBM LAN service components in unattended mode \ninvolves use of response files. Sample response files are\navailable on the OS/2 Installation CD.\n\nUse the response files for an initial CID installation of \nWSeb C-Pak2. When migrating, use LANINST on a server machine to\ncreate both server and client response files.\n\nWhen installing LAN service components on a system already \ninstalled,you cannot omit any components that were installed \npreviously.\n\nWhen running LANINST to create a server response file, use the\n&quot;Install or remove a component&quot; and &quot;Configure a component&quot; \noptions to apply the changes.\n\nFor CID migration on a server or client, select the &quot;Update&quot; or \n&quot;Install if required&quot; option for migrating currently installed \ncomponents to the new level being installed.\n\n4.6 Running a DB/2 server over NetBIOS/TCPBEUI on WSeb C-Pak2\n-------------------------------------------------------------\n\nA DB/2 server running on an OS/2 machine and using \nNetBIOS/TCPBEUI as the underlying transport mechanism, needs \nresources such as NAMES,SESSIONS, NCBS and so on. Because the \nLAN Server is also running on the same machine, the DB/2 server \nmight not start successfully because of contention for these \nresources. Because of this contention, you must configure an \nadditional logical adapter for the transport mechanism used.\n\nThere are two workarounds to the above problem:\n\n  1. Use two network adapters, configured with TCP/IP and \n     NETBIOS respectively.\n  2. Create another logical instance for the single adapter.\n\nIf using the second workaround, make the following additions\nin the Protocol.ini file to create a logical adapter:\n\n  1. Add the following line in the [NetBIOS] section:\n\n     [netbios]\n\n     Adapterx=netbeui$,x\n\n     Where x is the logical adapter number.\n  2. Add the following line in the [netbeui_nif]/[tcpbeui_nif]\n     section:\n\n     Bindings=IBMy_nif,IBMy_nif\n\n     Where y is the token ring / Ethernet driver name.\n  3. Save the changes in the updated Protocol.ini file.\n  4. Run LANINST to configure the server and adapters again.\n\n     This step modifies the network adapters and protocols in MPTS\n     and also updates the IBMLAN.INI and CONFIG.SYS files.\n  5. Shutdown and restart the system.\n\n4.7 Installing WorkSpace On-Demand 2.0 on a WSeb C-Pak2 server\n--------------------------------------------------------------\n\nTo install IBM WorkSpace On-Demand 2.0 OS/2 Client (WorkSpace) \non a WSeb C-Pak2 server, you must take these extra steps.\n\nThere are two methods for installing WorkSpace On-Demand 2.0 \non a WSeb C-Pak2 server. The first is a CID installation;\nthe second is a manual installation.\n\n4.7.1 CID installation of WorkSpace On-Demand 2.0\n\nTo install WorkSpace using a CID installation, you must use\na version of SYSLEVEL.OS2 from a previous OS/2 Warp Server \nfor e-business system.\n\nSYSLEVEL.OS2 is in the OS2INSTALL directory on your system&amp;#039;s\nOS/2 boot drive. When you have a copy of this file, \nfollow these steps:\n\n  1. Save your current SYSLEVEL.OS2 file by renaming it \n     to SYSLEVEL.ORG.\n  2. Copy the version of SYSLEVEL.OS2 from the previous OS/2 \n     Warp Server for e-business system to the OS2INSTALL \n     directory on the boot drive of your new machine.\n  3. Install WorkSpace on your new machine.\n  4. After you have restarted your system, delete the \n     SYSLEVEL.OS2 from the previous OS/2 Warp Server \n     for e-business system and rename SYSLEVEL.ORG back \n     to SYSLEVEL.OS2.\n\n4.7.2 Manual installation of WorkSpace On-Demand 2.0\n\nTo install WorkSpace manually, perform the following steps:\n\n  1. Insert the WorkSpace On-Demand 2.0 CD.\n  2. Enter CD x:, where x: is the drive letter assigned to \n     the CD-ROM drive.\n  3. Type the following command to start the installation:\n\n     install -nocheck\n\n  4. On the WorkSpace On-Demand Installation Panel, make sure \n     that none of the components listed in the Select IBM \n     WorkSpace On-Demand Manager section are selected. The \n     components are:\n        o Command Line Interface and API Upgrade\n        o Remote Boot Services Upgrade\n        o TCPIP (Required for DHCP Boot Support)\n\n     Again, make sure that these components are not selected.\n  5. Continue with installation.\n\n4.7.3 Recopying files after installing DOS Remote IPL Service\n\nIf you install DOS Remote IPL Service after you have installed \nthe WorkSpace On-Demand Windows Client Feature on the WSeb C-Pak2\nserver machine, certain files loaded by the  Windows Client \nFeature installed program will be removed. As a result,","torrent":{"xt":"urn:btih:fb29bcf02fddc58a2eb96fbb384d833b7f6fa6b7","amp;dn":"OS2+Warp+Server+v4.52+%28Convenience+Package+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb29bcf02fddc58a2eb96fbb384d833b7f6fa6b7","infoHashBuffer":{"type":"Buffer","data":[251,41,188,240,47,221,197,138,46,185,111,187,56,77,131,59,127,111,166,183]},"announce":[],"urlList":[]}}