{"title":"Take_that-The_Circus - 2008 **NEW**","uid":4538624,"size":70905333,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb298c053b7d8a3da304bb2a567cdc1cde309dfc&amp;dn=Take_that-The_Circus+-+2008+%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BrandonStrike","files":-1,"time":1227843389,"description":"Take That arrive back in the spotlight with their fifth studio album, The Circus. After successfully effecting one of the greatest comebacks in pop history with 2006&amp;#039;s multi-platinum release, Beautiful World, Take That return with an album as romantic and epic as its colossal predecessor.\n\nBrimming with soaring ballads and catchy upbeat pop songs, The Circus sees a continuation of the musical growth of Take That. The release of their comeback album, Beautiful World, not only marked a triumphant return to form for the nation&amp;#039;s favourite boyband, but with tracks such as `Patience&amp;#039;, Take That proved that they had spread their wings and had become a credible vocal group. And, from the opening track of new album, The Circus&amp;#039;, Take That unleash their unmistakable sound with `The Garden&amp;#039;, an ambitious ballad that is filled with the same magic and intrigue as their mammoth 2007 hit single `Rule The World&amp;#039;. While Gary Barlow continues to take the lead vocally on most tracks, including the extravagant single `Greatest Day&amp;#039;, the rest of the band pop up sporadically to take centre stage and offer a refreshing change and depth to Take That&amp;#039;s established sound. Whilst the downhearted lament of `What Is Love&amp;#039; sees Howard Donald excel on leading vocals, Jason Orange stands forefront to demonstrate his vocal range on the Amy Winehouse inspired `How Did It Come To This&amp;#039;. As Mark Owen continues to take vocal duties on `Hello&amp;#039;, a bouncy pop chant that is reminiscent of Beautiful World&amp;#039;s smash hit `Shine&amp;#039;, the band as a whole excel with the storytelling style of `Julie&amp;#039;, a fitting sequel to Take That&amp;#039;s early `90s smash `Babe&amp;#039; that sees the band return to conquer the heart-wrenching ballad.\n\nTaking the complex vocal arrangements of their previous album and adding an array of descending chords and piano inflections, producer John Shanks returns from his successful work on Beautiful World for his second collaboration with the boys. By experimenting with their established style and sound Take That take a stylistic step forward and The Circus delivers an exciting and accomplished album that wholly suggests they are back for good.\n\nTrack List\t\n\n \n\n   1. The Garden\n   2. Greatest Day\n   3. Hello\n   4. Said It All\n   5. Julie\n   6. The Circus\n   7. How Did It Come To This\n   8. Up All Night\n   9. What Is Love\n  10. You\n  11. Hold Up A Light\n  12. Here","torrent":{"xt":"urn:btih:fb298c053b7d8a3da304bb2a567cdc1cde309dfc","amp;dn":"Take_that-The_Circus+-+2008+%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb298c053b7d8a3da304bb2a567cdc1cde309dfc","infoHashBuffer":{"type":"Buffer","data":[251,41,140,5,59,125,138,61,163,4,187,42,86,124,220,28,222,48,157,252]},"announce":[],"urlList":[]}}