{"title":"Fringe - Seasons 1 and 2","uid":14624514,"size":8659738450,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb6110b25b9a09f939267488578ff99e2c507e67&amp;dn=Fringe+-+Seasons+1+and+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":53,"time":1463286097,"description":"Fringe - Seasons 1 and 2\r\n\r\n\r\n Fringe follows the casework of the Fringe Division, a Joint Federal Task Force supported primarily by the Federal Bureau of Investigation, which includes Agent Olivia Dunham; Dr. Walter Bishop, the archetypal mad scientist; and Peter Bishop, Walter's estranged son and jack-of-all-trades. They are supported by Phillip Broyles (Lance Reddick), the force's director, and Agent Astrid Farnsworth (Jasika Nicole), who assists Walter in laboratory research. The Fringe Division investigates cases relating to fringe science, ranging from transhumanist experiments gone wrong to the prospect of a destructive technological singularity to a possible collision of two parallel universes. The Fringe Division's work often intersects with advanced biotechnology developed by a company called Massive Dynamic, founded by Walter's former partner, Dr. William Bell (Leonard Nimoy), and run by their common friend, Nina Sharp (Blair Brown). The team is also watched silently by a group of bald, pale men who are called &quot;Observers&quot;.\r\n\r\nSeason 1 introduces the Fringe Division as they investigate cases that form &quot;the Pattern&quot; geographically centered around Reiden Lake in New York state, many of which are orchestrated by an international network of rogue scientists known as ZFT (Zerstörung durch Fortschritte der Technologie, or in English, Destruction through Advancement of Technology), led by David Robert Jones (Jared Harris), who are preparing for a doomsday event. The ZFT threat appears to end when Peter kills Jones as he attempts travel to a parallel universe.[2] Olivia comes to learn she was a child test subject for Walter years ago for a nootropic drug, Cortexiphan, giving her weak psionic abilities.[3] Walter also struggles with adjusting to normal life in Peter's care after living seventeen years in a mental institution while hiding the fact that Peter is from the parallel universe, &quot;his&quot; Peter having died as a child.[2]\r\n\r\nIn Season 2, the occurrences are found to be in conjunction with activities of a parallel universe, which is plagued by singularities occurring at weakened points of the fabric between worlds; over there, scientists have developed an amber-like substance that isolates these singularities as well as any innocent people caught in the area on its release. The Fringe team deals with more cases that are leading to a &quot;great storm&quot; as the parallel universe appears to be at war with the prime one, engineered by human-machine hybrid shapeshifters from the parallel universe.[4] Walter is forced to tell Peter that he is from the parallel universe, a replacement for his own Peter, who died from a genetic disease. Walter had crossed over on the frozen ice of Reiden Lake in 1985 to administer the cure for the alternate version of Peter, but, after accidentally destroying a dose of the cure upon transport, he instead brought the boy across. On return, they fell through the ice but were saved by the Observer September (Michael Cerveris), who told Walter of the importance of &quot;the boy&quot;, which Walter took to mean Peter.[5] Walter's crossing is what caused the singularities in the parallel universe, with Reiden Lake at their epicenter. Walter has been looking for a sign of forgiveness in the form of a white tulip.[6]","torrent":{"xt":"urn:btih:fb6110b25b9a09f939267488578ff99e2c507e67","amp;dn":"Fringe+-+Seasons+1+and+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6110b25b9a09f939267488578ff99e2c507e67","infoHashBuffer":{"type":"Buffer","data":[251,97,16,178,91,154,9,249,57,38,116,136,87,143,249,158,44,80,126,103]},"announce":[],"urlList":[]}}