{"title":"The Pendragon Adventure - DJ MacHale (Audiobooks 1 to 8)","uid":4111620,"size":4188105810,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fc34169f960ad382d11772c585186ce9db4f11e4&amp;dn=The+Pendragon+Adventure+-+DJ+MacHale+%28Audiobooks+1+to+8%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mmmjello","files":104,"time":1207087008,"description":"The Pendragon Adventure is a fiction young adult book series of fantasy novels by D. J. MacHale. They follow the chronicles of Bobby Pendragon, a teenager who discovers that he, as well as his two best friends, Mark Dimond and Courtney Chetwynde, must try to save the universe. The first book, The Merchant of Death, was originally published in 2002 by Aladdin Paperbacks. The series has eight books thus far: The Merchant of Death, The Lost City of Faar, The Never War, The Reality Bug, Black Water, The Rivers of Zadaa, The Quillan Games, and The Pilgrims of Rayne. The title for the ninth book is Raven Rise, expected to be published May 20th, 2008. The series is planned to last ten books, one for each territory. Each book switches from a first-person perspective of Bobby&amp;#039;s journals to a narrative of Mark and Courtney&amp;#039;s lives. On his official site D. J. MacHale announced that the first graphic novel, based on the Pendragon series, would be released around the time of the 9th book. He also announced that a short series of books meant to be companions to the series will be released, the first of the companions to be released before the release of book ten.","torrent":{"xt":"urn:btih:fc34169f960ad382d11772c585186ce9db4f11e4","amp;dn":"The+Pendragon+Adventure+-+DJ+MacHale+%28Audiobooks+1+to+8%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc34169f960ad382d11772c585186ce9db4f11e4","infoHashBuffer":{"type":"Buffer","data":[252,52,22,159,150,10,211,130,209,23,114,197,133,24,108,233,219,79,17,228]},"announce":[],"urlList":[]}}