{"title":"Scientific Structuralism {BBS}","uid":6837510,"size":2730511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fce5fababcadb54a271bf70b4a6bfb9ffaf2d147&amp;dn=Scientific+Structuralism+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322057509,"description":"Recently there has been a revival of interest in structuralist approaches to science. Taking their lead from scientific structuralists such as Henri PoincarÃƒÂ©, Ernst Cassirer, and Bertrand Russell, some contemporary philosophers and scientists have argued that the most fruitful approach to solving many problems in the philosophy of science lies in focusing on the structural features of our scientific theories. Much of the work in scientific structuralism to date has been focused on the problem of scientific realism, where it has been argued that even in cases of radical theory change the most important structural features of predecessor theories are preserved. These structural realists argue that what our most successful theories get right about the world is these abstract structural features, rather than any particular ontological claims. More recently, philosophers of science have adopted structuralist approaches to many other issues in the philosophy of science, such as scientific explanation and intertheory relations. The nine articles collected in this volume, written by the leading researchers in scientific structuralism, represent some of the most important directions of research in this field. This book will be of particular interest to those philosophers, scientists, and mathematicians who are interested in the foundations of science.\nProduct Details\n\n    * Hardcover: 242 pages\n    * Publisher: Springer; 1st Edition. edition (November 1, 2010)\n    * Language: English\n    * ISBN-10: 9048195969\n    * ISBN-13: 978-9048195961","torrent":{"xt":"urn:btih:fce5fababcadb54a271bf70b4a6bfb9ffaf2d147","amp;dn":"Scientific+Structuralism+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fce5fababcadb54a271bf70b4a6bfb9ffaf2d147","infoHashBuffer":{"type":"Buffer","data":[252,229,250,186,188,173,181,74,39,27,247,11,74,107,251,159,250,242,209,71]},"announce":[],"urlList":[]}}