{"title":"J.J.C.Smart, J.J Haldane - Atheism and Theism.pdf","uid":8890373,"size":1072881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fda03ffdd9968619264f3293b5d7b37772980331&amp;dn=J.J.C.Smart%2C+J.J+Haldane+-+Atheism+and+Theism.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1378568182,"description":"In this book two philosophers, each committed to unambiguous versions of belief and disbelief, debate the central issues of atheism and theism. \n\nConsiders one of the oldest and most widely disputed philosophical questions: is there a God? \nPresents the atheism/theism issue in the form of philosophical debate between two highly regarded scholars, widely praised for the clarity and verve of their work. \nThis second edition contains new essays by each philosopher, responding to criticisms and building on their previous work.\n\nReview\n&quot;Smart and Haldane are both remarkable philosophers. Each in his own way possesses the rare combination of formidable dialectical skills, an original vision for philosophy, and immense personal integrity ... I do not see how anyone could read this book and not feel that it represents the finest kind of intellectual encounter ...&quot;Hilary Putnam, Harvard University &lt;!--end--&gt;\n&quot;Philosophers of both theistic and atheistic persuasions will find this important new debate on theism particularly interesting for themselves and for their students. Haldane an Smart show that the dispute over the existence of God is very much alive among the best philosophers at the end of the twentieth century.&quot; Linda Zagzebski, University of Oklahoma \n\n&quot;This book show contemporary academic philosophy at its best.&quot; Scientific and Medical Network Review\n\nFrom the Back Cover\nThe issue of whether or not there is a God is one of the oldest and most widely disputed philosophical questions. It is a debate that spreads far across the range of philosophical questions about the status of science, the nature of mind, the character of good and evil, the epistemology of experience and testimony, and so on. In this book two philosophers, each committed to unambiguous versions of belief and disbelief, debate the central issues of atheism and theism. Smart opens the debate by arguing that theism is philosophically untenable and seeks to explain metaphysical truth in the light of total science. Haldane continues the discussion by affirming that the existence of the world, and the possibility of our coming to have knowledge of it, depend upon the existence of a creating, sustaining, personal God. This is followed by replies, where each philosopher has the chance to respond and to defend his position. This second edition contains new essays by each philosopher, responding to criticisms and building on their previous work.","torrent":{"xt":"urn:btih:fda03ffdd9968619264f3293b5d7b37772980331","amp;dn":"J.J.C.Smart%2C+J.J+Haldane+-+Atheism+and+Theism.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda03ffdd9968619264f3293b5d7b37772980331","infoHashBuffer":{"type":"Buffer","data":[253,160,63,253,217,150,134,25,38,79,50,147,181,215,179,119,114,152,3,49]},"announce":[],"urlList":[]}}