{"title":"Functional Nanostructured Materials and Membranes for Water Trea","uid":15417340,"size":3232064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fda22b6b0db61511d5c65ab03c45c922d1f42bf8&amp;dn=Functional+Nanostructured+Materials+and+Membranes+for+Water+Trea&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469596530,"description":"Functional Nanostructured Materials and Membranes for Water Treatment - Mikel Duke et al. (Wiley-VCH, 2013).pdf\r\n\r\nMembranes have emerged over the last 30 years as a viable water treatment technology. Earth's population is growing and the need for alternative ways to generate potable water is rising. The recent advent of nanotechnology opens the door to improving processes in membrane\r\ntechnology, which is a promising step on the way to solving the earth's potable water problem. Current performance is enhanced and new concepts are possible by engineering on the nanoscale. This book presents key areas of nanotechnology such as fouling tolerant and robust membranes, enhanced destruction of pollutants and faster monitoring of water quality.\r\n\r\n'Functional Nanostructured Materials and Membranes for Water Treatment' is part of the series on Materials for Sustainable Energy and Development edited by Prof. G.Q. Max Lu. The series covers advances in materials science and innovation for renewable energy, clean use of fossil energy, and greenhouse gas mitigation and associated environmental technologies","torrent":{"xt":"urn:btih:fda22b6b0db61511d5c65ab03c45c922d1f42bf8","amp;dn":"Functional+Nanostructured+Materials+and+Membranes+for+Water+Trea","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda22b6b0db61511d5c65ab03c45c922d1f42bf8","infoHashBuffer":{"type":"Buffer","data":[253,162,43,107,13,182,21,17,213,198,90,176,60,69,201,34,209,244,43,248]},"announce":[],"urlList":[]}}