{"title":"Steve Goodman - Say It In Private (1977) MP3@320","uid":9633795,"size":75157680,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fde978406d043db547ed38f990fa3aca44de93d6&amp;dn=Steve+Goodman+-+Say+It+In+Private+%281977%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AaronVincent","files":16,"time":1392821676,"description":"Steve Goodman reached the charts with his first two albums for Asylum Records, Jessie's Jig &amp; Other Favorites (1975) and Words We Can Dance To (1976), and that may have convinced the label to spend more money on his next LP (money intended to be recoupable against royalties should the album take off, of course), because the sessions for Say It in Private appear to have been quite elaborate. For the first time since his second album, Somebody Else's Troubles (1973), Goodman had a real producer (i.e., somebody who produced records for a living), Joel Dorn, and among the six dozen singers and players who contributed to the sessions were plenty of arrangers and string players. Nevertheless, Say It in Private ended up being a fairly typical Steve Goodman album. In a sense, the cover art told the story. It featured a painting by Howard Carriker that replicated Jacques Louis David's famous 1793 portrait Death of Marat, in which French revolutionary and invalid Jean-Paul Marat was shown lying in his medicinal bath after having been assassinated. In Carriker's version, the body belonged to Goodman, who was alive and smiling. So, here was an expensive-looking illustration that was making a macabre joke, and the album was more of the same, really. For all the production and all those musicians, Goodman was still doing what he loved to do, writing a few modest, entertaining songs and gathering other ones from various genres. The covers included the 1913 ballad &quot;There's a Girl in the Heart of Maryland,&quot; which, despite the strings and chorus, was essentially a duet between Goodman's voice and Jethro Burns' mandolin; the 1936 country song &quot;Is It True What They Say About Dixie?,&quot; another frantic Goodman/Burns duet; Hank Williams' &quot;Weary Blues from Waitin'&quot;; and Smokey Robinson's account of romantic schizophrenia, &quot;Two Lovers.&quot; With his own pen, Goodman turned out a couple of warm love songs that were sequenced back to back at the start of the disc, &quot;I'm Attracted to You&quot; and &quot;You're the Girl I Love,&quot; followed by a novelty, &quot;Video Tape,&quot; and then the four cover tunes. Next came two consecutive musical obituaries, both of them surprising. &quot;Daley's Gone&quot; was this Chicago native's lament for the late Mayor Richard J. Daley, a man much despised by those of Goodman's generation in connection with his activities during the Democratic Convention of 1968. Even more personal was &quot;My Old Man,&quot; about Goodman's own father. Some relief was needed after that, and it came in the form of a folk anthem co-written by Goodman and his pal John Prine, &quot;The Twentieth Century Is Almost Over.&quot; Again, there was a big vocal chorus, but again the song was in some ways just a duet between Goodman and an acoustic musical instrument played by another mentor, in this case the banjo of Pete Seeger. There may have been 73 musicians in the credits for Say It in Private, but it still ended up sounding like an old-fashioned folk collection most of the time.","torrent":{"xt":"urn:btih:fde978406d043db547ed38f990fa3aca44de93d6","amp;dn":"Steve+Goodman+-+Say+It+In+Private+%281977%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde978406d043db547ed38f990fa3aca44de93d6","infoHashBuffer":{"type":"Buffer","data":[253,233,120,64,109,4,61,181,71,237,56,249,144,250,58,202,68,222,147,214]},"announce":[],"urlList":[]}}