{"title":"Josef Matthias Hauer, Atonale Music (Avant Garde Project 179)","uid":6413828,"size":386934105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe65fc81f7179d2185a219bdcc1b9b0dc3311d19&amp;dn=Josef+Matthias+Hauer%2C+Atonale+Music+%28Avant+Garde+Project+179%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"human2011","files":10,"time":1306094758,"description":"The Avant Garde Project is a series of 20th-century classical, experimental, and electroacoustic torrents digitized from LPs whose music has in most cases never been released on CD, and so is effectively inaccessible to the vast majority of music listeners today. This is wild stuff, so check it out if you've never heard this sort of music before. The analog rig used to extract the sound from the grooves is near state-of-the-art, producing almost none of the tracking distortion or surface noise normally associated with LPs.\n\nAGP1-157 are available for direct download at the Avant Garde Project mirror site.\n\nAGP148-173 are now available at http://ubu.com/sound/agp/index.html\n\nAGP169-178 are also available at http://thepiratebay.se/user/human2011\n\nNOTE: All of the AGP installments since 163 are 24-bit, 44.1 kHz FLAC files. The extra bits of quantization reveal more realistic detail using a 24-bit DAC and good audio equipment. To burn these tracks to CD, you will first have to convert them to 16-bit files. This is easily done using the converter tool in Foobar2000 or other software.\n\n=======================================\n\nAGP179 features the first set of twelve-tone compositions by the first person to invent a twelve-tone system of composition (a year or two before Schoenberg). The twenty piano pieces comprising Atonale Music, op. 20 were composed by Josef Matthias Hauer in 1920-22. More information about Hauer, his system of composition, and his interactions with Arnold Schoenberg can be found in the LP liner notes scanned in the PDF file included with this installment, and in the Wikipedia article on Josef Matthias Hauer.\n\nThis recording was performed by Joseph Kubera, produced by Tom Buckner, recorded by Gerald Oshita using high-quality equipment, and released on 1750 Arch Records in 1982 (S-1788). It has never to my knowledge been re-issued on CD. The recording sounds natural and honest, with a nice blend of detail and resonance. The transcription is clean, other than a few moments of tracking distortion in Nos. 9 and 19.\n \nHauer's music is certainly not for everyone, but it can be thrilling in its unassuming way if you're in the mood. It's remarkably consonant for music with no tonal center, and I think its consonance better enables one to relish the unorthodox harmonic progressions, which are brought out very nicely by the timbre and sustain of the piano. If you like this music, more Hauer is available on CD, including another recording of Atonale Music, performed by Steffen Schleiermacher.\n\nEquipment used for A/D conversion: Linn Akiva phono cartridge, Linn LP12/Lingo turntable, Linn Ekos SE tonearm, Audioquest LeoPard tonearm cable, PS Audio PS2 preamplifier, Kimber PBJ interconnect, M-Audio Audiophile USB A/D converter.\n\n01 - Nos. 1-4 [9:51]\n02 - Nos. 5-8 [6:08]\n03 - Nos. 9 [3:12]\n04 - Nos. 10-11 [4:28]\n05 - Nos. 12-14 [6:47]\n06 - Nos. 15-16 [6:41]\n07 - Nos. 17-20 [8:008]\n\nNOTE: To the best of my knowledge, these recordings are not currently available commercially. If you know otherwise, please let me know ASAP, as I do not wish any artists to be deprived of the royalties that they so richly deserve.\t","torrent":{"xt":"urn:btih:fe65fc81f7179d2185a219bdcc1b9b0dc3311d19","amp;dn":"Josef+Matthias+Hauer%2C+Atonale+Music+%28Avant+Garde+Project+179%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe65fc81f7179d2185a219bdcc1b9b0dc3311d19","infoHashBuffer":{"type":"Buffer","data":[254,101,252,129,247,23,157,33,133,162,25,189,204,27,155,13,195,49,29,25]},"announce":[],"urlList":[]}}