{"title":"God is Just - Steve Halbrook","uid":11773440,"size":9529683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fed2c1add6038cb449a0de7e6d746cd91b9c56de&amp;dn=+God+is+Just+-+Steve+Halbrook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168154,"description":"\nBiblical Theocracy, Justice, and Slavery VS. Humanistic Theocracy, Justice, and Slavery\n\nThis book is a defense of biblical civil law, on topics despised not only by humanists, but by professing Christians. It is, in short, theonomic apologetics. God is Just takes our culture and its attacks on the Bible to task. It defends biblical theocracy, justice, and slavery, and cuts humanistic opposition down to size by its own self-destructive foolishness, and, most importantly, by the sword of God?s word.\n\nThis thesis ethically defends the civil code as revealed by God in the Older Testament against humanism. By humanism we mean the philosophy that says &quot;man is the measure of all things&quot; instead of God. This work is applicable to all societies, but specifically targets secular-humanistic America, where there is a simultaneous increase in hostility to a biblical view of state justice and an increase in state injustice (as evidenced in state-sanctioned genocide of unborn children, the horrendous prison system, attacks on Christianity, etc.).\n\nWe defend those areas of the O.T. civil code most frequently under attack: the civil code's theocratic nature, crime and punishment (especially capital sanctions), and slave laws. The methodology for this defense involves demonstrating the O.T. civil code is just by presupposing it as God's divinely revealed truth, and reducing humanist objections---and humanistic alternatives---to absurdity.\n\nAlong the way, we expound certain areas of the O.T. civil code, clear up misconceptions about them, and explain their benefits to society. We ultimately demonstrate that in matters of the state, God---and only God---is just.\n\nThis thesis is written for Christians, in hopes that the church will wake-up and consistently recognize Christ's Lordship in the sociopolitical realm. This thesis concludes that indeed God and God alone is just, and that man is naturally unjust. Attempts by humanists to escape biblical theocracy, biblical crime and punishment, and biblical slavery do not result in the hoped-for results, but only in perverse, humanistic versions of theocracy, crime and punishment, and slavery.\n\n\nAbout the author:\nSteve C. Halbrook writes for, and manages Theonomy Resources. He is also a teacher for The New Geneva Christian Leadership Academy. He holds an M.A. in Government from Regent University?s Robertson School of Government, with a focus on biblical civil government. Halbrook?s master?s thesis was ?God is Just: A Defense of the Old Testament Civil Laws,? which this book is an expansion of","torrent":{"xt":"urn:btih:fed2c1add6038cb449a0de7e6d746cd91b9c56de","amp;dn":"+God+is+Just+-+Steve+Halbrook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fed2c1add6038cb449a0de7e6d746cd91b9c56de","infoHashBuffer":{"type":"Buffer","data":[254,210,193,173,214,3,140,180,73,160,222,126,109,116,108,217,27,156,86,222]},"announce":[],"urlList":[]}}