{"title":"WinRAR 3.91 beta1 x86-x64 PreRegged","uid":5165572,"size":3140088,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:feebc335009dd26eb6e628ff4b188f38f523f9ad&amp;dn=WinRAR+3.91+beta1+x86-x64+PreRegged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":4,"time":1258388974,"description":"WinRAR 3.91 beta1 x86 and x64 already Registered (Corporate).\n\nInstall it as the regular one and it works without need to use any KeyGen or Patch.\n\nOnly added the rarreg.key to the original setup, so you don't need to search for it. All the other files inside are the original ones, not patched, so you should not have any problem with Antiviruses.\n\nIf you don't trust it, download the original Setup from RarLabs Site and copy the RarReg.key file in the install Dir (usually C:Program FilesWinRAR), or use the included KeyGen to Register it.\n\n\n\nWinRAR - What's new in the latest version\n\n\n   Version 3.91 beta 1\n\n   1. This version can decompress 7-Zip archives created with\n      LZMA2 algorithm.\n\n   2. Now a password is requested only once when unpacking 7z archives\n      with encrypted file names from context menu. WinRAR 3.90 asked it\n      twice.\n\n   3. This version can unpack tar.bz2 archives consisting of several\n      smaller bz2 streams merged together. Previous versions unpacked\n      only the first nested bz2 stream in such composite archive.\n\n   4. WinRAR displays CRC32 of files inside of usual .gz (not .tar.gz)\n      archives. Previous versions left this field blank for GZIP files.\n\n   5. Bugs fixed:\n\n      a) WinRAR 3.90 displayed &quot;Save&quot; button instead of &quot;Open&quot; or &quot;OK&quot;\n         in &quot;Find archive&quot; dialog (&quot;Open archive&quot; command in &quot;File&quot; menu\n         and &quot;Browse...&quot; command in archiving dialog);\n\n      b) WinRAR could display incorrect file names when browsing malformed\n         ZIP archives;\n\n      c) WinRAR 3.90 failed to decompress LZH archives created with\n         &quot;-lh7-&quot; algorithm;\n\n      d) WinRAR 3.90 could fail to delete a part of files after archiving\n         if delete to Recycle Bin was enabled. This bug was present\n         when working in Windows XP, but not in Windows Vista and Windows 7;\n\n      e) when unpacking ISO file using WinRAR &quot;Extract files...&quot; command\n         in Explorer context menu, WinRAR could unpack same archived files\n         twice during the same operation. It displayed the overwrite prompt\n         when unpacking files for the second time;\n\n      f) hexadecimal search in WinRAR 3.90 &quot;Find&quot; command and console RAR\n         &quot;ih&quot; command failed to find matches if first byte in search string\n         was greater than 127.\n\n\nMore infos at\n  &lt;a href=&quot;\nhttp://www.rarlabs.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rarlabs.com&lt;/a&gt;\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n  &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n  &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n","torrent":{"xt":"urn:btih:feebc335009dd26eb6e628ff4b188f38f523f9ad","amp;dn":"WinRAR+3.91+beta1+x86-x64+PreRegged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feebc335009dd26eb6e628ff4b188f38f523f9ad","infoHashBuffer":{"type":"Buffer","data":[254,235,195,53,0,157,210,110,182,230,40,255,75,24,143,56,245,35,249,173]},"announce":[],"urlList":[]}}