{"title":"On Being Certain - Robert Burton","uid":14385669,"size":413537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff5104986589b2a59b30c93e23fde24817265e6d&amp;dn=On+Being+Certain+-+Robert+Burton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":3,"time":1461274786,"description":"You recognize when you know something for certain, right? You &quot;know&quot; the sky is blue, or that the traffic light had turned green, or where you were on the morning of September 11, 2001--you know these things, well, because you just do.\r\n\r\nIn On Being Certain, neurologist Robert Burton challenges the notions of how we think about what we know. He shows that the feeling of certainty we have when we &quot;know&quot; something comes from sources beyond our control and knowledge. In fact, certainty is a mental sensation, rather than evidence of fact. Because this &quot;feeling of knowing&quot; seems like confirmation of knowledge, we tend to think of it as a product of reason. But an increasing body of evidence suggests that feelings such as certainty stem from primitive areas of the brain, and are independent of active, conscious reflection and reasoning. The feeling of knowing happens to us; we cannot make it happen.\r\n\r\nBringing together cutting edge neuroscience, experimental data, and fascinating anecdotes, Robert Burton explores the inconsistent and sometimes paradoxical relationship between our thoughts and what we actually know. Provocative and groundbreaking, On Being Certain, will challenge what you know (or think you know) about the mind, knowledge, and reason.\r\n\r\nAs with all my eBook uploads, this is the DRM-free Kindle version. Enjoy!","torrent":{"xt":"urn:btih:ff5104986589b2a59b30c93e23fde24817265e6d","amp;dn":"On+Being+Certain+-+Robert+Burton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff5104986589b2a59b30c93e23fde24817265e6d","infoHashBuffer":{"type":"Buffer","data":[255,81,4,152,101,137,178,165,155,48,201,62,35,253,226,72,23,38,94,109]},"announce":[],"urlList":[]}}