{"title":"Detective Comics 571-578 (1987-02) (digital) (OkC.O.M.P.U.T.O.-N","uid":10501123,"size":311735986,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ff87d53e0595546424312b66e7f5aadba86b9dd4&amp;dn=Detective+Comics+571-578+%281987-02%29+%28digital%29+%28OkC.O.M.P.U.T.O.-N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1404700404,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the HD version.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n\n\n\n#571  The Scarecrow offers Jack Hogan, 3-time winner of the Indianapolis 500, the antidote for the Pharaoh of Phobias' new fear-removing drug\n\n#572  Extra-sized Anniversary issue! A mystery brings together the greatest sleuths of our time: Batman and Robin, Elongated-Man, Bradley P.I., and the greatest sleuth of all time, Sir Arthur Conan Doyle's Sherlock Holmes. \n\n#573  Batman and Robin try to figure out why the Mad Hatter held up the Liars' Club, how it relates to hats, and just where the Prince of Crowns will strike next. \n\n#574  As the Dark Knight carries a wounded Jason Todd to Leslie Thompkins for treatment, he reflects on his past and how he came to wear the cape and cowl. \n\n#575  &quot;Batman: Year Two&quot; part 1! In a story that takes place in the Batman's early years, the Dark Knight comes face-to-face with the Reaper, a vigilante who has become judge, jury, and executioner to the criminal underworld. \n\n#576  Batman pursues the Reaper, a diabolical menace to the criminal underworld as well as the Gotham P.D. But when Batman strikes a deal with Gotham's criminal element, he comes face-to-face with Joe Chill, the man who murdered Bruce Wayne's parents. &quot;Batman: Year Two&quot; part 2. \n\n#577  In order to catch the deadly Reaper, Batman must team up with the last person on Earth he wants to--Joe Chill, the man who murdered Bruce Wayne's parents! &quot;Batman: Year Two&quot; part 3. \n\n#578  &quot;Batman: Year Two&quot; concludes with a final showdown between the deadly Reaper and a young Batman, and only one of them is walking away from this confrontation alive. Plus, the ultimate fate of Joe Chill! \n\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O for this release.\n\n\n","torrent":{"xt":"urn:btih:ff87d53e0595546424312b66e7f5aadba86b9dd4","amp;dn":"Detective+Comics+571-578+%281987-02%29+%28digital%29+%28OkC.O.M.P.U.T.O.-N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff87d53e0595546424312b66e7f5aadba86b9dd4","infoHashBuffer":{"type":"Buffer","data":[255,135,213,62,5,149,84,100,36,49,43,102,231,245,170,219,168,107,157,212]},"announce":[],"urlList":[]}}