{"title":"Lemony Snicket - A Series of Unfortunate Events","uid":3997701,"size":2163810178,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ffd7ed1063b6f50bd487642ce4725be1e7a9f1fc&amp;dn=Lemony+Snicket+-+A+Series+of+Unfortunate+Events&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"meh_64_12","files":203,"time":1201395583,"description":"A Series of Unfortunate Events is a children&amp;#039;s book series of thirteen novels written by Daniel Handler under the pseudonym of Lemony Snicket, and illustrated by Brett Helquist. It is about the adventures of three children, the Baudelaire orphans, after the death of their parents in a fire. The setting of the series is anachronistic, and throughout the series there are many literary and cultural allusions.\n\nThe series&amp;#039; light humor has provoked split opinions - whilst it has won several awards and sold over 55 million copies, it has also been banned in some schools. The use of repetition in the series has also been criticized.\n\n\nAudio books\n\nMost of the series of unabridged audio books are read by actor Tim Curry, though Handler as Lemony Snicket reads books 3 to 5. Of narrating the audio books, Handler has said: &quot;It was very, very hard. It was unbelievably arduous. It was the worst kind of arduous.&quot; As such, future narrating duties were handed back to Curry, of whom Handler states: &quot;he does a splendid job&quot;. The ?Dear Reader? blurb is usually read by Handler (as Snicket) at the beginning, although it is missing in The Hostile Hospital. Handler usually reads the &amp;#039;To my Kind Editor&amp;#039; blurb about the next book at the end. Starting at &amp;#039;The Carnivourous Carnival&amp;#039; there is another actor who replaces Handler in reading the two blurbs, although they are skipped entirely in The Grim Grotto. All of the recordings include a loosely related song by The Gothic Archies, a novelty band, featuring lyrics by Handler&amp;#039;s Magnetic Fields bandmate Stephin Merritt.\n\n\nFull Gothic Archies album included.\n\n\nWikipedia: http://en.wikipedia.org/wiki/A_Series_of_Unfortunate_Events","torrent":{"xt":"urn:btih:ffd7ed1063b6f50bd487642ce4725be1e7a9f1fc","amp;dn":"Lemony+Snicket+-+A+Series+of+Unfortunate+Events","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd7ed1063b6f50bd487642ce4725be1e7a9f1fc","infoHashBuffer":{"type":"Buffer","data":[255,215,237,16,99,182,245,11,212,135,100,44,228,114,91,225,231,169,241,252]},"announce":[],"urlList":[]}}