{"title":"Maya Tudor - The Promise of Power. The Origins of Democracy in I","uid":10397435,"size":3200952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffe4fc6d4dc31d773e372dad43606219b1e2b814&amp;dn=Maya+Tudor+-+The+Promise+of+Power.+The+Origins+of+Democracy+in+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403286724,"description":"Description\nProduct Details\nBook Title: The Promise of Power: The Origins of Democracy in India and Autocracy in Pakistan\t\nBook Author: Maya Tudor (Author)\nHardcover: 254 pages\nPublisher: Cambridge University Press (April 29, 2013)\nLanguage: English\nISBN-10: 1107032962\nISBN-13: 978-1107032965\n\n===================================================================================\nBook Description\nPublication Date: March 29, 2013\nUnder what conditions are some developing countries able to create stable democracies while others have slid into instability and authoritarianism? To address this classic question at the center of policy and academic debates, The Promise of Power investigates a striking puzzle: why, upon the 1947 Partition of British India, was India able to establish a stable democracy while Pakistan created an unstable autocracy? Drawing on interviews, colonial correspondence, and early government records to document the genesis of two of the twentieth century's most celebrated independence movements, Maya Tudor refutes the prevailing notion that a country's democratization prospects can be directly attributed to its levels of economic development or inequality. Instead, she demonstrates that the differential strengths of India's and Pakistan's independence movements directly account for their divergent democratization trajectories. She also establishes that these movements were initially constructed to pursue historically conditioned class interests. By illuminating the source of this enduring contrast, The Promise of Power offers a broad theory of democracy's origins that will interest scholars and students of comparative politics, democratization, state-building, and South Asian political history.\n\n===================================================================================\nBook Description II\nUnder what conditions are some developing countries able to create stable democracies while others are perpetually prone to instability and authoritarianism? In The Promise of Power, Maya Tudor proposes a new understanding of the regime divergence between India and Pakistan following their twin independences in 1947.\n\n===================================================================================\nAbout the Author\nMaya Tudor is a Fellow in Politics at St John's College, Oxford University. Her dissertation, upon which this book is based, won the American Political Science Association's Gabriel Almond Award for the Best Dissertation in Comparative Politics.\n===================================================================================","torrent":{"xt":"urn:btih:ffe4fc6d4dc31d773e372dad43606219b1e2b814","amp;dn":"Maya+Tudor+-+The+Promise+of+Power.+The+Origins+of+Democracy+in+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffe4fc6d4dc31d773e372dad43606219b1e2b814","infoHashBuffer":{"type":"Buffer","data":[255,228,252,109,77,195,29,119,62,55,45,173,67,96,98,25,177,226,184,20]},"announce":[],"urlList":[]}}