{"title":"Possession","uid":9890562,"size":457703054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ffe6fba7c9f24cc0f9f83ee648e1bb9932106dd3&amp;dn=Possession&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":6,"time":1396639690,"description":"from wikipedia:\n\nPossession: A Romance is a 1990 bestselling novel by British writer A. S. Byatt that also won the 1990 Booker Prize. Written in response to John Fowles's The French Lieutenant's Woman the novel explores the postmodern concerns of that and other similar novels, which are often categorized as historiographic metafiction, a genre that blends approaches from both historical fiction and metafiction.\n\nThe novel follows two modern-day academics as they research the paper trail around the previously unknown love life between famous fictional poets, Randolph Henry Ash and Christabel LaMotte. Possession is set both in the present day and the Victorian era, pointing out the differences between the two time periods, and satirizing such things as modern academia and mating rituals. The structure of the novel incorporates many different styles, including fictional diary entries, letters and poetry, and uses these styles and other devices to explore the postmodern concerns of the authority of textual narratives. The title Possession highlights many of the major themes in the novel: questions of ownership and independence between lovers; the practice of collecting historically significant cultural artifacts; and the possession that biographers feel toward their subjects.\n\n\n\nbit rate 32kbps\n\nIt should be slow, so brace yourselves","torrent":{"xt":"urn:btih:ffe6fba7c9f24cc0f9f83ee648e1bb9932106dd3","amp;dn":"Possession","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffe6fba7c9f24cc0f9f83ee648e1bb9932106dd3","infoHashBuffer":{"type":"Buffer","data":[255,230,251,167,201,242,76,192,249,248,62,230,72,225,187,153,50,16,109,211]},"announce":[],"urlList":[]}}